{
  "verses": [
    "To all the buddhas, the lions of the human race,\nIn all directions of the universe, through past and present and future:\nTo every single one of you, I bow in homage;\nDevotion fills my body, speech and mind.",
    "Through the power of this prayer, aspiring to Good Action,\nAll the victorious ones appear, vivid here before my mind\nAnd I multiply my body as many times as atoms in the universe,\nEach one bowing in prostration to all the buddhas.",
    "In every atom preside as many buddhas as there are atoms,\nAnd around them, all their bodhisattva heirs:\nAnd so I imagine them filling\nCompletely the entire space of reality.",
    "Saluting them with an endless ocean of praise,\nWith the sounds of an ocean of different melodies\nI sing of the buddhas’ noble qualities,\nAnd praise all those who have gone to perfect bliss.",
    "To every buddha, I make offerings:\nOf the loveliest flowers, of beautiful garlands,\nOf music and perfumed ointments, the best of parasols,\nThe brightest lamps and finest incense.",
    "To every buddha, I make offerings:\nExquisite garments and the most fragrant scents,\nPowdered incense, heaped as high as Mount Meru,\nArranged in perfect symmetry.",
    "Then the vast and unsurpassable offerings—\nInspired by my devotion to all the buddhas, and\nMoved by the power of my faith in Good Actions—\nI prostrate and offer to all you victorious ones.",
    "Whatever negative acts I have committed,\nWhile driven by desire, hatred and ignorance,\nWith my body, my speech and also with my mind,\nBefore you, I confess and purify each and every one.",
    "With a heart full of delight, I rejoice at all the merits\nOf buddhas and bodhisattvas,\nPratyekabuddhas, those in training and the arhats beyond training,\nAnd every living being, throughout the entire universe.",
    "You who are like beacons of light shining through the worlds,\nWho passed through the stages of enlightenment, to attain buddhahood, freedom from all attachment,\nI exhort you: all of you protectors,\nTurn the unsurpassable wheel of Dharma.",
    "Joining my palms together, I pray\nTo you who intend to pass into nirvāṇa,\nRemain, for aeons as many as the atoms in this world,\nAnd bring well-being and happiness to all living beings.",
    "What little virtue I have gathered through my homage,\nThrough offering, confession, and rejoicing,\nThrough exhortation and prayer—all of it\nI dedicate to the enlightenment of all beings!",
    "Let offerings be made to buddhas of the past,\nAnd all who now dwell throughout the ten directions of this universe!\nLet all who are yet to come swiftly fulfil their wishes\nAnd attain the stages of enlightenment and buddhahood!",
    "Let as many worlds as there are in all the ten directions\nTransform into realms that are vast and utterly pure,\nFilled with buddhas who have sat before the mighty bodhi tree,\nAround them all their bodhisattva sons and daughters!",
    "Let as many sentient beings as there are in all the ten directions\nLive always and forever in happiness and health!\nLet all beings meet the Dharma\nThat befits them best! And so may all they hope for be fulfilled!",
    "As I practise the training for enlightenment,\nMay I recall all my previous births,\nAnd in my successive lives, through death and through rebirth,\nMay I always renounce the worldly life!",
    "Training in the footsteps of all the victorious buddhas,\nMay I bring Good Actions to perfection,\nAnd my moral conduct be taintless and pure,\nNever lapsing, and always free from fault!",
    "In the language of the gods, nāgas, and yakṣas,\nIn the language of demons and of humans too,\nIn however many kinds of speech there may be—\nI shall proclaim the Dharma in the language of all!",
    "Taming my mind, and striving in the pāramitās,\nI will never forget the bodhicitta;\nMay all my harmful actions and the obscurations they cause\nBe completely purified, every single one!",
    "May I be freed from karma, harmful emotions, and the work of negativity,\nAnd act for all beings in the world,\nJust like the lotus flower to which mud and water cannot cling,\nOr sun and moon that course unhindered through the sky.",
    "Throughout the reach and range of the entire universe\nI shall pacify completely the suffering of all the lower realms,\nI shall lead all beings to happiness,\nAnd work for the ultimate benefit of each and every one!",
    "I shall bring enlightened action to perfection,\nServe beings so as to suit their needs,\nTeach them to accomplish Good Actions,\nAnd continue this, throughout all the aeons to come!",
    "May I always meet and be accompanied by\nThose whose actions accord with mine;\nAnd in body, speech and mind as well,\nMay our actions and aspirations always be one!",
    "May I always meet spiritual friends\nWho long to be of true help to me,\nAnd who teach me the Good Actions;\nNever will I disappoint them!",
    "May I always behold the buddhas, here before my eyes,\nAnd around them all their bodhisattva sons and daughters.\nWithout ever tiring, throughout all the aeons to come,\nMay the offerings I make them be endless and vast!",
    "May I maintain the sacred teachings of the buddhas,\nAnd cause enlightened action to appear;\nMay I train to perfection in Good Actions,\nAnd practise these in every age to come!",
    "As I wander through all states of samsaric existence,\nMay I gather inexhaustible merit and wisdom,\nAnd so become an inexhaustible treasury of noble qualities—\nOf skill and discernment, samādhi and liberation!",
    "In a single atom may I see as many pure realms as atoms in the universe:\nAnd in each realm, buddhas beyond all imagining,\nEncircled by all their bodhisattva heirs.\nAlong with them, may I perform the actions of enlightenment!",
    "And so, in each direction, everywhere,\nEven on the tip of a hair, may I see an ocean of buddhas—\nAll to come in past, present and future—in an ocean of pure realms,\nAnd throughout an ocean of aeons, may I enter into enlightened action in each and every one!",
    "Each single word of a buddha’s speech, that voice with its ocean of qualities,\nBears all the purity of the speech of all the buddhas,\nSounds that harmonize with the minds of all living beings:\nMay I always be engaged with the speech of the buddhas!",
    "With all the power of my mind, may I hear and realize\nThe inexhaustible melody of the teachings spoken by\nAll the buddhas of past, present and future,\nAs they turn the wheels of Dharma!",
    "Just as the wisdom of the buddhas penetrates all future aeons,\nSo may I too know them, instantly,\nAnd in each fraction of an instant may I know\nAll that will ever be, in past, present and future!",
    "In an instant, may I behold all those who are the lions of the human race—\nThe buddhas of past, present and future!\nMay I always be engaged in the buddhas’ way of life and action,\nThrough the power of liberation, where all is realized as like an illusion!",
    "On a single atom, may I actually bring about\nThe entire array of pure realms of past, of present and future;\nAnd then enter into those pure buddha realms\nIn each atom, and in each and every direction.",
    "When those who illuminate the world, still to come,\nGradually attain buddhahood, turn the Wheel of Dharma,\nAnd demonstrate the final, profound peace of nirvāṇa:\nMay I be always in their presence!",
    "Through the power of swift miracles,\nThe power of the vehicle, like a doorway,\nThe power of conduct that possesses all virtuous qualities,\nThe power of loving kindness, all-pervasive,",
    "The power of merit that is totally virtuous,\nThe power of wisdom free from attachment, and\nThe powers of knowledge, skilful means and samādhi,\nMay I perfectly accomplish the power of enlightenment!",
    "May I purify the power of karma;\nDestroy the power of harmful emotions;\nRender negativity utterly powerless;\nAnd perfect the power of Good Actions!",
    "I shall purify oceans of realms;\nLiberate oceans of sentient beings;\nUnderstand oceans of Dharma;\nRealize oceans of wisdom;",
    "Perfect oceans of actions;\nFulfil oceans of aspirations;\nServe oceans of buddhas!\nAnd perform these, without ever growing weary, through oceans of aeons!",
    "All the buddhas throughout the whole of time,\nAttained enlightenment through Good Actions, and\nTheir prayers and aspirations for enlightened action:\nMay I fulfil them all completely!",
    "The eldest of the sons of all the buddhas\nIs called Samantabhadra: ‘All-good’—\nSo that I may act with a skill like his,\nI dedicate fully all these merits!",
    "To purify my body, my speech and my mind as well,\nTo purify my actions, and all realms,\nMay I be the equal of Samantabhadra\nIn his skill in good dedication!",
    "In order to perform the full virtue of Good Actions,\nI shall act according to Mañjuśrī's prayers of aspiration,\nAnd without ever growing weary, in all the aeons to come,\nI shall perfectly fulfil every one of his aims!",
    "Let my bodhisattva acts be beyond measure!\nLet my enlightened qualities be measureless too!\nKeeping to this immeasurable activity,\nMay I accomplish all the miraculous powers of enlightenment!",
    "Sentient beings are as limitless\nAs the boundless expanse of space;\nSo shall my prayers of aspiration for them\nBe as limitless as their karma and harmful emotions!",
    "Whoever hears this king of dedication prayers,\nAnd yearns for supreme enlightenment,\nWho even once arouses faith,\nWill gain true merit greater still",
    "Than by offering the victorious buddhas\nInfinite pure realms in every directions, all ornamented with jewels,\nOr offering them all the highest joys of gods and humans\nFor as many aeons as there are atoms in those realms.",
    "Whoever truly makes this Aspiration to Good Actions,\nWill never again be born in lower realms;\nThey will be free from harmful companions, and\nSoon behold the Buddha of Boundless Light.",
    "They will acquire all kind of benefits, and live in happiness;\nEven in this present life all will go well,\nAnd before long,\nThey will become just like Samantabhadra.",
    "All negative acts—even the five of immediate retribution—\nWhatever they have committed in the grip of ignorance,\nWill soon be completely purified,\nIf they recite this Aspiration to Good Actions.",
    "They will possess perfect wisdom, beauty, and excellent signs,\nBe born in a good family, and with a radiant appearance.\nDemons and heretics will never harm them,\nAnd all three worlds will honour them with offerings.",
    "They will quickly go beneath the bodhi-tree,\nAnd there, they will sit, to benefit all sentient beings, then\nAwaken into enlightenment, turn the wheel of Dharma,\nAnd tame Māra with all his hordes.",
    "The full result of keeping, teaching, or reading\nThis Prayer of Aspiration to Good Actions\nIs known to the buddhas alone:\nHave no doubt: supreme enlightenment will be yours!",
    "Just as the bodhisattva Mañjuśrī attained omniscience,\nAnd Samantabhadra too\nAll these merits now I dedicate\nTo train and follow in their footsteps.",
    "As all the victorious buddhas of past, present and future\nPraise dedication as supreme,\nSo now I dedicate all these roots of virtue\nFor all beings to perfect Good Actions.",
    "When it is time for me to die,\nLet all that obscures me fade away, so\nI look on Amitābha, there in person,\nAnd go at once to his pure land of Sukhāvatī.",
    "In that pure land, may I actualize every single one\nOf all these aspirations!\nMay I fulfil them, each and every one,\nAnd bring help to beings for as long as the universe remains!",
    "Born there in a beautiful lotus flower,\nIn that excellent and joyous buddha realm,\nMay the Buddha Amitābha himself\nGrant me the prophecy foretelling my enlightenment!",
    "Having received the prophecy there,\nWith my billions of emanations,\nSent out through the power of my mind,\nMay I bring enormous benefit to sentient beings, in all the ten directions!",
    "Through whatever small virtues I have gained\nBy reciting this “Aspiration to Good Actions”,\nMay the virtuous wishes of all beings’ prayers and aspirations\nAll be instantly accomplished!",
    "Through the true and boundless merit\nAttained by dedicating this “Aspiration to Good Actions”,\nMay all those now drowning in the ocean of suffering,\nReach the supreme realm of Amitābha!",
    "May this King of Aspirations bring about\nThe supreme aim and benefit of all infinite sentient beings;\nMay they perfect what is described in this holy prayer, uttered by Samantabhadra!\nMay the lower realms be entirely emptied!"
  ],
  "captions": [
    "Chapter 1, Verse 1",
    "Chapter 1, Verse 2",
    "Chapter 1, Verse 3",
    "Chapter 1, Verse 4",
    "Chapter 1, Verse 5",
    "Chapter 1, Verse 6",
    "Chapter 1, Verse 7",
    "Chapter 1, Verse 8",
    "Chapter 1, Verse 9",
    "Chapter 1, Verse 10",
    "Chapter 1, Verse 11",
    "Chapter 1, Verse 12",
    "Chapter 1, Verse 13",
    "Chapter 1, Verse 14",
    "Chapter 1, Verse 15",
    "Chapter 1, Verse 16",
    "Chapter 1, Verse 17",
    "Chapter 1, Verse 18",
    "Chapter 1, Verse 19",
    "Chapter 1, Verse 20",
    "Chapter 1, Verse 21",
    "Chapter 1, Verse 22",
    "Chapter 1, Verse 23",
    "Chapter 1, Verse 24",
    "Chapter 1, Verse 25",
    "Chapter 1, Verse 26",
    "Chapter 1, Verse 27",
    "Chapter 1, Verse 28",
    "Chapter 1, Verse 29",
    "Chapter 1, Verse 30",
    "Chapter 1, Verse 31",
    "Chapter 1, Verse 32",
    "Chapter 1, Verse 33",
    "Chapter 1, Verse 34",
    "Chapter 1, Verse 35",
    "Chapter 1, Verse 36",
    "Chapter 1, Verse 37",
    "Chapter 1, Verse 38",
    "Chapter 1, Verse 39",
    "Chapter 1, Verse 40",
    "Chapter 1, Verse 41",
    "Chapter 1, Verse 42",
    "Chapter 1, Verse 43",
    "Chapter 1, Verse 44",
    "Chapter 1, Verse 45",
    "Chapter 1, Verse 46",
    "Chapter 1, Verse 47",
    "Chapter 1, Verse 48",
    "Chapter 1, Verse 49",
    "Chapter 1, Verse 50",
    "Chapter 1, Verse 51",
    "Chapter 1, Verse 52",
    "Chapter 1, Verse 53",
    "Chapter 1, Verse 54",
    "Chapter 1, Verse 55",
    "Chapter 1, Verse 56",
    "Chapter 1, Verse 57",
    "Chapter 1, Verse 58",
    "Chapter 1, Verse 59",
    "Chapter 1, Verse 60",
    "Chapter 1, Verse 61",
    "Chapter 1, Verse 62",
    "Chapter 1, Verse 63"
  ],
  "refs": [
    "1.1",
    "1.2",
    "1.3",
    "1.4",
    "1.5",
    "1.6",
    "1.7",
    "1.8",
    "1.9",
    "1.10",
    "1.11",
    "1.12",
    "1.13",
    "1.14",
    "1.15",
    "1.16",
    "1.17",
    "1.18",
    "1.19",
    "1.20",
    "1.21",
    "1.22",
    "1.23",
    "1.24",
    "1.25",
    "1.26",
    "1.27",
    "1.28",
    "1.29",
    "1.30",
    "1.31",
    "1.32",
    "1.33",
    "1.34",
    "1.35",
    "1.36",
    "1.37",
    "1.38",
    "1.39",
    "1.40",
    "1.41",
    "1.42",
    "1.43",
    "1.44",
    "1.45",
    "1.46",
    "1.47",
    "1.48",
    "1.49",
    "1.50",
    "1.51",
    "1.52",
    "1.53",
    "1.54",
    "1.55",
    "1.56",
    "1.57",
    "1.58",
    "1.59",
    "1.60",
    "1.61",
    "1.62",
    "1.63"
  ],
  "chapters": [
    {
      "number": 1,
      "title": "The King of Aspiration Prayers",
      "startVerseIndex": 0,
      "endVerseIndex": 63
    }
  ]
}
