{
  "1": "Shantideva establishes the purposes and relations that frame the entire composition, orienting the reader to why and how the text was written.",
  "1.1": "Each section of the opening — homage, commitment, and discarding pride — is shown to serve a distinct purpose within the framework of the text's composition.",
  "1.1.1": "Paying homage and offering praise at the outset serves to invoke blessings and establish an auspicious beginning for the composition.",
  "1.1.2": "Committing to compose the treatise serves the purpose of dedicating the author's effort toward benefiting others through the Dharma.",
  "1.1.3": "Discarding pride at the outset serves the purpose of ensuring the composition arises from humility rather than self-aggrandizement.",
  "1.2": "The condensed meaning distills the essential import of each opening section — homage, commitment, and discarding pride — into its core significance.",
  "1.2.1": "In condensed form, the homage and praise express Shantideva's reverence for the Buddhas and bodhisattvas as the foundation for all that follows.",
  "1.2.2": "In condensed form, the commitment to compose conveys the author's resolve to gather and present the bodhisattva's path for the sake of training.",
  "1.2.3": "In condensed form, discarding pride establishes that the text is written as a personal practice rather than from a position of scholarly authority.",
  "1.3": "The literal meaning unpacks the actual words and verses of each opening section, giving a detailed reading of the homage, commitment, and discarding of pride.",
  "1.3.1": "Read literally, the opening homage and praise express heartfelt reverence for the sugatas and their heirs who embody the sacred Dharma.",
  "1.3.2": "Read literally, the commitment to compose unfolds through the specific verses in which Shantideva sets forth the subject matter while guarding against invention and repetition.",
  "1.3.2.1": "Setting out the subject matter to be elaborated announces the scope of the bodhisattva's training as the central theme of the commitment to compose.",
  "1.3.2.2": "Abandoning personal invention assures the reader that the commitment to compose draws from established scripture rather than the author's own fabrication.",
  "1.3.2.3": "Abandoning the fault of repetition clarifies that the commitment to compose aims to present the teachings without unnecessarily duplicating what has already been taught.",
  "1.3.3": "Read literally, the verses on discarding pride reveal Shantideva's honest assessment of his own limitations as an author.",
  "1.3.3.1": "Acknowledging that the understanding of others is not the primary goal shows Shantideva's humility in discarding pride about the text's reach.",
  "1.3.3.2": "Affirming that the author's own understanding is the primary goal reveals the personal motivation behind composing, rooted in discarding pride.",
  "1.3.3.3": "Recognizing that others may still benefit from the composition, even though it was written for personal training, adds a generous dimension to the discarding of pride.",
  "1.4": "An implicit structural layer presents the four branches of purpose and relation, revealing the traditional Indian commentarial framework underlying the text's composition.",
  "1.4.1": "Explaining why these four branches are presented clarifies the rationale for using this traditional framework to introduce the text's purposes and relations.",
  "1.4.1.2": "In condensed form, the purpose of presenting the four branches is summarized within the broader implicit framework of purposes and relations.",
  "1.4.1.3": "Read literally, the purpose of presenting the four branches is explained in detail within the broader implicit framework of purposes and relations.",
  "2": "Turning to the individual person as the primary basis, the text establishes who is fit to undertake the bodhisattva's practice.",
  "2.1": "The difficulty of acquiring a human life endowed with freedoms and endowments establishes the precious bodily basis upon which the individual person must rely.",
  "2.2": "Meritorious intelligence forms the mental basis that the individual person requires in order to engage authentically with the bodhisattva's training.",
  "3": "The productive cause of enlightenment is explored through the generation of bodhicitta, the awakening mind that drives the entire bodhisattva path.",
  "3.1": "Before generating bodhicitta in one's own being, its extraordinary benefits are praised to inspire confidence and aspiration.",
  "3.1.1": "Among the benefits of bodhicitta, the ordinary benefits accessible to common understanding are presented first to establish its value.",
  "3.1.1.1": "Certain benefits of bodhicitta operate invisibly, transforming one's inner condition and karmic situation beyond what can be directly observed.",
  "3.1.1.1.1": "Among the invisible benefits, bodhicitta's power to overcome all forms of nonvirtue is presented as its most fundamental transformative capacity.",
  "3.1.1.1.1.1": "Understanding the nature of nonvirtue itself clarifies exactly what bodhicitta has the power to overcome when it arises in the mind.",
  "3.1.1.1.1.2": "Having identified the nature of nonvirtue, the specific mechanism by which bodhicitta overcomes and eliminates it is explained.",
  "3.1.1.1.2": "Beyond overcoming negativity, bodhicitta invisibly benefits the one who generates it, enriching one's own spiritual condition.",
  "3.1.1.1.3": "Bodhicitta possesses the invisible power to benefit others, extending its transformative reach beyond the individual who cultivates it.",
  "3.1.1.1.4": "Even individual worldly wishes find their fulfilment through bodhicitta, which invisibly brings about desired temporal outcomes.",
  "3.1.1.2": "Complementing the invisible benefits, bodhicitta also produces visible benefits that can be directly witnessed and appreciated.",
  "3.1.1.3": "Vivid analogies illuminate the ordinary benefits of bodhicitta, making its extraordinary qualities tangible through familiar comparisons.",
  "3.1.1.3.1": "Like the alchemist's elixir that transforms base metal into gold, bodhicitta transforms the inferior condition of ordinary beings into the supreme state.",
  "3.1.1.3.2": "Like a wish-fulfilling jewel that is both rare and supremely powerful, bodhicitta is difficult to find yet possesses immeasurable potency.",
  "3.1.1.3.3": "Like an inconceivable tree whose fruits never run out, the positive results of bodhicitta are utterly inexhaustible once generated.",
  "3.1.1.3.4": "Like a courageous warrior, bodhicitta overcomes even the most inexpiable evil deeds that nothing else can defeat.",
  "3.1.1.3.5": "Like the great fire at the end of time that consumes everything, bodhicitta burns away even the inevitable results of nonvirtuous actions.",
  "3.1.1.3.6": "Further specific analogies deepen the understanding of bodhicitta's benefits through additional vivid comparisons.",
  "3.1.2": "Beyond ordinary benefits, bodhicitta possesses extraordinary benefits that surpass worldly understanding and distinguish it from all other virtues.",
  "3.1.2.1": "The extraordinary benefits of bodhicitta are presented according to their divisions, distinguishing the different ways they manifest.",
  "3.1.2.2": "The defining characteristics of the extraordinary benefits reveal what makes bodhicitta's power qualitatively different from ordinary virtue.",
  "3.1.2.3": "Even aspiration bodhicitta alone, the wish to attain enlightenment for all beings, produces extraordinary benefits of immense scope.",
  "3.1.2.4": "Application bodhicitta, the active engagement in the bodhisattva's conduct, yields extraordinary benefits that surpass even those of aspiration.",
  "3.1.3": "The underlying reasons why bodhicitta produces such remarkable benefits are examined through both scriptural authority and logical reasoning.",
  "3.1.3.1": "Scriptural sources from the Buddha's own words and the treatises provide authoritative evidence for bodhicitta's extraordinary benefits.",
  "3.1.3.2": "Logical reasoning independently establishes why bodhicitta necessarily produces its remarkable benefits, complementing the scriptural evidence.",
  "3.1.3.2.1": "Through reasoning, the benefits of aspiration bodhicitta are established by examining its unique qualities and scope.",
  "3.1.3.2.1.1": "The vastness of aspiration bodhicitta's intent, embracing all beings without exception, logically accounts for the magnitude of its benefits.",
  "3.1.3.2.1.2": "The sheer rarity of aspiration bodhicitta, arising so seldom in beings, further establishes the greatness of its benefit through reasoning.",
  "3.1.3.2.1.2.1": "No other being anywhere possesses such a genuinely benevolent intent toward all sentient beings, underscoring bodhicitta's profound rarity.",
  "3.1.3.2.1.2.2": "Ordinary beings do not even generate such beneficial intent for themselves, let alone for others, further demonstrating bodhicitta's extraordinary rarity.",
  "3.1.3.2.1.2.3": "From its incomparable rarity, the greatness of the benefit that flows from generating this awakening mind is firmly established.",
  "3.1.3.2.1.3": "The greatness of the goodness produced by aspiration bodhicitta, reasoning from its vast and rare intent, confirms its supreme value.",
  "3.1.3.2.2": "Through reasoning, the benefits of application bodhicitta are established by examining what distinguishes active engagement from aspiration alone.",
  "3.1.3.2.2.1": "Application bodhicitta brings the actual practice into being, moving beyond wish alone to direct engagement in the bodhisattva's conduct.",
  "3.1.3.2.2.2": "The vast number of individuals positively affected by application bodhicitta logically accounts for the immensity of its resulting merit.",
  "3.1.3.2.2.3": "Application bodhicitta's benefit arises without depending on receiving anything in return, making its virtue unconditional and pure.",
  "3.1.3.2.2.4": "The vastness of application bodhicitta is established by reasoning, showing how its scope exceeds all other forms of virtue.",
  "3.1.3.2.2.5": "Application bodhicitta is shown to be particularly powerful among all virtuous states, explaining why its benefits are so exceptional.",
  "3.1.4": "The benefits that bodhicitta brings to oneself are gathered together in a concise summary, consolidating the case for its personal value.",
  "3.1.5": "The benefits that bodhicitta brings to others are summarized, completing the praise by showing its universal reach beyond self-benefit.",
  "3.2": "Having praised its benefits, the actual generation of bodhicitta within one's own stream of being is undertaken through preparation, practice, and conclusion.",
  "3.2.1": "Before the main practice of generating bodhicitta, essential preliminary practices prepare the mind by purifying obscurations and accumulating merit.",
  "3.2.1.1": "Offerings to the sources of refuge constitute the first preliminary, creating the conditions of generosity and devotion necessary for bodhicitta to arise.",
  "3.2.1.1.1": "Worldly substances that one personally owns are offered first, giving what is most immediately available as a foundation for generosity.",
  "3.2.1.1.2": "Unowned worldly substances such as natural beauty and wildflowers are offered, expanding generosity beyond personal possessions.",
  "3.2.1.1.3": "The physical body itself is offered, representing the deepest level of giving one's own material existence to the service of awakening.",
  "3.2.1.1.4": "Offerings emanated by the mind transcend material limitations, allowing the imagination to create boundless and perfect gifts.",
  "3.2.1.1.5": "Unsurpassable offerings, the highest form of offering, are presented as the supreme expression of devotion and merit-gathering.",
  "3.2.1.1.6": "Offering homage through praise and prostration completes the offerings section, expressing reverence through body and speech.",
  "3.2.1.1.6.1": "Verbal praise of the enlightened qualities of the buddhas and bodhisattvas forms one aspect of offering homage as a preliminary to generating bodhicitta.",
  "3.2.1.1.6.2": "Prostration to the Sources of Refuge expresses homage through the body, physically manifesting devotion as part of the preliminary offerings.",
  "3.2.1.2": "Taking refuge in the Three Jewels establishes the foundational orientation of trust and commitment that precedes the generation of bodhicitta.",
  "3.2.1.2.1": "The classifications of refuge distinguish the different ways one can take refuge, providing a framework for understanding this essential preliminary.",
  "3.2.1.2.2": "The distinguishing characteristics that set apart the different classifications of refuge are explained in detail.",
  "3.2.1.2.3": "The essential nature of taking refuge is examined, revealing what it fundamentally means to entrust oneself to the Three Jewels.",
  "3.2.1.2.4": "Resultant refuge is distinguished from causal refuge, and its connection to the generation of aspiration bodhicitta is clarified.",
  "3.2.1.2.5": "The purpose of taking refuge is articulated, showing why this commitment is an indispensable preliminary to generating bodhicitta.",
  "3.2.1.2.6": "The meaning of the term 'refuge' itself is examined, deepening understanding of what one undertakes when seeking protection in the Three Jewels.",
  "3.2.1.2.7": "The distinct trainings that follow from taking refuge specify the commitments and conduct that must be maintained after entering this relationship.",
  "3.2.1.3": "Confession of negative actions purifies the obscurations that would obstruct the genuine arising of bodhicitta in one's mindstream.",
  "3.2.1.3.1": "The power of regret, the first of the four powers of confession, involves deeply acknowledging and feeling remorse for one's harmful actions.",
  "3.2.1.3.1.1": "Each type of negative act is considered individually, generating specific and thorough regret rather than vague acknowledgement.",
  "3.2.1.3.1.1.1": "Supplication to the objects of reliance begins the detailed consideration of negative acts, seeking support from those who can help in purification.",
  "3.2.1.3.1.1.2": "The individual natures of different negative acts are considered, understanding the specific character of each transgression that calls for regret.",
  "3.2.1.3.1.1.3": "The objects against which negative acts were committed are considered individually, deepening the specificity and sincerity of one's regret.",
  "3.2.1.3.1.2": "A longing to be freed swiftly from negative actions intensifies the power of regret, adding urgency to the confession practice.",
  "3.2.1.3.1.2.1": "The various aspects of longing for freedom from negativity are articulated, expressing the different dimensions of the wish to be purified.",
  "3.2.1.3.1.2.2": "Ceasing to rely on the unreliable reinforces the longing for purification by recognizing that worldly refuges cannot protect one from karmic consequences.",
  "3.2.1.3.1.3": "Consideration of individual meaningless acts deepens regret by revealing how negative actions were ultimately without any genuine purpose or benefit.",
  "3.2.1.3.1.3.1": "The various kinds of nonvirtuous actions that have been committed are enumerated, honestly confronting the full scope of one's harmful conduct.",
  "3.2.1.3.1.3.2": "The utter meaninglessness of these nonvirtuous actions is considered, recognizing that they served no genuine purpose and only created suffering.",
  "3.2.1.3.1.3.3": "Logical reasoning establishes that these harmful acts were truly meaningless, providing rational grounds for the depth of one's regret.",
  "3.2.1.3.1.3.4": "Empirical evidence establishes the meaninglessness of harmful actions, grounding regret in observable consequences rather than theory alone.",
  "3.2.1.3.1.3.5": "The consideration of meaningless acts is summarized, drawing together the logical and empirical grounds for profound regret.",
  "3.2.1.3.1.4": "Fear of the results of negative actions completes the power of regret by confronting what will inevitably follow from unconfessed harmful deeds.",
  "3.2.1.3.1.4.1": "The inevitable result of transmigration to another rebirth in lower realms is faced directly as the unavoidable consequence of unconfessed nonvirtue.",
  "3.2.1.3.1.4.2": "Fear of actually experiencing the suffering that results from negative actions generates the emotional urgency needed for genuine confession.",
  "3.2.1.3.1.4.3": "The reason why this fear will not abate on its own is explained, showing that only confession and purification can address it.",
  "3.2.1.3.1.4.4": "The specific aspects of the suffering that awaits are contemplated, making the consequences of unconfessed negativity vividly concrete.",
  "3.2.1.3.2": "The power of reliance, the second of the four powers, involves taking hold of supports that serve as the foundation for effective confession.",
  "3.2.1.3.2.1": "Taking hold of the general supports of the Buddha, Dharma, and Sangha provides the broad foundation of reliance for the confession practice.",
  "3.2.1.3.2.2": "Taking hold of particular bodhisattvas as specific supports deepens the power of reliance through personal connection with these awakened beings.",
  "3.2.1.3.2.3": "Having established the supports of reliance, the subsequent practice of following their instructions is undertaken to complete this power of confession.",
  "3.2.1.3.3": "The power of antidote, the third of the four powers, applies remedial practices that actively counteract the negative imprints left by harmful actions.",
  "3.2.1.3.3.1": "The compelling reasons to persevere in applying the antidote are presented through vivid examples that convey the urgency of purification.",
  "3.2.1.3.3.1.1": "The example of treating a serious illness conveys the urgency of applying antidotes, just as one would not delay seeking a cure for a deadly disease.",
  "3.2.1.3.3.1.2": "The example of standing at the edge of a precipice conveys the danger of delay, showing that one teeters on the brink of terrible consequences.",
  "3.2.1.3.3.2": "Advice to engage in the antidote quickly emphasizes that purification must not be postponed, since death may come at any moment.",
  "3.2.1.3.4": "The power of desisting, the fourth of the four powers, involves resolving to refrain from repeating harmful actions in the future.",
  "3.2.1.3.4.1": "Restraint for the next life establishes the forward-looking resolve to avoid negative actions in all future existences.",
  "3.2.1.3.4.2": "Purifying former lives addresses the accumulated negativity from past existences through the commitment to desist from harmful patterns.",
  "3.2.1.3.4.3": "The chapter on confession is concluded, completing the purification preliminary that clears the way for bodhicitta to arise.",
  "3.2.1.4": "Rejoicing in the virtue of others accumulates vast merit without effort, serving as a powerful preliminary for generating bodhicitta.",
  "3.2.1.4.1": "Rejoicing in worldly virtue celebrates the positive actions of ordinary beings, beginning with the most accessible form of rejoicing.",
  "3.2.1.4.1.1": "Rejoicing in the outcome of merit that leads to the higher realms celebrates the virtue that secures favourable rebirth for beings.",
  "3.2.1.4.1.2": "Rejoicing in the outcome of liberation that leads to enlightenment celebrates the virtue directed toward the ultimate freedom from suffering.",
  "3.2.1.4.2": "Rejoicing in the virtue of sravakas honours the attainments of those who have achieved personal liberation through hearing the teachings.",
  "3.2.1.4.3": "Rejoicing in the virtue of buddhas celebrates the supreme attainments that represent the highest possible fruition of the path.",
  "3.2.1.4.3.1": "Rejoicing in the result achieved by the buddhas celebrates their complete awakening and its boundless qualities.",
  "3.2.1.4.3.2": "Rejoicing in the cause of the buddhas' attainment celebrates the vast accumulations of merit and wisdom that brought about their awakening.",
  "3.2.1.5": "Requesting the wheel of dharma be turned supplicates the buddhas to teach, ensuring that the precious teachings remain available in the world.",
  "3.2.1.6": "Supplication to the buddhas not to pass into nirvana but to remain for the benefit of beings completes the seven-branch practice.",
  "3.2.1.7": "Dedication of the roots of merit directs all accumulated virtue toward the welfare of beings, preventing it from being exhausted by lesser aims.",
  "3.2.1.7.1": "A general aspiration for freedom from suffering dedicates merit broadly toward the relief of all forms of pain experienced by sentient beings.",
  "3.2.1.7.2": "The specific aspiration to eliminate the suffering of sickness dedicates merit toward freeing beings from the torments of disease and physical affliction.",
  "3.2.1.7.3": "The specific aspiration to eliminate the suffering of hunger dedicates merit toward freeing beings from deprivation and the pain of starvation.",
  "3.2.1.7.4": "The specific aspiration to eliminate the suffering of poverty dedicates merit toward freeing beings from material want and its attendant hardships.",
  "3.2.2": "The main part of generating bodhicitta comprises the actual practice itself and the formal ritual through which it is properly received.",
  "3.2.2.1": "The actual practice of generating bodhicitta is undertaken through specific aspirations that express the awakening mind in concrete commitments.",
  "3.2.2.1.1": "The aspiration to give up everything for the sake of beings expresses the fundamental willingness at the heart of generating bodhicitta.",
  "3.2.2.1.1.1": "The method of how to give up everything is explained, providing practical guidance for enacting this total commitment to the welfare of others.",
  "3.2.2.1.1.2": "The reason for giving up everything is articulated, grounding this radical generosity in the logic of compassion and the bodhisattva's purpose.",
  "3.2.2.1.1.3": "The subsequent practice that follows from giving up everything describes what one does after making this foundational commitment.",
  "3.2.2.1.2": "The aspiration for inexhaustible causes ensures that the sources of benefit for beings will never be depleted or run dry.",
  "3.2.2.1.2.1": "A general explanation introduces the aspiration for inexhaustible causes, setting out why perpetual sources of benefit are essential.",
  "3.2.2.1.2.2": "The aspiration for one's attitudes to become inexhaustible causes directs the inner mental states toward becoming perpetual sources of benefit.",
  "3.2.2.1.2.3": "The aspiration for one's actions to become inexhaustible causes directs outward conduct toward becoming perpetual sources of benefit for beings.",
  "3.2.2.1.3": "The aspiration to be a cause of sustenance for all beings expresses the wish to provide everything needed for their survival and flourishing.",
  "3.2.2.1.3.1": "The aspiration to provide necessities for beings focuses on sustaining them with the basic requirements of life and spiritual nourishment.",
  "3.2.2.1.3.2": "The aspiration extends to vast worlds, wishing to sustain beings across the entire breadth of existence without spatial limitation.",
  "3.2.2.1.3.3": "The aspiration to sustain beings without constraint of location or duration extends the commitment across all places and all time.",
  "3.2.2.1.4": "Reciting the words of the vow gives formal verbal expression to the bodhicitta that has been cultivated through the preceding aspirations.",
  "3.2.2.2": "The ritual for generating bodhicitta ensures that it arises with nothing lacking and is properly received through an authentic ceremony.",
  "3.2.2.2.1": "The cause of generating bodhicitta with nothing lacking identifies the essential conditions that must be in place for the awakening mind to arise fully.",
  "3.2.2.2.1.1": "Meditation on compassion serves as the direct cause for bodhicitta, since without heartfelt concern for suffering beings the awakening mind cannot arise.",
  "3.2.2.2.1.2": "Stabilizing faith provides the root that anchors bodhicitta, giving it the firm foundation of unwavering confidence in the path.",
  "3.2.2.2.1.3": "Other supports of bodhicitta beyond compassion and faith are identified as additional conditions that ensure its complete and stable arising.",
  "3.2.2.2.2": "The purpose of a proper ritual for receiving bodhicitta is established, showing why formal ceremony matters for genuine generation of the awakening mind.",
  "3.2.2.2.2.1": "That there is indeed a purpose to properly receiving bodhicitta through ritual is affirmed, countering any notion that ceremony is unnecessary.",
  "3.2.2.2.2.2": "The method of taking the bodhicitta vow specifies the practical details of how the ritual is correctly performed.",
  "3.2.2.2.2.2.1": "From whom the bodhicitta vow is received specifies the qualifications of the preceptor who confers this commitment.",
  "3.2.2.2.2.2.2": "The basis of receiving identifies the qualities and conditions required in the person who wishes to take the bodhicitta vow.",
  "3.2.2.2.2.2.3": "The appropriate time for taking the bodhicitta vow specifies when the ritual should be performed for it to be fully effective.",
  "3.2.2.2.2.2.4": "The ritual itself details the specific liturgical steps and procedures through which the bodhicitta vow is formally conferred and received.",
  "3.2.2.2.2.2.5": "Overcoming the objection that it is not possible always to maintain the vow addresses doubts about sustaining the commitment in all circumstances.",
  "3.2.3": "The conclusion of generating bodhicitta celebrates the achievement and establishes the proper attitude toward the awakening mind now present in one's being.",
  "3.2.3.1": "Generating joy in the attainment of the benefit of self celebrates what has been accomplished for oneself through the generation of bodhicitta.",
  "3.2.3.1.1": "Identifying the benefit that has been established allows one to clearly recognize and appreciate what the generation of bodhicitta has accomplished.",
  "3.2.3.1.2": "Having concern not to corrupt the newly generated bodhicitta with faults ensures that it is carefully guarded and preserved from deterioration.",
  "3.2.3.1.3": "Identifying the difficulty of acquiring bodhicitta deepens one's appreciation and resolve to protect what has been so rarely and preciously obtained.",
  "3.2.3.2": "Generating joy in the attainment of the benefit of others celebrates how the newly generated bodhicitta serves all sentient beings.",
  "3.2.3.2.1": "The power of bodhicitta to dispel suffering reveals its capacity to relieve the pain of all beings as a source of joy and celebration.",
  "3.2.3.2.2": "The power of bodhicitta to dispel obscurations reveals its capacity to clear away the veils that prevent beings from recognizing their true nature.",
  "3.2.3.2.3": "The power of bodhicitta to establish benefit and happiness reveals its capacity to bring about lasting well-being for all sentient beings.",
  "4": "The cooperating condition of subsequently accomplishing the training presents the detailed practices of the six paramitas through which the bodhisattva develops concern, mindfulness, patience, effort, meditation, and wisdom.",
  "4.1": "Concern serves as the general cause of all practice, establishing the vigilant and caring mindset needed before undertaking the specific trainings that subsequently accomplish the bodhisattva's conduct.",
  "4.1.1": "Concern for bodhicitta urges the practitioner to guard the awakening mind itself, ensuring the foundation of all training remains intact through careful concern.",
  "4.1.1.1": "Briefly, the practitioner is instructed to never neglect bodhicitta and to strive in the training, establishing in condensed form the twofold concern for bodhicitta.",
  "4.1.1.2": "Extensively unfolding the reasons and consequences, the text elaborates on why bodhicitta must be guarded with unwavering concern.",
  "4.1.1.2.1": "Examining what should and should not be abandoned through careful analysis provides the reasons for not abandoning bodhicitta within the extensive explanation of concern for the awakening mind.",
  "4.1.1.2.2": "Detailing the grave consequences that follow, the faults of abandoning bodhicitta are set forth to deepen one's extensive concern for safeguarding the awakening mind.",
  "4.1.1.2.2.1": "Falling to the lower realms as a consequence of breaking one's commitment reveals the severity among the faults of abandoning bodhicitta.",
  "4.1.1.2.2.1.1": "Deceiving all beings by promising liberation yet failing to deliver is the fundamental reason one goes to the lower realms upon abandoning bodhicitta.",
  "4.1.1.2.2.1.2": "Scriptural establishment through the example of withholding even a small gift confirms with authoritative sources that one goes to the lower realms for abandoning the commitment to bodhicitta.",
  "4.1.1.2.2.1.3": "Abandoning contradiction with other scriptures resolves the apparent conflict of Shariputra's liberation despite having given up bodhicitta, clarifying the teaching on going to the lower realms.",
  "4.1.1.2.2.2": "When the benefit of others is damaged through abandoning bodhicitta, the fault extends beyond oneself to harm all sentient beings who depend on the practitioner's vow.",
  "4.1.1.2.2.2.1": "Abandoning bodhicitta constitutes the most serious downfall for a bodhisattva, making it a heavy downfall for oneself that surpasses even a monastic defeat in the damage it causes to others' benefit.",
  "4.1.1.2.2.2.2": "Interrupting the virtue of others is just as grave, since diminishing another's merit also damages the benefit of beings and leads inevitably to the lower realms.",
  "4.1.1.2.2.2.3": "The reason for these heavy consequences is that destroying the happiness of even one being brings harm, let alone destroying the happiness of all beings as vast as space through abandoning bodhicitta.",
  "4.1.1.2.2.3": "Vacillating between downfalls and bodhicitta means the attainment of the bhumis is obstructed for a long time, revealing a further fault of abandoning the awakening mind.",
  "4.1.2": "Concern for the training turns attention to how one should actually practise, addressing the abandonment of nonvirtue, the cultivation of virtue, and the defeat of the defilements through sustained concern.",
  "4.1.2.1": "Concern to abandon nonvirtue examines the dangers of negative actions in order to generate the urgency needed within one's concern for training.",
  "4.1.2.1.1": "Recognising the faults that cause rebirth in the lower realms establishes the first and most immediate reason to abandon nonvirtue out of concern for the training.",
  "4.1.2.1.1.1": "Again and again taking lower rebirths when one fails to fulfil one's promise reveals the self-perpetuating cycle among the faults causing rebirth in the lower realms.",
  "4.1.2.1.1.2": "Not having had the circumstances of their final exhaustion, despite innumerable Buddhas working for all beings, highlights how one's own faults have kept one beyond restorative reach among these causes of lower rebirth.",
  "4.1.2.1.1.3": "The same pattern will repeat in the future, bringing disease, bondage, and destruction in the lower realms if one continues in the same way without abandoning nonvirtue.",
  "4.1.2.1.2": "Not attaining freedom underscores how rare it is to encounter a Tathagata, gain faith, and obtain a human birth, making the failure to abandon nonvirtue all the more consequential for one's training.",
  "4.1.2.1.3": "The instability of freedom when it is attained reveals that even present good fortune is fleeting and deceptive, reinforcing the urgency to abandon nonvirtue while conditions still allow.",
  "4.1.2.1.4": "Once fallen to the lower realms, there are no virtuous deeds possible, making the present opportunity to abandon nonvirtue irreplaceable within one's concern for training.",
  "4.1.2.1.4.1": "Without a human body there is no opportunity for virtue, since only nonvirtue prevails in the lower realms where virtuous deeds cannot be accomplished.",
  "4.1.2.1.4.2": "The reason for this lack of opportunity is that even when one has the chance to practise virtue yet fails to do so, the sufferings of the lower realms will completely obscure any possibility of virtuous deeds.",
  "4.1.2.1.4.3": "The inability to return from the lower realms follows because, without practising virtue and while gathering only nonvirtue, one will not hear the words 'happy rebirth' for hundreds of millions of aeons.",
  "4.1.2.1.4.4": "A scriptural reference for that difficulty is the Buddha's analogy of a turtle surfacing through a yoke adrift on a vast ocean, confirming the impossibility of virtuous deeds in the lower realms.",
  "4.1.2.2": "Concern to cultivate virtue addresses the need to actively generate wholesome actions as an antidote, moving beyond the mere avoidance of nonvirtue within one's concern for training.",
  "4.1.2.2.1": "Recognising that many nonvirtues were previously gathered since beginningless time reveals the overwhelming burden that demands active cultivation of virtue as a remedy.",
  "4.1.2.2.2": "Since accumulated nonvirtues are not exhausted by themselves but only generate further suffering, active application of their antidote becomes essential within the concern to cultivate virtue.",
  "4.1.2.2.3": "Therefore, one should strive in virtue, the antidote, applying effort to counteract the accumulated nonvirtues that will not dissipate on their own within the concern to cultivate virtue.",
  "4.1.2.2.3.1": "A general explanation of the fault of not striving reveals that failing to cultivate virtue despite having freedom is the greatest deception and delusion in the effort to apply the antidote.",
  "4.1.2.2.3.2": "The fault in this life is that stopping effort will bring extreme distress at the hour of death, showing the immediate consequence of not striving in virtue.",
  "4.1.2.2.3.3": "The fault in future lives is that one's body will burn in the fires of hell while remorse torments the mind, revealing the long-term consequence of not striving in virtue.",
  "4.1.2.2.3.4": "Advice in overcoming that with an admonition marshals three compelling reasons to persevere in the effort to strive in virtue as the antidote to accumulated nonvirtue.",
  "4.1.2.2.3.4.1": "Having attained freedom, the basis that is extremely difficult to find and supremely beneficial, provides the first ground for the admonition to strive in virtue.",
  "4.1.2.2.3.4.2": "Having clearly distinguished good from bad through present understanding provides the second ground for the admonition to persevere in striving for virtue.",
  "4.1.2.2.3.4.3": "Given these conditions, it is only logical to persevere, since failing to do so would be like one manipulated by mantras who has lost all autonomy, completing the admonition to strive in virtue.",
  "4.1.2.3": "Concern to abandon the defilements confronts the inner enemies directly, examining their harms and establishing the means to overcome them within the broader concern for training.",
  "4.1.2.3.1": "Examining the contrasting attitude between tolerance of the defilements and determination to defeat them initiates the practitioner's concern to abandon the inner enemies.",
  "4.1.2.3.1.1": "Examination of the harms wrought by the defilements reveals their devastating power, building the case for a contrasting attitude of determined resistance within the concern to abandon them.",
  "4.1.2.3.1.1.1": "Loss of autonomy through being enslaved by enemies like hatred and craving, despite their lacking any physical form or intelligence, is the first harm examined among the defilements.",
  "4.1.2.3.1.1.2": "Unlike ordinary enemies who cannot cast one into hell, the defilements can instantly apply one to the most extreme suffering, revealing their unique power to cause harm.",
  "4.1.2.3.1.1.3": "Their perpetual presence, without beginning or end, distinguishes the enemy defilements from any ordinary foe and deepens the examination of the harms they inflict.",
  "4.1.2.3.1.1.4": "Unlike ordinary enemies who become cooperative when treated well, the defilements achieve nothing beneficial and return only pain regardless of how they are accommodated.",
  "4.1.2.3.1.2": "Examining impatience with the defilements reveals how tolerating these inner enemies harms both mind and body, strengthening the contrasting attitude needed to abandon them.",
  "4.1.2.3.1.2.1": "Being harmful to the mind, the defilements as old and implacable enemies rob one of happiness and fill the heart with fear, deepening the examination of impatience.",
  "4.1.2.3.1.2.2": "Being harmful to the body, the defilements act as prison guards and executioners throughout samsara, further revealing why impatience with them must be examined.",
  "4.1.2.3.1.2.3": "Developing pride in the resolve to vanquish the defilements completes the examination of impatience by transforming recognition of harm into unwavering determination.",
  "4.1.2.3.1.2.3.1": "In meaning, one should persevere without ceasing until the enemy defilements have been vanquished, expressing the essential resolve of developing pride against them.",
  "4.1.2.3.1.2.3.2": "By example, even the proud and haughty will not sleep until an ordinary enemy who inflicted a slight injury has been defeated, illustrating the fierce resolve of developing pride against the defilements.",
  "4.1.2.3.2": "Rejecting the idea that application will create suffering overcomes the objection that fighting the defilements brings hardship, within the broader concern to abandon the defilements.",
  "4.1.2.3.2.1": "Illustrating the faults of non-application shows that warriors endure far worse on the battlefield for lesser aims, undermining the objection that effort against the defilements creates suffering.",
  "4.1.2.3.2.1.1": "An example of the faults of non-application draws on warriors who disregard pain and refuse to retreat until victory is won, despite fighting merely mortal enemies.",
  "4.1.2.3.2.1.2": "The point of the example is that if warriors endure such suffering against ordinary foes, one should certainly not be discouraged when striving to vanquish the defilements that cause all endless suffering.",
  "4.1.2.3.2.2": "Examining the qualities of application reveals the threefold benefit of striving against the defilements, further rejecting the idea that such application creates only suffering.",
  "4.1.2.3.2.2.1": "Benefit of self arises because, unlike the meaningless scars of ordinary battle, the sufferings endured in overcoming the defilements yield great personal accomplishment among the qualities of application.",
  "4.1.2.3.2.2.2": "Benefit of other arises because, unlike those who merely endure hardship for their livelihoods, the bodhisattva's patient effort serves the happiness of all beings among the qualities of application.",
  "4.1.2.3.2.2.3": "Fulfilment of vows is at stake because one promised to liberate all beings while not yet free from defilements oneself, making their abandonment essential among the qualities of application.",
  "4.1.2.3.2.3": "Establishing the means of devoting oneself to that application provides practical instructions for maintaining effort against the defilements after rejecting the objection of suffering.",
  "4.1.2.3.2.3.1": "Not stopping until the defilements have been abandoned sets the fundamental resolve as the first means of devoting oneself to the application against the inner enemies.",
  "4.1.2.3.2.3.2": "Dedication in this practice means developing a fixated attachment to applying the antidotes, serving as an essential means of sustaining one's devotion to the application.",
  "4.1.2.3.2.3.3": "Relying on antidotes for one's own impatience means regarding the defilements with enmity and opposition, turning one's frustration into a useful means of devotion to the application.",
  "4.1.2.3.2.3.4": "Abandoning objections to that enmity clarifies that the resentment directed at defilements is itself an antidote rather than a fault, removing a potential obstacle in the means of application.",
  "4.1.2.3.2.3.5": "Choosing death over obedience to the defilements establishes the ultimate boundary of no obedience as a final means of devoting oneself to the application against inner enemies.",
  "4.1.2.3.3": "Developing enthusiasm in one's ability to abandon the defilements builds confidence that victory is truly possible, completing the threefold approach to the concern to abandon the defilements.",
  "4.1.2.3.3.1": "Recognising that the defilements have no other basis once expelled from the mind provides the central argument for enthusiasm in one's ability to abandon them permanently.",
  "4.1.2.3.3.1.1": "Presenting an example of expulsion through ordinary enemies who, once driven out, resettle elsewhere and return, sets up the contrast with defilements that have no other basis.",
  "4.1.2.3.3.1.2": "The related meaning draws out the crucial difference: unlike ordinary enemies, the defilements never arise again once their seeds have been abandoned from the mind.",
  "4.1.2.3.3.1.3": "The nature of the antidotes which bring about abandonment is the eye of wisdom, against which the pathetic defilements have no power, showing how they have no other basis to rely upon.",
  "4.1.2.3.3.1.4": "The essential characteristic of their not returning is that, once extirpated from the mind by wisdom, the defilements have nowhere to go and no way to cause harm again.",
  "4.1.2.3.3.2": "Recognising that the defilements are erroneous perceptions like illusions, lacking any support in objects or senses, gives the final ground for enthusiasm in one's ability to abandon them.",
  "4.1.2.4": "A concluding summary of concern for training urges the practitioner to strive in all that has been explained, warning through the analogy of a patient who ignores the doctor's instructions that neglecting the training cannot lead to a cure.",
  "4.2": "Mindfulness and clear comprehension constitute the essential practice through which the bodhisattva subsequently accomplishes the cooperating condition of training.",
  "4.2.1": "Guarding the mind serves as the primary means of guarding the entire training in mindfulness and clear comprehension.",
  "4.2.1.1": "By guarding the mind alone, one guards all aspects of the training, establishing the centrality of mental vigilance to the practice of mindfulness and clear comprehension.",
  "4.2.1.1.1": "A forward pervasion demonstrates that guarding the mind entails guarding all, showing how mental vigilance necessarily protects the whole of one's training.",
  "4.2.1.1.2": "The reverse pervasion shows that without guarding the mind, nothing else is guarded, reinforcing the indispensability of mental vigilance to guarding all.",
  "4.2.1.1.3": "Establishing the reverse pervasion through reasoning proves that failing to guard the mind truly leaves everything unprotected within the scope of guarding all.",
  "4.2.1.1.4": "When one guards the mind, the dangers of affliction and suffering subside, confirming through their cessation that guarding the mind effectively guards all.",
  "4.2.1.1.5": "A condensed summary draws together the essential point that guarding the mind is the single indispensable practice for guarding all aspects of the training.",
  "4.2.1.2": "Everything in one's spiritual life depends upon mind, providing the fundamental reason why guarding the mind is the means of guarding the training.",
  "4.2.1.2.1": "All faults and forms of negativity depend upon mind, establishing one dimension of why everything hinges on the mind's condition.",
  "4.2.1.2.1.1": "A scriptural gloss presents authoritative textual support for the claim that all faults arise from and depend upon the unguarded mind.",
  "4.2.1.2.1.2": "Reasoning and evidence establish that all faults genuinely depend upon mind, confirming through analysis what scripture has presented.",
  "4.2.1.2.1.3": "A concluding statement draws together the demonstration that all faults depend upon mind, sealing this aspect of the argument for guarding it.",
  "4.2.1.2.2": "All virtues likewise depend upon mind, completing the picture of why everything in the training hinges on the mind's condition.",
  "4.2.1.2.2.1": "Giving as a perfection depends upon the mind's intention rather than external action, showing that even generosity is fundamentally a mental virtue.",
  "4.2.1.2.2.2": "Moral conduct depends upon the mind's resolve to refrain from harm, demonstrating that ethical discipline too is rooted in mental virtue.",
  "4.2.1.2.2.3": "Patience as a virtue depends upon the mind's capacity to bear adversity, showing through its three aspects that forbearance is essentially mental.",
  "4.2.1.2.2.3.1": "The actual meaning of patience's dependence on mind is presented, showing directly how the mind's disposition determines whether patience arises.",
  "4.2.1.2.2.3.2": "A related example illustrates patience's dependence on mind through a vivid analogy that makes the abstract point concretely understandable.",
  "4.2.1.2.2.3.3": "The related point drawn from the example clinches the argument that patience is accomplished through guarding the mind rather than external circumstances.",
  "4.2.1.2.2.4": "Energy and enthusiastic effort depend upon mind, since vigour in practice arises from the mind's joyful engagement with virtue.",
  "4.2.1.2.2.5": "Meditation depends upon mind, since concentration and stability are by their very nature states of the mind properly trained and settled.",
  "4.2.1.2.2.6": "Wisdom depends upon mind, since the discernment of reality that constitutes prajna is the most refined activity of the trained mind.",
  "4.2.1.3": "One should therefore make effort to guard the mind, drawing the practical conclusion from the established dependence of all faults and virtues upon it.",
  "4.2.1.3.1": "A general explanation introduces the imperative to guard the mind as the natural consequence of understanding that everything depends upon it.",
  "4.2.1.3.2": "Everything one seeks to accomplish on the path is achieved through guarding the mind, reinforcing the reason to devote effort to this practice.",
  "4.2.1.3.3": "A helpful perspective for guarding the mind is offered, providing the practitioner with a useful frame of reference for sustaining this effort.",
  "4.2.1.3.4": "The reason it makes sense to guard the mind is articulated, showing that this effort is both practical and well-founded rather than merely aspirational.",
  "4.2.1.3.5": "Properly guarding the mind is described, specifying what correct practice of mental vigilance actually involves in the effort to guard it.",
  "4.2.1.3.6": "A concluding exhortation to take great care in mindfulness summarises the entire discussion of making effort to guard the mind.",
  "4.2.2": "Guarding mindfulness and clear comprehension is presented as the specific means by which the mind itself is guarded within the training.",
  "4.2.2.1": "A brief description introduces how mindfulness and clear comprehension function together as the guardians of the mind.",
  "4.2.2.2": "The faults that arise from lacking mindfulness and clear comprehension demonstrate their indispensability by showing what happens without them.",
  "4.2.2.2.1": "Without mindfulness and clear comprehension, one has little power to act virtuously, since the capacity for purposeful practice collapses.",
  "4.2.2.2.2": "Wisdom will not flourish in the absence of mindfulness and clear comprehension, since discernment requires the sustained attention they provide.",
  "4.2.2.2.3": "Moral conduct will not flourish without mindfulness and clear comprehension, since ethical restraint depends on ongoing awareness of one's actions.",
  "4.2.2.2.4": "Previously accumulated virtues are destroyed when mindfulness and clear comprehension are absent, as afflictions freely ravage unguarded merit.",
  "4.2.2.2.5": "New virtues are not produced when mindfulness and clear comprehension are lacking, blocking the very generation of positive qualities.",
  "4.2.2.3": "Guarding mindfulness specifically serves as the means of guarding clear comprehension, revealing the sequential relationship between these two mental factors.",
  "4.2.2.3.1": "Expressing the main point establishes that mindfulness is the foundation upon which clear comprehension depends and from which it arises.",
  "4.2.2.3.2": "The cause of mindfulness is examined, identifying what gives rise to and sustains the very attentiveness that guards clear comprehension.",
  "4.2.2.3.2.1": "Keeping in mind the faults of losing mindfulness serves as a cause for its arising, since awareness of the danger motivates vigilance.",
  "4.2.2.3.2.2": "Relying on the conditions which prevent the loss of mindfulness ensures its continuity, addressing both outer and inner supports for sustained awareness.",
  "4.2.2.3.2.2.1": "Reliance on the spiritual friend as the outer condition prevents the loss of mindfulness through the guidance and encouragement of a qualified teacher.",
  "4.2.2.3.2.2.2": "A proper mental attitude as the inner condition prevents the loss of mindfulness by cultivating the internal dispositions of conscientiousness and respect.",
  "4.2.2.3.2.3": "An additional benefit of cultivating the causes of mindfulness is noted, showing that these practices yield further positive results beyond merely sustaining attention.",
  "4.2.2.3.3": "How to definitively generate clear comprehension through mindfulness specifies the method by which sustained attentiveness gives rise to full situational awareness.",
  "4.2.3": "Training in the conduct of guarding the mind with mindfulness and clear comprehension unfolds the practical application of what has been established.",
  "4.2.3.1": "Training in the conduct of vows specifies how mindfulness and clear comprehension are applied to maintaining one's commitments within the mindful conduct.",
  "4.2.3.1.1": "Vows are examined in relation to their type, distinguishing the different domains of body and mind in which mindful conduct must be maintained.",
  "4.2.3.1.1.1": "Vows in relation to the body address how physical conduct is governed by mindfulness within the training in vows according to type.",
  "4.2.3.1.1.1.1": "Temporarily remaining at ease allows the body to settle and become a stable basis for mindful bodily conduct in the training.",
  "4.2.3.1.1.1.2": "Mindful conduct in relation to sight governs how one directs and restrains the gaze, training the body through disciplined visual awareness.",
  "4.2.3.1.1.1.3": "Mindful bodily conduct in relation to other situations extends the training to the various physical circumstances encountered beyond sight alone.",
  "4.2.3.1.1.1.4": "Preparing and checking oneself before acting ensures that bodily conduct proceeds from mindful intention rather than habitual carelessness.",
  "4.2.3.1.1.2": "Vows in relation to mind address how mental conduct is governed by mindfulness, training one to observe and direct the mind's movements.",
  "4.2.3.1.1.3": "Certain times call for a dispensation regardless of the type of vow, recognizing that exceptional circumstances require flexibility within the mindful training.",
  "4.2.3.1.1.3.1": "Specific times when there is a dispensation on bodily conduct are identified, allowing measured flexibility in physical behaviour when circumstances require it.",
  "4.2.3.1.1.3.2": "A scriptural source is referenced to authorize the dispensation on bodily conduct, grounding this flexibility in the Buddha's own teaching.",
  "4.2.3.1.1.3.3": "An objection to such dispensation is raised and abandoned, resolving doubts about whether flexibility compromises the integrity of the training.",
  "4.2.3.1.1.3.4": "The qualities that arise from behaving with appropriate dispensation are enumerated, showing that skillful flexibility enhances rather than undermines the training.",
  "4.2.3.1.1.3.5": "The faults of failing to exercise appropriate dispensation are noted, showing that rigid adherence in unsuitable circumstances itself becomes an obstacle.",
  "4.2.3.1.1.3.6": "A concluding summary gathers the points about dispensation, affirming the proper balance between discipline and flexibility within the training in vows.",
  "4.2.3.1.2": "Guarding against damage to one's vows addresses the threats that could compromise the commitments maintained through mindfulness and clear comprehension.",
  "4.2.3.1.2.1": "Guarding against damage to vows of body protects the physical dimension of one's commitments from deterioration through carelessness or affliction.",
  "4.2.3.1.2.1.1": "Not letting the vows be stolen by distracting conditions prevents external circumstances from eroding one's bodily commitments through loss of attention.",
  "4.2.3.1.2.1.2": "Abandoning meaningless behaviour eliminates pointless physical activities that waste the opportunity to maintain and deepen one's bodily vows.",
  "4.2.3.1.2.1.3": "Examining the motivation behind physical actions ensures that bodily conduct is driven by virtue rather than affliction, protecting the vows from internal damage.",
  "4.2.3.1.2.2": "Guarding against damage to vows of mind protects the mental dimension of one's commitments from the internal threats of afflictive emotions.",
  "4.2.3.1.2.2.1": "The types of antidote available for guarding mental vows are identified, providing the practitioner with the specific remedies needed against mental afflictions.",
  "4.2.3.1.2.2.2": "A brief explanation of how to apply these antidotes gives practical guidance on deploying the remedies that protect the mind's vows from damage.",
  "4.2.3.2": "Training in the conduct of accumulating virtue shifts from protecting existing commitments to actively building positive qualities through mindful practice.",
  "4.2.3.2.1": "Accomplishing non-attachment to the body removes the primary obstacle to accumulating virtue, since clinging to the physical form obstructs generous and courageous action.",
  "4.2.3.2.1.1": "Reflecting on the body as inanimate — a mere aggregate of matter without inherent life — begins to loosen attachment within the training in non-attachment.",
  "4.2.3.2.1.2": "Reflecting on the body as impure counteracts the illusion of physical attractiveness, deepening non-attachment through honest appraisal of its constituents.",
  "4.2.3.2.1.3": "Reflecting on the body as essenceless reveals that it lacks any enduring core, further dissolving the basis for attachment within the training.",
  "4.2.3.2.1.4": "Reflecting on the body as useless for its own sake shows that mere physical preservation serves no lasting purpose, strengthening non-attachment.",
  "4.2.3.2.1.5": "Having loosened attachment, applying the body to use directs it toward virtuous purposes, transforming non-attachment into a foundation for accumulating merit.",
  "4.2.3.2.2": "Training in the means of accomplishing virtue provides the skilful methods through which positive qualities are actively cultivated in daily conduct.",
  "4.2.3.2.2.1": "Skilful means for ordinary conduct governs everyday behaviour with mindfulness, ensuring that routine activities become occasions for accumulating virtue.",
  "4.2.3.2.2.2": "Skilful means for conduct towards agents addresses how one relates to other people in ways that generate virtue within the training.",
  "4.2.3.2.2.2.1": "Responding properly to those who are giving advice cultivates receptivity and humility, turning encounters with guidance into occasions for accumulating virtue.",
  "4.2.3.2.2.2.2": "Responding properly to those expressing the truth cultivates openness and respect, ensuring that truthful speech is met with virtuous appreciation.",
  "4.2.3.2.2.2.3": "Responding properly to those creating merit cultivates sympathetic joy, turning others' virtuous activity into an occasion for one's own accumulation.",
  "4.2.3.2.2.2.4": "Responding properly to descriptions and accounts of virtuous deeds maintains a wholesome attitude, ensuring that hearing about goodness inspires further practice.",
  "4.2.3.2.2.2.5": "The greatness of a mind that is respectful to others reveals the profound merit generated by genuine esteem within one's conduct toward fellow beings.",
  "4.2.3.2.2.3": "Skilful means for conduct of action addresses how specific activities of body and speech become vehicles for accumulating virtue.",
  "4.2.3.2.2.3.1": "Skilful conduct connected with speaking trains one to use speech as a means of generating virtue through careful, beneficial, and truthful communication.",
  "4.2.3.2.2.3.2": "Skilful conduct connected with looking trains the way one directs one's gaze to become an expression of compassion and mindful awareness.",
  "4.2.3.2.2.3.3": "Skilful conduct connected with virtuous action addresses how positive deeds are performed with the full complement of intention, field, application, and type.",
  "4.2.3.2.2.3.3.1": "Proper intention behind virtuous action ensures that positive deeds arise from genuine bodhicitta rather than self-interested or afflicted motivation.",
  "4.2.3.2.2.3.3.2": "Identifying the proper fields for virtuous action directs positive efforts toward the beings and contexts where they generate the greatest merit.",
  "4.2.3.2.2.3.3.3": "Proper application specifies how virtuous actions should be carried out in practice, ensuring that method and execution match the intention.",
  "4.2.3.2.2.3.3.4": "Distinguishing specific types of virtuous action completes the framework, ensuring that the full range of positive conduct is systematically cultivated.",
  "4.2.3.3": "Training in the conduct of benefitting sentient beings extends the mindful practice outward, directing one's actions toward the welfare of others.",
  "4.2.3.3.1": "Increasing activities for the benefit of others expands the scope of virtuous engagement, ensuring that concern for sentient beings grows in breadth and intensity.",
  "4.2.3.3.2": "The conduct of gathering sentient beings employs specific methods to draw beings toward the dharma and establish them in virtue within the benefit of others.",
  "4.2.3.3.2.1": "Gathering with wealth and possessions uses material generosity as a means of drawing sentient beings closer to the dharma and creating connections of trust.",
  "4.2.3.3.2.1.1": "External gathering through offering material possessions and resources to others creates the initial conditions of trust and connection that open beings to the dharma.",
  "4.2.3.3.2.1.2": "Internal gathering through offering one's own body and personal capacity deepens the commitment to draw sentient beings through the gift of oneself.",
  "4.2.3.3.2.2": "Gathering with dharma uses the teachings themselves as the means of drawing sentient beings toward virtue and liberation.",
  "4.2.3.3.2.2.1": "Identifying the proper vessels for dharma explanation ensures that teachings are offered to those who are ready and able to receive them beneficially.",
  "4.2.3.3.2.2.2": "The methods of dharma explanation specify how the teachings should be communicated so that they effectively gather beings toward understanding and virtue.",
  "4.2.3.3.2.3": "The subsequent conduct of protecting the minds of sentient beings ensures that those already gathered are safeguarded from discouragement and confusion.",
  "4.2.3.4": "Factors which enhance the training identify the supportive elements that elevate and strengthen the entire practice of mindful conduct.",
  "4.2.3.4.1": "The cause of purifying faults identifies what specifically removes the defects that would otherwise undermine the effectiveness of the training.",
  "4.2.3.4.2": "The basis of training specifies the foundational ground upon which the entire practice of mindful conduct rests and from which its enhancement proceeds.",
  "4.2.3.4.3": "The aim of the training articulates its ultimate purpose, ensuring that all efforts in mindful conduct are oriented toward the correct goal.",
  "4.2.3.4.4": "The teacher of the training identifies the spiritual guide who directs and supports the practitioner's development within the enhancing factors.",
  "4.2.3.4.4.1": "The spiritual friend is identified as the teacher of the training, the qualified guide whose presence is indispensable for proper progress.",
  "4.2.3.4.4.2": "One should rely upon the spiritual friend, making the commitment to follow the teacher's guidance a central element of enhancing the training.",
  "4.2.3.4.4.3": "Consideration of reliance upon application addresses how dependence on the teacher translates into actual practice, connecting guidance with personal effort.",
  "4.2.3.4.5": "Becoming knowledgeable in the trainings ensures that the practitioner possesses the understanding needed to enhance and sustain the mindful conduct.",
  "4.2.3.4.6": "A summary of the training gathers together the essential points of the enhancing factors, consolidating what must be remembered and applied.",
  "4.2.3.5": "Applying the key point distils the entire training in mindful conduct into its most essential instruction, directing the practitioner to the heart of the practice.",
  "4.3": "Patience is the paramita through which the bodhisattva bears hardship and harm without anger, subsequently accomplishing the training.",
  "4.3.1": "Developing motivation for patience considers the results of anger and patience to arouse the determination needed to train in this paramita.",
  "4.3.1.1": "Invisible results such as the destruction of merit accumulated over a thousand aeons by a single moment of anger motivate the practitioner to develop patience.",
  "4.3.1.2": "Visible results of anger, harming both mind and body, further motivate the practitioner to develop patience by showing its immediate destructive effects.",
  "4.3.1.2.1": "Harm to the mind, through which anger destroys inner peace and makes even close companions unbearable, is a visible result that motivates the development of patience.",
  "4.3.1.2.2": "Harm to the body, through which anger ravages physical wellbeing and comfort, is a visible result that motivates the development of patience.",
  "4.3.1.2.3": "Summarizing the invisible and visible results together underscores the comprehensive devastation of anger and seals the motivation for developing patience.",
  "4.3.2": "Keeping in mind the skilful means for accomplishing patience provides the practical methods -- preventing anger, bearing suffering, and reflecting on results -- that bring the paramita to fruition.",
  "4.3.2.1": "Preventing the characteristics of anger addresses the first and most essential skilful means, dismantling the causes and conditions that give rise to anger within the training in patience.",
  "4.3.2.1.1": "Understanding the nature of anger's cause -- the arising of mental unhappiness when what is unwanted occurs or what is wanted is obstructed -- is the starting point for preventing anger.",
  "4.3.2.1.2": "Striving in the means of averting that cause resolves to eliminate mental unhappiness, since it is the nourishment from which anger grows and must be cut off to prevent anger.",
  "4.3.2.1.3": "Identifying the means of averting that cause shows that what is needed is to counteract mental unhappiness itself, thereby removing the basis for anger to arise.",
  "4.3.2.1.4": "Keeping in mind the means of averting the cause of the cause examines the deeper roots of mental unhappiness, working through the undesirable and desirable dharmas that trigger it within the prevention of anger.",
  "4.3.2.1.4.1": "A general explanation distinguishing desirable and undesirable dharmas clarifies the two categories whose occurrence or obstruction causes mental unhappiness, providing the framework for averting anger at its root.",
  "4.3.2.1.4.2": "Ceasing anger toward the production of undesirables addresses the first major category -- when unwanted things happen -- and works to dismantle the impatience that arises from encountering negative circumstances.",
  "4.3.2.1.4.2.1": "Stopping impatience with the production of negative actions towards oneself examines how to bear harm directed at one's own person, whether as suffering or as disrespect, within the effort to cease anger toward undesirables.",
  "4.3.2.1.4.2.1.1": "Stopping impatience with the establishment of suffering for oneself addresses the direct experience of being made to suffer by others, the most visceral trigger for anger among negative actions toward oneself.",
  "4.3.2.1.4.2.1.1.1": "Tolerating suffering by examining the suffering itself transforms one's relationship to pain through five examinations -- its nature, benefits, accessibility, qualities of practice, and inherent qualities -- within the effort to stop impatience with suffering.",
  "4.3.2.1.4.2.1.1.1.1": "Examining the nature of suffering reveals whether it can be remedied or not, since in either case anger is pointless, providing the first basis for tolerating suffering through examination.",
  "4.3.2.1.4.2.1.1.1.2": "Examining the great benefits of suffering undergone for happiness shows how hardship purifies karma, generates compassion, and turns one away from sin, providing a second basis for tolerating suffering.",
  "4.3.2.1.4.2.1.1.1.3": "Examining that the reliance on suffering is not difficult uses the analogy of gradually building tolerance to show that patient endurance can be developed through familiarization.",
  "4.3.2.1.4.2.1.1.1.4": "Examining the qualities of the practice shows that those who bear suffering for liberation accomplish something truly meaningful, unlike the meaningless hardships endured for worldly aims.",
  "4.3.2.1.4.2.1.1.1.5": "Examining the inherent qualities of suffering reveals that it can itself become a source of joy through habituation, just as some develop attachment to what first caused them pain.",
  "4.3.2.1.4.2.1.1.2": "Definitive consideration of the qualities in the discrimination -- examining autonomy, its refutation, and the necessity of overcoming anger -- deepens the analysis of why impatience with suffering is unwarranted.",
  "4.3.2.1.4.2.1.1.2.1": "Since harm depends on a cause and does not have autonomy, neither the anger nor the angry person acts freely, which undermines the basis for impatience with one's suffering.",
  "4.3.2.1.4.2.1.1.2.1.1": "Anger and the angry person do not have autonomy, since both arise dependently from causes and conditions, establishing the key premise for dissolving impatience through definitive consideration.",
  "4.3.2.1.4.2.1.1.2.1.1.1": "Establishing the fact that neither the angry person nor the anger is autonomous demonstrates through reasoning that harm-doers are compelled by conditions rather than acting freely.",
  "4.3.2.1.4.2.1.1.2.1.1.2": "A general explanation of the sameness of their qualities by example illustrates how anger and the angry person equally lack autonomy, just as fire does not choose to burn.",
  "4.3.2.1.4.2.1.1.2.1.1.3": "Connecting with the meaning applies the example to the actual case, showing that harm-doers are as little to blame as the conditions that produce them.",
  "4.3.2.1.4.2.1.1.2.1.1.4": "Summarizing the lack of autonomy in anger and the angry person consolidates the understanding that since neither acts freely, impatience is groundless.",
  "4.3.2.1.4.2.1.1.2.1.2": "Their conditions do not have autonomy either, since even the causes that give rise to anger themselves arise dependently, extending the refutation of autonomy one step further.",
  "4.3.2.1.4.2.1.1.2.2": "Refuting the essential characteristics of autonomy challenges philosophical positions that assert a self-governing agent, removing any theoretical basis for justified anger toward harm-doers.",
  "4.3.2.1.4.2.1.1.2.2.1": "Refuting the position of the Samkhyas, who assert a permanent primal substance as the autonomous cause of all phenomena, eliminates one philosophical basis for attributing autonomy to harm-doers.",
  "4.3.2.1.4.2.1.1.2.2.2": "Refuting the position of the Naiyayikas, who assert a permanent self as the autonomous agent, eliminates another philosophical basis for attributing autonomy to harm-doers.",
  "4.3.2.1.4.2.1.1.2.2.3": "Summarizing the refutation of autonomy confirms that no philosophical system successfully establishes a self-governing agent, leaving no ground for anger at those who cause harm.",
  "4.3.2.1.4.2.1.1.2.3": "The necessity of overcoming anger follows from the understanding that since all arises dependently, one must still apply the antidote even though anger itself also lacks autonomy.",
  "4.3.2.1.4.2.1.1.2.4": "Summarizing definitive consideration confirms that the entire analysis of non-autonomy and its implications establishes a firm basis for stopping impatience with suffering.",
  "4.3.2.1.4.2.1.1.3": "In discriminating harmful sentient beings, how to think of them as not causing the harm shifts the focus from the nature of suffering to the nature of the harm-doer, cultivating a compassionate rather than hostile view.",
  "4.3.2.1.4.2.1.1.3.1": "One should have the characteristics of affection in one's attitude toward harmful beings, since they act under the power of their defilements, making them objects of compassion rather than anger.",
  "4.3.2.1.4.2.1.1.3.2": "Not dwelling on the characteristics of anger means refraining from feeding the mind with reasons for hostility, since harmful beings are themselves tormented by the very defilements that drive their actions.",
  "4.3.2.1.4.2.1.1.3.3": "Examination of one's own faults reveals that one's own karma and attachments are equally responsible for the suffering one experiences, undermining the justification for blaming harmful beings.",
  "4.3.2.1.4.2.1.1.3.3.1": "Recognizing that the faults are one's own, since past actions created the conditions for present suffering, turns blame inward and dissolves the basis for anger at others.",
  "4.3.2.1.4.2.1.1.3.3.2": "The fault of grasping the body, which causes suffering, shows that clinging to a physical form vulnerable to harm is itself a condition for pain, making one's own attachment partly responsible.",
  "4.3.2.1.4.2.1.1.3.3.3": "The fault of attachment, which causes suffering, demonstrates that craving and desire draw one into situations where harm inevitably occurs, further locating responsibility in one's own mind.",
  "4.3.2.1.4.2.1.1.3.3.4": "The fault of activities which are of no benefit to others shows that engaging in pointless or harmful conduct invites hostility from others, making one complicit in the harm one receives.",
  "4.3.2.1.4.2.1.1.3.3.5": "The angry mind has it the wrong way round, blaming others for what one's own actions have produced, inverting the actual causal relationship and compounding the error.",
  "4.3.2.1.4.2.1.1.3.3.6": "Abandoning objections addresses counterarguments that challenge the view that others benefit oneself or that one harms others, strengthening the examination of one's own faults.",
  "4.3.2.1.4.2.1.1.3.3.6.1": "Abandoning the objection that it is illogical to say others benefit oneself shows that even harm-doers serve as conditions for practising patience, and thus do in fact benefit the practitioner.",
  "4.3.2.1.4.2.1.1.3.3.6.2": "Abandoning the objection that it is illogical to say one harms others demonstrates that one's own past actions created the conditions in which others now cause harm, establishing mutual responsibility.",
  "4.3.2.1.4.2.1.1.3.3.6.3": "Refuting the instigation of harm clarifies that even when others initiate harmful actions, the deeper cause remains one's own karmic conditioning, completing the abandonment of objections.",
  "4.3.2.1.4.2.1.2": "Stopping impatience with the establishment of disrespect and similar offences toward oneself addresses the subtler provocations -- insults, slander, and contempt -- that trigger anger even when no physical suffering occurs.",
  "4.3.2.1.4.2.1.2.1": "Disrespect does no harm to the body, demonstrating that verbal and social offences cannot actually injure one's physical being and therefore provide no rational basis for anger.",
  "4.3.2.1.4.2.1.2.2": "It makes no sense to get angry in connection to the hatred of others, since their dislike neither harms one in this life nor creates obstacles in future lives.",
  "4.3.2.1.4.2.1.2.3": "It makes no sense to get angry with obstacles to acquisition, since worldly gains are themselves impermanent and ultimately meaningless, removing any rational basis for impatience when they are obstructed.",
  "4.3.2.1.4.2.1.2.3.1": "The meaninglessness of the acquisitions themselves shows that since material gains and status will be lost at death, anger over their obstruction is pointless.",
  "4.3.2.1.4.2.1.2.3.2": "Ceasing to create more harm by getting angry over lost acquisitions prevents the additional suffering one inflicts on oneself through reactive hostility.",
  "4.3.2.1.4.2.1.2.3.3": "Demonstrating their meaninglessness by example uses vivid comparisons to show that clinging to impermanent acquisitions and becoming angry when they are taken away is as foolish as a child crying over a sandcastle.",
  "4.3.2.1.4.2.1.2.3.4": "Their specific kind of meaninglessness highlights the particular emptiness of the acquisitions at stake, reinforcing that anger over their obstruction lacks any rational foundation.",
  "4.3.2.1.4.2.1.2.3.5": "Addressing the objection and response resolves the counterargument that acquisitions are needed for practice, clarifying that even this justification does not warrant anger at their obstruction.",
  "4.3.2.1.4.2.1.2.3.6": "Establishing the purpose of this analysis confirms that recognizing the meaninglessness of acquisitions serves to prevent anger and advance the practice of patience.",
  "4.3.2.1.4.2.1.2.4": "Disrespectful beings are inappropriate as objects of anger because they act from their own defilements and confusion, making hostility toward them as misplaced as blaming the wind for smoke.",
  "4.3.2.1.4.2.2": "Stopping impatience with the production of negative actions towards one's own side addresses anger that arises when those close to oneself -- one's teachers, dharma, or companions -- are harmed or criticised.",
  "4.3.2.1.4.2.2.1": "Properly considering those who criticise or harm the dharma cultivates patience by recognising that their actions arise from ignorance and confusion, making them objects of compassion rather than anger.",
  "4.3.2.1.4.2.2.2": "The patience of putting up with harm-doers who injure one's own side is developed through examining the marks of anger, its irrationality, one's own faults, and the results of patience.",
  "4.3.2.1.4.2.2.2.1": "The marks of anger are not established because the harm done to one's companions is driven by conditions beyond anyone's autonomous control, removing the basis for justified hostility.",
  "4.3.2.1.4.2.2.2.2": "Examining its irrationality shows that becoming angry on behalf of those harmed serves no purpose, since it neither undoes the harm nor prevents future suffering.",
  "4.3.2.1.4.2.2.2.3": "Examining one's own faults in the situation reveals that one's attachment to those on one's own side and to outcomes contributes to the anger one experiences when they are harmed.",
  "4.3.2.1.4.2.2.2.4": "Consideration of the results that follow from patience or anger in this context weighs the consequences, showing that patience preserves merit and averts suffering while anger destroys both.",
  "4.3.2.1.4.2.2.2.4.1": "Merit will not be diminished through patience, since forbearance in the face of harm to one's own side preserves the virtue that anger would otherwise destroy.",
  "4.3.2.1.4.2.2.2.4.2": "Suffering will be averted through patience, since the karmic consequences of retaliatory anger only compound the original harm to oneself and one's companions.",
  "4.3.2.1.4.2.2.2.4.3": "Great benefit will be achieved through patience, since bearing harm to one's own side with equanimity generates immense merit and draws one closer to awakening.",
  "4.3.2.1.4.2.3": "Stopping impatience with the production of good towards one's enemies addresses the jealousy and resentment that arise when rivals receive praise, happiness, or acquisitions.",
  "4.3.2.1.4.2.3.1": "Abandoning impatience with their being praised and renowned addresses the resentment that arises when one's enemies receive praise, even though such recognition should be welcomed rather than opposed.",
  "4.3.2.1.4.2.3.1.1": "Abandoning impatience since they cause one's own happiness shows that enemies' praise can bring joy to a sincere bodhisattva, who has vowed to bring happiness to all beings without exception.",
  "4.3.2.1.4.2.3.1.2": "Abandoning impatience since they cause others' happiness shows that begrudging the praise of enemies contradicts the bodhisattva's wish that all beings experience wellbeing and joy.",
  "4.3.2.1.4.2.3.2": "Abandoning impatience with their achieving happiness recognises that resenting an enemy's good fortune directly contradicts the bodhisattva vow to seek the welfare and happiness of all beings.",
  "4.3.2.1.4.2.3.3": "Abandoning impatience with their getting acquisitions addresses the grudging resentment that arises when enemies obtain wealth and resources, which has no bearing on one's own merit or practice.",
  "4.3.2.1.4.2.3.3.1": "When they get what they wish for, one should recognise that their success does not diminish one's own prospects, since acquisitions arise from their own merit and karma.",
  "4.3.2.1.4.2.3.3.2": "Not wishing for them not to have it reinforces that actively desiring one's enemy's deprivation contradicts the bodhisattva commitment and only generates further nonvirtue for oneself.",
  "4.3.2.1.4.3": "Ceasing anger towards those who obstruct desirable dharmas addresses impatience that arises when others prevent the good things one wants for oneself, one's side, or against one's enemies.",
  "4.3.2.1.4.3.1": "Abandoning impatience with those who obstruct accomplishing negative actions towards one's enemies shows that preventing harm to others is actually beneficial and should be welcomed rather than resented.",
  "4.3.2.1.4.3.2": "Abandoning impatience with those who obstruct good for oneself and one's own side addresses anger arising when worldly dharmas, merit, or spiritual progress are impeded by others.",
  "4.3.2.1.4.3.2.1": "Abandoning impatience with those who obstruct worldly dharmas examines why praise, reputation, and material success are unworthy of the anger their obstruction provokes.",
  "4.3.2.1.4.3.2.1.1": "Not regarding obstruction to worldly praise and reputation as harmful analyses from multiple angles why losing praise and fame causes no real damage, undermining anger at those who obstruct them.",
  "4.3.2.1.4.3.2.1.1.1": "Praise and reputation do not bring benefit or happiness, since they cannot protect one from suffering, extend one's life, or provide any lasting wellbeing.",
  "4.3.2.1.4.3.2.1.1.2": "Mere joy at being praised is not meaningful, since fleeting pleasure from words of approval provides nothing of substance and distracts from genuine spiritual aims.",
  "4.3.2.1.4.3.2.1.1.3": "Misconceived grasping for meaning in praise arises from wrongly believing that the words of others can establish one's worth, when in fact they alter nothing real.",
  "4.3.2.1.4.3.2.1.1.4": "Misconceived happiness from praise and reputation is examined through four considerations -- the sound itself, the praiser's intent, a counterfactual, and a summary -- to expose its insubstantiality.",
  "4.3.2.1.4.3.2.1.1.4.1": "The mere sound is inappropriate as a cause of joy, since words of praise are empty vibrations that convey no actual benefit to the one being praised.",
  "4.3.2.1.4.3.2.1.1.4.2": "The intention of the one giving praise is inappropriate as a cause of joy, since the praiser is motivated by their own purposes and their goodwill is directed at their own mental image of oneself.",
  "4.3.2.1.4.3.2.1.1.4.3": "Establishing that by a counterfactual -- if another's joy were a valid cause for one's own happiness, one should be happy when anyone is praised -- exposes the inconsistency of taking pleasure in praise.",
  "4.3.2.1.4.3.2.1.1.4.4": "Summarizing the analysis of misconceived happiness from praise confirms that upon examination, no aspect of being praised warrants the attachment or anger its presence or absence provokes.",
  "4.3.2.1.4.3.2.1.2": "Regarding the cessation of worldly dharmas as beneficial reframes the loss of praise and reputation as actually advantageous, preventing lower rebirth and accomplishing liberation.",
  "4.3.2.1.4.3.2.1.2.1": "It prevents rebirth in the lower realms because attachment to praise and reputation creates the nonvirtue that leads to suffering, so their cessation removes a dangerous cause.",
  "4.3.2.1.4.3.2.1.2.2": "It accomplishes liberation because freedom from attachment to worldly dharmas removes the bonds that chain one to samsara, making their cessation a cause for rejoicing.",
  "4.3.2.1.4.3.2.2": "Abandoning impatience with those who obstruct merit addresses anger that arises when others interfere with one's virtuous practice and spiritual accumulations.",
  "4.3.2.1.4.3.2.2.1": "It is contradictory to be angry with someone obstructing merit, since anger itself destroys merit far more effectively than any external obstruction could.",
  "4.3.2.1.4.3.2.2.2": "They are not actually an obstruction to merit because patience practised in the face of interference itself becomes a powerful source of merit.",
  "4.3.2.1.4.3.2.2.3": "Considering them as objects of respect recognises that those who obstruct one's merit provide the very conditions needed for practising patience, making them worthy of honour rather than anger.",
  "4.3.2.1.4.3.2.2.3.1": "One should respect them for their own qualities, since harm-doers possess the capacity to catalyse patience and are therefore greatly beneficial, comparable to the Teacher in the merit they help generate.",
  "4.3.2.1.4.3.2.2.3.1.1": "They are greatly beneficial because without harm-doers one would have no occasion to practise patience, making them indispensable conditions for developing this paramita.",
  "4.3.2.1.4.3.2.2.3.1.2": "Overlooking the factor of intention acknowledges that although harm-doers lack the wish to benefit, their effect is nonetheless beneficial, just as dharma treasures benefit without intending to.",
  "4.3.2.1.4.3.2.2.3.1.3": "Regarding them therefore as like the Teacher elevates harm-doers to the status of spiritual guides, since both equally serve as conditions for accumulating merit through patience.",
  "4.3.2.1.4.3.2.2.3.1.3.1": "A brief scriptural presentation cites the Buddha's own teaching that sentient beings and Buddhas are equally fields of merit, grounding the comparison with the Teacher in authoritative sources.",
  "4.3.2.1.4.3.2.2.3.1.3.2": "Establishing the fact of that comparison shows through reasoning that since both sentient beings and Buddhas serve as conditions for attaining buddhahood, they merit equal respect.",
  "4.3.2.1.4.3.2.2.3.1.3.3": "Therefore they are equal as objects of respect, since the boundless qualities attained through reliance on sentient beings confirm their status as a supreme field of merit alongside the Buddhas.",
  "4.3.2.1.4.3.2.2.3.1.3.4": "Abandoning an objection addresses the counterargument that sentient beings lack the Buddha's qualities, clarifying that it is the result produced through them, not their personal attainment, that establishes their equality as objects of respect.",
  "4.3.2.1.4.3.2.2.3.1.3.5": "Summarizing the comparison with the Teacher consolidates the understanding that harm-doers deserve respect as a field of merit, drawing together the same result, the different qualities, and the excellence of sentient beings.",
  "4.3.2.1.4.3.2.2.3.1.3.5.1": "The same result -- attainment of buddhahood -- follows from reliance on both sentient beings and Buddhas, establishing one dimension of their equality as objects of respect.",
  "4.3.2.1.4.3.2.2.3.1.3.5.2": "Different qualities distinguish sentient beings from Buddhas, yet this difference does not diminish the respect owed to beings whose limitless nature renders any slight an offence against the immeasurable.",
  "4.3.2.1.4.3.2.2.3.1.3.5.3": "Summarizing the fact that sentient beings are an excellent field of merit confirms that even a small act of virtue directed toward them yields boundless results, sealing the case for regarding them with the highest respect.",
  "4.3.2.1.4.3.2.2.3.2": "One should respect them out of one's faith in the Buddhas, since the Buddhas themselves cherish sentient beings as their own and have declared pleasing beings the path to pleasing the Buddhas.",
  "4.3.2.1.4.3.2.2.3.2.1": "The Buddhas treat sentient beings as their own, having dedicated countless lifetimes to their welfare, making harm toward beings an affront to the Buddhas' deepest commitment.",
  "4.3.2.1.4.3.2.2.3.2.1.1": "Briefly expressing this states concisely that the Buddhas regard sentient beings with the same care as they regard themselves, establishing the foundation for respecting beings out of faith.",
  "4.3.2.1.4.3.2.2.3.2.1.2": "One should be patient with harm-doers because the Buddhas sacrificed everything for the sake of sentient beings, making anger toward those same beings a direct contradiction of the Buddhas' intent.",
  "4.3.2.1.4.3.2.2.3.2.1.3": "Abandoning self-importance follows from recognising that the Buddhas placed beings above themselves, so one should serve sentient beings rather than asserting one's own status or grievances.",
  "4.3.2.1.4.3.2.2.3.2.1.4": "Abandoning harm toward sentient beings is imperative because injuring those the Buddhas cherish brings suffering upon oneself and creates no benefit whatsoever.",
  "4.3.2.1.4.3.2.2.3.2.1.5": "Confessing needless faults before the Sage acknowledges past failures of patience and resolves to correct them, expressing remorse for having harmed the beings the Buddhas hold dear.",
  "4.3.2.1.4.3.2.2.3.2.1.6": "Desisting from now on commits the practitioner to pleasing the Tathagatas henceforth by serving sentient beings and refraining from harm, sealing the resolve born of faith in the Buddhas.",
  "4.3.2.1.4.3.2.2.3.2.2": "The Buddhas treat sentient beings as themselves, identifying so completely with all beings that harming any sentient being is indistinguishable from harming the Buddhas in person.",
  "4.3.2.2": "Keeping in mind the results of patience completes the skilful means by showing the excellent outcomes that follow from practising patience, reinforcing the motivation to sustain this paramita.",
  "4.3.2.2.1": "A brief presentation introduces the results of patience in condensed form, establishing that patience brings happiness in this life and awakening in lives to come.",
  "4.3.2.2.2": "An example from the perspective of the result illustrates how patience produces wellbeing, using a concrete comparison to make the abstract benefits tangible and memorable.",
  "4.3.2.2.3": "The example is far outweighed by the actual result, since the benefits of patience extend immeasurably beyond any worldly comparison, reaching all the way to complete awakening.",
  "4.3.2.2.4": "A summary enumeration of results gathers together the many fruits of patience -- beauty, health, renown, longevity, and the happiness of a universal monarch -- to conclude the discussion of its benefits.",
  "4.4": "Effort, defined as joy in virtue, is the paramita through which the bodhisattva energetically accomplishes the training.",
  "4.4.1": "Developing enthusiasm for effort establishes that enlightenment depends on effort, just as movement depends on wind, motivating the bodhisattva's training in this paramita.",
  "4.4.2": "Defining the nature of effort as joy in virtue distinguishes it from mundane pleasure and nonvirtuous engagement within the bodhisattva's training.",
  "4.4.3": "Abandoning the opposing factors of laziness, attachment to negativity, and despondency clears the way for genuine effort in the bodhisattva's training.",
  "4.4.3.1": "Summarizing the three opposing factors -- laziness, attachment to the negative, and despondent self-loathing -- identifies what must be abandoned to practise effort.",
  "4.4.3.2": "Abandoning the laziness of non-application addresses the inertia and complacency that prevent one from engaging in virtuous effort.",
  "4.4.3.2.1": "Examining how the sweet taste of inactivity and craving for sleep give rise to laziness reveals the cause of non-application so it can be averted.",
  "4.4.3.2.2": "Examining the faults of this life -- impermanence, the certainty of death, and the suffering it brings -- averts the laziness of non-application by dispelling complacency.",
  "4.4.3.2.2.1": "Having certainty about impermanence, recognizing that one is caught in the trap of rebirth and will disappear into the jaws of death, dispels the complacency that sustains laziness.",
  "4.4.3.2.2.2": "Seeing the example of cattle oblivious before their butchers illustrates how beings fail to recognize impermanence even when death is plainly visible all around them.",
  "4.4.3.2.2.3": "Recognizing that death will befall one personally, with all escape routes blocked, makes it impossible to justify remaining in the sleep of inactivity.",
  "4.4.3.2.2.4": "Acknowledging the impossibility of holding back time reveals that death approaches so swiftly there is no opportunity to accumulate merit through delay.",
  "4.4.3.2.2.5": "Realizing that the time of death is too late for practice shows that even if one abandoned laziness at that moment, nothing could be accomplished.",
  "4.4.3.2.2.6": "Explaining the impossibility of holding back time depicts how death arrives while tasks remain undone, half-started, or incomplete, leaving only despair.",
  "4.4.3.2.2.7": "Describing the actual kinds of suffering at death -- the grief of family, the visions of hell, and overwhelming terror -- makes vivid the consequences of remaining lazy in this life.",
  "4.4.3.2.3": "Examining the sufferings of future lives and averting them strengthens the resolve to abandon non-application by contemplating what awaits beyond death.",
  "4.4.3.2.3.1": "Establishing that suffering is certain to arise in future lives, since the torments of hell far exceed even the terror of dying, deepens the urgency to abandon laziness now.",
  "4.4.3.2.3.2": "Presenting the difficult consideration of how one can rest content having created the causes for rebirth in the heating hells confronts the practitioner with the gravity of inaction.",
  "4.4.3.2.3.3": "Exposing the mass of contradictions -- wanting happiness without effort, being sensitive to harm yet amassing its causes -- reveals the absurdity of remaining lazy.",
  "4.4.3.2.3.4": "The exhortation to use the boat of human life to cross the great river of suffering urges one toward the means of liberation before this rare opportunity is lost.",
  "4.4.3.3": "Abandoning the laziness of negative behaviour shows that finding joy in distractions and agitation rather than in the holy dharma exchanges a limitless cause of joy for causes of suffering.",
  "4.4.3.4": "Abandoning the laziness of despondency overcomes the self-defeating belief that one is incapable of attaining enlightenment, a third obstacle to effort.",
  "4.4.3.4.1": "Briefly explaining the antidotes and their result previews how the powers, dedication, and self-control will overcome despondency and lead to the exchange of self and others.",
  "4.4.3.4.2": "The antidote to thinking one lacks the cause for enlightenment invokes the Buddha's teaching that even insects could attain buddhahood through effort, so a human surely can.",
  "4.4.3.4.3": "The antidote to the despondency of impatience with application reframes the difficulties of practice as bearable, beneficial, and ultimately a source of happiness.",
  "4.4.3.4.3.1": "Showing that the difficulties of practice have great benefit reveals that limited purposeful suffering for enlightenment is incomparably lighter than the meaningless suffering endured throughout samsara.",
  "4.4.3.4.3.2": "Establishing that practice is not suffering shows that the supreme physician's gentle methods, beginning with giving away vegetables, gradually make even great generosity effortless through familiarization.",
  "4.4.3.4.3.3": "Recognizing that practice is actually happiness -- since merit brings physical pleasure, wisdom brings mental joy, and bodhicitta exhausts former nonvirtues -- dispels all grounds for despondency.",
  "4.4.4": "Fully developing effort sets forth the means by which the four powers, dedication, and self-control bring the paramita of effort to completion.",
  "4.4.4.1": "Briefly, the four powers of motivation, steadfastness, joy, and rest accomplish the benefit of beings, and enhancing all six factors causes effort to increase.",
  "4.4.4.2": "Extensively unfolding the development of effort presents the detailed cultivation of the array of powers, dedication, and self-control.",
  "4.4.4.2.1": "Developing the array of four powers -- motivation, steadfastness, joy, and rest -- provides the driving forces that sustain and strengthen effort in practice.",
  "4.4.4.2.1.1": "The power of motivation, which engages the armour of unshakeable aspiration, is the first force that drives effort forward through its object, result, cause, and conclusion.",
  "4.4.4.2.1.1.1": "Identifying the object of motivation encompasses the vast scope of faults to abandon, qualities to accomplish, and kinds of acts that have been neglected.",
  "4.4.4.2.1.1.1.1": "Abandoning the faults of oneself and others, even though each fault may take an ocean of aeons to exhaust, reveals the urgency that should fuel the power of motivation.",
  "4.4.4.2.1.1.1.2": "Accomplishing all good qualities of oneself and others, recognizing how little familiarity one has developed, highlights the meaningful purpose toward which motivation must be directed.",
  "4.4.4.2.1.1.1.3": "Enumerating the kinds of acts left undone -- offerings, service to the teachings, protecting the frightened, comforting the destitute -- exposes the full scope of what motivation should embrace.",
  "4.4.4.2.1.1.2": "The result of motivation is the arising of all virtuous pursuits, shown by the fact that past destitution followed from lacking motivation for dharma.",
  "4.4.4.2.1.1.3": "The cause of motivation is conviction in karma, cultivated through continual meditation on how actions ripen into their corresponding results.",
  "4.4.4.2.1.1.3.1": "Contemplating the result of mixed actions shows how suffering and separation from desires come from nonvirtue while merit presents its gifts of happiness wherever one goes.",
  "4.4.4.2.1.1.3.2": "Contemplating the ripening of purely white actions envisions the virtuous arising from a lotus in a supreme form to become children of the Sugatas in the presence of the Conqueror.",
  "4.4.4.2.1.1.3.3": "Contemplating the ripening of purely black actions depicts the nonvirtuous falling upon blazing iron ground while servants of the Lord of Death inflict relentless torment.",
  "4.4.4.2.1.1.4": "Concluding the discussion of motivation, one resolves to be motivated to virtue and to develop enthusiasm for it, sealing the aspiration that drives effort.",
  "4.4.4.2.1.2": "The power of steadfastness provides unfaltering application through stable preparation before undertaking a task and stable engagement once committed to it.",
  "4.4.4.2.1.2.1": "Stable preparation ensures that one enters into practice with the right assessment and resolve, neither deterred by difficulty nor reckless in taking on what cannot be completed.",
  "4.4.4.2.1.2.1.1": "The method of not being deterred cultivates pride from the outset, following the example of Vajradhvaja, who like the rising sun was not stopped by any obstacles in benefiting beings.",
  "4.4.4.2.1.2.1.2": "The method of preparation requires assessing one's own resources before undertaking a task, since it is better not to begin than to begin and then abandon the effort.",
  "4.4.4.2.1.2.1.3": "The fault of not completing what one has started is that the habit of giving up continues into future lives, increasing nonvirtue and weakening all other actions and their results.",
  "4.4.4.2.1.2.2": "Stable engagement sustains effort through three forms of pride -- in actions, in ability, and in overcoming defilements -- once one has committed to practice.",
  "4.4.4.2.1.2.2.1": "Briefly, one should take pride in three things -- actions, defilements, and ability -- as the foundation of stable engagement in effort.",
  "4.4.4.2.1.2.2.2": "Pride in actions, the confidence that one alone can properly carry out antidotal practices, is the first support for stable engagement in effort.",
  "4.4.4.2.1.2.2.2.1": "Briefly stated, pride in actions is the resolve to do it alone, considering oneself uniquely capable of engaging these antidotal practices.",
  "4.4.4.2.1.2.2.2.2": "Extensively, pride in actions arises from seeing that the world is overpowered by defilements and beings cannot accomplish virtue for themselves, so one resolves to do it for them.",
  "4.4.4.2.1.2.2.2.3": "Benefitting others engaged in inferior actions questions how one can sit idle while others perform lowly tasks, strengthening the resolve to take on the work of liberation oneself.",
  "4.4.4.2.1.2.2.3": "Pride in ability, the confidence that one can abandon faults and accomplish good qualities beyond what others achieve, sustains stable engagement through self-assurance.",
  "4.4.4.2.1.2.2.3.1": "The logic of reliance on pride in ability demonstrates why this confidence is essential, what happens without it, and how its cultivation protects one's vows.",
  "4.4.4.2.1.2.2.3.1.1": "Showing the fault by example, just as a weakened snake is attacked by scavengers, one whose antidotes are weak will be harmed by even small downfalls.",
  "4.4.4.2.1.2.2.3.1.2": "The cause of that weakness arising is discouragement, for when one gives up trying, one takes no pride in ability and remains trapped in destitution.",
  "4.4.4.2.1.2.2.3.1.3": "The greatness of that pride lies in the fact that the proud, generating exertion, can handle even the most formidable difficulties.",
  "4.4.4.2.1.2.2.3.1.4": "Striving to rely on that pride, one resolves with a steady mind to overcome all downfalls through the strength of confident ability.",
  "4.4.4.2.1.2.2.3.1.5": "If one does not strive in this pride, one's vows will be broken, for being defeated by the defilements would make the wish to conquer the three realms a joke.",
  "4.4.4.2.1.2.2.3.2": "The means of reliance on pride in ability specifies the nature of antidotal pride, distinguishes it from defiled pride, praises its qualities, and applies it to overcoming defilements.",
  "4.4.4.2.1.2.2.3.2.1": "The nature of antidotal pride is the resolve to conquer all and be conquered by nothing, as befits a child of conquering lions who should abide in this confidence.",
  "4.4.4.2.1.2.2.3.2.2": "Clarifying that this pride does not mean defiled pride distinguishes the wholesome self-confidence of the bodhisattva from the arrogance that leads to lower rebirths and shame.",
  "4.4.4.2.1.2.2.3.2.3": "Developing enthusiasm by praising antidotal pride celebrates the one who conquers the enemy pride as a true hero who brings the fruits of victory to completion for all beings.",
  "4.4.4.2.1.2.2.3.2.4": "Pride in overcoming the defilements cultivates the strength to withstand them in a thousand ways, like a lion among foxes, refusing to be conquered by the afflictions.",
  "4.4.4.2.1.3": "The power of joy sustains effort through delighting in virtuous actions themselves, considering their results with confidence, and applying that delight wholeheartedly.",
  "4.4.4.2.1.3.1": "Enjoying the play of good actions without concern for a result means carrying out virtuous deeds with the insatiable delight of someone who plays a game for its own reward.",
  "4.4.4.2.1.3.2": "Considering the result brings further enjoyment, since the fruits of antidotal actions are certain and their happiness surpasses the fleeting pleasures of the senses.",
  "4.4.4.2.1.3.2.1": "Certainty that the result will come distinguishes virtuous practice from ordinary pursuits, for while worldly outcomes are doubtful, the results of antidotal actions never fail.",
  "4.4.4.2.1.3.2.2": "Consideration of what is better contrasts the insatiable craving for sense pleasures, which are like honey on a razor's edge, with the inexhaustible merit that ripens in lasting happiness.",
  "4.4.4.2.1.3.3": "Applying the power of joy means plunging into virtuous action like an elephant tormented by the midday sun diving eagerly into a cool lake.",
  "4.4.4.2.1.4": "The power of rest ensures sustained effort by knowing when to pause temporarily and when to finish properly before moving on to the next task.",
  "4.4.4.2.1.4.1": "Temporary rest means that when strength declines, one should set aside the activity so as to return to it later with renewed energy.",
  "4.4.4.2.1.4.2": "Finishing rest means that when something has been completed properly, one should set it aside with eagerness to get on with the next undertaking.",
  "4.4.4.2.2": "Dedication channels the energy of effort through concern, mindfulness, vigilance against opposing circumstances, overcoming obstacles, and accomplishing supporting actions.",
  "4.4.4.2.2.1": "Dedication to concern means engaging the defilements like a veteran warrior in a sword fight, dodging their weapons while cutting them down with their antidotes.",
  "4.4.4.2.2.2": "Dedication to mindfulness and clear comprehension means swiftly restoring the blade of mindfulness whenever it is lost, just as a soldier would snatch up a dropped sword in battle.",
  "4.4.4.2.2.3": "Not allowing circumstances to arise which oppose mindfulness and concern requires the vigilance of one carrying a pot of oil under threat of death if any is spilled, preventing faults from finding an opportunity to spread.",
  "4.4.4.2.2.4": "Overcoming the arising of opposing circumstances means repelling sleep, lethargy, and downfalls the moment they appear, like jumping up when a snake slides onto one's lap.",
  "4.4.4.2.2.5": "Subsequently accomplishing supporting actions involves planning for occasions of meeting teachers and practising their meditations, which develop the mindfulness that sustains effort.",
  "4.4.4.2.3": "Self-control, the culmination of fully developing effort, means being fully prepared before any act and then moving under the power of enthusiasm like cotton blown freely by the wind.",
  "4.5": "Meditation accomplishes the bodhisattva's training by cultivating calm abiding as a cooperating condition.",
  "4.5.1": "Abandoning contradictory factors clears away the obstacles that prevent meditation from accomplishing the bodhisattva's training.",
  "4.5.1.1": "A brief overview introduces the need to abandon contradictory factors that obstruct the meditation accomplishing the bodhisattva's training.",
  "4.5.1.2": "Abandoning the world removes the primary contradictory factor that prevents meditation from accomplishing the bodhisattva's training.",
  "4.5.1.2.1": "Identifying the causes of not abandoning the world reveals what keeps one entangled and unable to abandon this contradictory factor to meditation.",
  "4.5.1.2.2": "Recognizing the greatness of the antidote to those causes inspires one to abandon worldly involvement as a contradictory factor to meditation.",
  "4.5.1.2.3": "Understanding how the antidotes are accomplished provides the method for abandoning the world as a contradictory factor to meditation.",
  "4.5.1.2.3.1": "Establishing non-attachment towards sentient beings accomplishes the antidote to worldly involvement that contradicts meditation.",
  "4.5.1.2.3.1.1": "Examining the faults of the subject with attachment helps establish non-attachment towards sentient beings as the antidote to worldly involvement that contradicts meditation.",
  "4.5.1.2.3.1.1.1": "Recognizing that one does not attain the desired person reveals a fault of attachment that obstructs non-attachment towards sentient beings in abandoning the world for meditation.",
  "4.5.1.2.3.1.1.2": "Seeing that one is disturbed when one does not see the desired person exposes another fault of attachment that obstructs non-attachment towards sentient beings in abandoning the world for meditation.",
  "4.5.1.2.3.1.1.3": "Understanding that one's misery knows no end through attachment reveals how clinging to sentient beings perpetuates suffering and obstructs abandoning the world for meditation.",
  "4.5.1.2.3.1.1.4": "Recognizing that one does not attain liberation through attachment shows how clinging to sentient beings blocks the very goal of abandoning the world for meditation.",
  "4.5.1.2.3.1.1.5": "Seeing that freedom and opportunity are wasted through attachment demonstrates how clinging to sentient beings squanders the precious conditions needed for abandoning the world and practising meditation.",
  "4.5.1.2.3.1.2": "Examining the faults of the desired object itself helps establish non-attachment towards sentient beings as the antidote to worldly involvement that contradicts meditation.",
  "4.5.1.2.3.1.2.1": "Seeing that desired objects destroy great benefits reveals a fault of the object that supports non-attachment towards sentient beings in abandoning the world for meditation.",
  "4.5.1.2.3.1.2.2": "Understanding that desired objects lead one to lower rebirths exposes a grave fault of attachment objects that reinforces non-attachment in abandoning the world for meditation.",
  "4.5.1.2.3.1.2.3": "Recognizing that desired objects are unreliable undermines the basis of attachment to sentient beings and supports abandoning the world for meditation.",
  "4.5.1.2.3.1.2.4": "Seeing that desired objects are difficult to please reveals the futility of clinging to sentient beings when one should be abandoning the world for meditation.",
  "4.5.1.2.3.1.2.5": "Understanding that one does not get any benefit from desired objects reinforces the resolve to establish non-attachment towards sentient beings in abandoning the world for meditation.",
  "4.5.1.2.3.1.2.6": "Recognizing that one engages in faults through desired objects shows how attachment to sentient beings generates wrongdoing that obstructs abandoning the world for meditation.",
  "4.5.1.2.3.1.2.7": "Summarizing the faults of desired objects consolidates the case for non-attachment towards sentient beings in abandoning the world as a contradictory factor to meditation.",
  "4.5.1.2.3.1.2.8": "Knowing how to abandon desired objects completes the understanding of non-attachment towards sentient beings needed for abandoning the world as a contradictory factor to meditation.",
  "4.5.1.2.3.2": "Establishing non-attachment towards possessions accomplishes the antidote to worldly involvement that contradicts meditation.",
  "4.5.1.2.3.2.1": "Examining the faults of the subject with attachment to possessions helps establish non-attachment that supports abandoning the world as a contradictory factor to meditation.",
  "4.5.1.2.3.2.2": "Examining the faults of the desired object of possessions helps establish non-attachment that supports abandoning the world as a contradictory factor to meditation.",
  "4.5.1.2.3.2.2.1": "Recognizing the volatility of possessions reveals a key fault of the desired object that supports non-attachment in abandoning the world for meditation.",
  "4.5.1.2.3.2.2.2": "Understanding that praise and criticism are neither beneficial nor harmful reveals a fault of grasping at possessions that supports non-attachment in abandoning the world for meditation.",
  "4.5.1.2.4": "Contemplating the faults of worldly involvement reinforces the motivation to abandon the world as a contradictory factor to meditation.",
  "4.5.1.2.5": "Appreciating the qualities of non-distraction inspires one to abandon the world as a contradictory factor to meditation.",
  "4.5.1.2.5.1": "Having suitable friends as companions supports the qualities of non-distraction that arise from abandoning the world for meditation.",
  "4.5.1.2.5.2": "Dwelling in suitable places supports the qualities of non-distraction that arise from abandoning the world for meditation.",
  "4.5.1.2.5.3": "Maintaining a suitable livelihood supports the qualities of non-distraction that arise from abandoning the world for meditation.",
  "4.5.1.2.5.4": "Cultivating correct discriminations supports the qualities of non-distraction that arise from abandoning the world for meditation.",
  "4.5.1.2.5.4.1": "Contemplating impurity as a discrimination supports non-distraction in the context of abandoning the world for meditation.",
  "4.5.1.2.5.4.2": "Contemplating the inevitability of separation from friends as a discrimination supports non-distraction in the context of abandoning the world for meditation.",
  "4.5.1.2.5.4.3": "Recognizing that they are not truly friends as a discrimination supports non-distraction in the context of abandoning the world for meditation.",
  "4.5.1.2.5.4.4": "Recognizing that they are unreliable as a discrimination supports non-distraction in the context of abandoning the world for meditation.",
  "4.5.1.2.5.5": "Maintaining non-distraction itself completes the understanding of the qualities that arise from abandoning the world for meditation.",
  "4.5.1.3": "Giving up conceptual discrimination removes a further contradictory factor that obstructs meditation in accomplishing the bodhisattva's training.",
  "4.5.1.3.1": "Examining how the result is destroyed reveals why conceptual discrimination must be given up as a contradictory factor to meditation.",
  "4.5.1.3.2": "Examining the impure nature provides the means to give up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1": "Meditating on impurity connected with the burial ground helps examine the impure nature so as to give up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.1": "Understanding that the result is not what one thinks supports the burial ground meditation on impurity that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.1.1": "Recognizing the uncleanliness of the body reveals that the result is not what one thinks, supporting the burial ground impurity meditation that gives up conceptual discrimination for meditation.",
  "4.5.1.3.2.1.1.2": "Seeing how attachment obstructs the door to liberation reveals that the result is not what one thinks, supporting the burial ground impurity meditation that gives up conceptual discrimination for meditation.",
  "4.5.1.3.2.1.2": "Seeing that the body is nothing other than what is discarded in the burial ground deepens the impurity meditation that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.3": "Recognizing that it is not logical to selfishly protect the body deepens the burial ground impurity meditation that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.4": "Recognizing that it is not logical to attach ornaments to the body deepens the burial ground impurity meditation that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.5": "Recognizing that it is not logical to be so afraid of the body deepens the burial ground impurity meditation that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.1.6": "Understanding that adorning the body with clothes does not make it desirable completes the burial ground impurity meditation that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2": "Meditating on impurity connected with the living helps examine the impure nature so as to give up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.1": "Seeing the impurity of the living directly provides immediate evidence that supports giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2": "Making certain of impurity with reasoning strengthens the meditation on impurity connected with the living that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2.1": "Establishing impurity by the cause which produces impurity uses reasoning to confirm the impurity of the living body, giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2.2": "Analysing impurity by its impure result uses reasoning to confirm the impurity of the living body, giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2.3": "Establishing that it makes no sense to want impurity uses reasoning to confirm the impurity of the living body, giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2.4": "Establishing the impurity of one's own body uses reasoning to confirm the impurity of the living body, giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.2.2.2.5": "Summarizing freedom from attachment by applying the meditation on impurity completes the reasoning that confirms the impurity of the living body, giving up conceptual discrimination for meditation.",
  "4.5.1.3.2.3": "Negating the characteristics of purity completes the examination of the impure nature that gives up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.3": "Considering how harm is abandoned by its cause provides a further means to give up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.3.1": "An explanation of how harm is abandoned by its cause introduces this further means of giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.3.2": "An elaboration on how harm is abandoned by its cause details this further means of giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.3.2.1": "Seeing that the desirable object itself is not attained elaborates on how harm is abandoned by its cause in giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.1.3.3.2.2": "Recognizing other faults connected with that elaborates on how harm is abandoned by its cause in giving up conceptual discrimination as a contradictory factor to meditation.",
  "4.5.2": "Developing joy in solitude provides the positive foundation for meditation that accomplishes the bodhisattva's training.",
  "4.5.2.1": "Recognizing the unique preeminence of solitude inspires the development of joy in solitude that supports meditation.",
  "4.5.2.1.1": "An explanation of solitude's preeminence establishes why developing joy in solitude is essential for the meditation that accomplishes the bodhisattva's training.",
  "4.5.2.1.2": "Having no opposing conditions demonstrates the unique preeminence of solitude that supports developing joy for meditation.",
  "4.5.2.1.3": "Having supporting conditions demonstrates the unique preeminence of solitude that supports developing joy for meditation.",
  "4.5.2.2": "Experiencing the unique happiness of solitude completes the development of joy in solitude that supports meditation in accomplishing the bodhisattva's training.",
  "4.5.3": "Focussing the mind on samatha is the central practice of meditation that accomplishes the bodhisattva's training.",
  "4.5.3.1": "Equalizing self and others is the first stage of focussing the mind on samatha within the meditation that accomplishes the bodhisattva's training.",
  "4.5.3.1.1": "A brief explanation introduces the practice of equalizing self and others as a way of focussing the mind on samatha in meditation.",
  "4.5.3.1.2": "Recognizing equality of subjection to suffering from self-grasping deepens the equalization of self and others within samatha meditation.",
  "4.5.3.1.2.1": "An explanation of how all are equally subject to suffering from self-grasping supports equalizing self and others within samatha meditation.",
  "4.5.3.1.2.2": "Accomplishing this equality of subjection to suffering from self-grasping puts into practice the equalization of self and others within samatha meditation.",
  "4.5.3.1.3": "Establishing equality in suffering as the object of abandonment deepens the equalization of self and others within samatha meditation.",
  "4.5.3.1.3.1": "A brief presentation of the proof establishes equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.3.2": "Establishing the pervasion of that proof strengthens the case for equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.3.3": "Establishing the necessary criterion of the pervasion secures the proof for equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.3.3.1": "Examining the error that follows from the different times tests the necessary criterion of the pervasion in the proof for equality in suffering within samatha meditation.",
  "4.5.3.1.3.3.2": "Establishing that grasping the self as singular is error tests the necessary criterion of the pervasion in the proof for equality in suffering within samatha meditation.",
  "4.5.3.1.3.3.3": "Examining the error that follows from the parts of the body tests the necessary criterion of the pervasion in the proof for equality in suffering within samatha meditation.",
  "4.5.3.1.3.3.4": "Abandoning the consequence that the example is not established secures the necessary criterion of the pervasion in the proof for equality in suffering within samatha meditation.",
  "4.5.3.1.3.4": "Abandoning objections defends equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.3.5": "Summarizing the definitive meaning of valid cognition consolidates equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.3.6": "Abandoning objections that it is not definitive finalizes equality in suffering as the object of abandonment in equalizing self and others within samatha meditation.",
  "4.5.3.1.4": "Appreciating the qualities of meditating on equality motivates the practice of equalizing self and others within samatha meditation.",
  "4.5.3.1.4.1": "Undertaking the benefit of others with happiness reveals a quality of meditating on equality that motivates equalizing self and others within samatha meditation.",
  "4.5.3.1.4.2": "Establishing that to accomplish the benefit of others is the supreme happiness reveals the highest quality of meditating on equality within samatha meditation.",
  "4.5.3.1.4.3": "Pacifying one's own arrogance through meditating on equality removes a subtle obstacle in equalizing self and others within samatha meditation.",
  "4.5.3.1.4.4": "Disregarding the results of meditating on equality cultivates selflessness in equalizing self and others within samatha meditation.",
  "4.5.3.1.4.5": "Advice to strive in practising equality inspires diligent application of equalizing self and others within samatha meditation.",
  "4.5.3.1.5": "Establishing the possibility of meditating on equality confirms that equalizing self and others is indeed achievable within samatha meditation.",
  "4.5.3.2": "Exchanging oneself and others is the advanced practice of focussing the mind on samatha within the meditation that accomplishes the bodhisattva's training.",
  "4.5.3.2.1": "A brief description of the essential characteristics introduces the practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.1.1": "Establishing the aspiration provides the motivational aspect of the essential characteristics of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.1.2": "Establishing the application provides the practical aspect of the essential characteristics of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2": "A detailed explanation of the essential characteristics deepens the understanding of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1": "Accepting others into one's concern is the first essential characteristic of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.1": "Establishing the possibility of exchanging oneself and others lays the foundation for accepting others into one's concern within samatha meditation.",
  "4.5.3.2.2.1.2": "Pacifying arrogance through accepting others removes a key obstacle in the practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.3": "Disregarding the results of accepting others cultivates selfless motivation in the practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.4": "Advice to strive in practising the acceptance of others inspires diligent application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.5": "A particular practice for the benefit of others specifies a concrete method for accepting others in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.6": "Accomplishing the exchange by habituation shows how repeated practice makes accepting others natural in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.1.7": "Achieving liberation of self and others from suffering reveals the ultimate fruit of accepting others in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2": "Abandoning clinging to 'I' is the second essential characteristic of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.1": "Seeing that out of attachment to one's body one is afraid of things which are not frightening exposes a fault of clinging to 'I' in the practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.2": "Recognizing that clinging to 'I' leads to getting involved in all kinds of nonvirtue strengthens the resolve to abandon self-clinging in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3": "Contrasting the faults of putting oneself first with the qualities of putting others first motivates abandoning clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.1": "Examining various faults and qualities of self-cherishing versus cherishing others motivates abandoning clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.2": "Detailing the faults of self-cherishing deepens the contrast with putting others first that motivates abandoning clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.2.1": "Exposing the invisible faults of self-cherishing deepens the understanding of why one must abandon clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.2.2": "Exposing the visible faults of self-cherishing provides tangible evidence for why one must abandon clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.2.3": "A summary of the faults of self-cherishing consolidates the case for abandoning clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.3.2.4": "Abandoning the cause of fear through abandoning self-grasping completes the examination of self-cherishing's faults in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.4": "A summary consolidates the understanding of abandoning clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.4.1": "Clarifying the purpose of exchanging self and other summarizes why abandoning clinging to 'I' is necessary in samatha meditation.",
  "4.5.3.2.2.2.4.2": "Clarifying the nature of the exchange summarizes what abandoning clinging to 'I' entails in the practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.4.3": "Clarifying the specific intention summarizes the mental orientation required in abandoning clinging to 'I' for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.4.4": "Stopping incorrect application distinct from the correct application prevents errors in abandoning clinging to 'I' for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.2.2.4.5": "Establishing the correct application defines the right way to abandon clinging to 'I' in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3": "A detailed explanation of the practices related to aspiration specifies how to cultivate the wish to exchange oneself and others within samatha meditation.",
  "4.5.3.2.3.1": "A brief explanation introduces the aspiration practices that cultivate the wish to exchange oneself and others within samatha meditation.",
  "4.5.3.2.3.2": "Meditation on envy is the first aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.2.1": "Meditating on envy of worldly dharmas cultivates the aspiration to exchange oneself and others by assuming the perspective of those who are lower within samatha meditation.",
  "4.5.3.2.3.2.2": "Meditating on envy of good qualities cultivates the aspiration to exchange oneself and others by assuming the perspective of those who lack accomplishments within samatha meditation.",
  "4.5.3.2.3.2.3": "Understanding the outcome of meditating on envy reveals the transformative effect of this aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.2.3.1": "Developing the perspective of the assumed self is an outcome of meditating on envy that deepens the aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.2.3.2": "Having patience with the harm they may cause is an outcome of meditating on envy that strengthens the aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.2.3.3": "Disregarding one's good qualities which are unhelpful is an outcome of meditating on envy that matures the aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.2.3.4": "Having sympathy for those beings who are destined for rebirth in the lower realms is an outcome of meditating on envy that expands the aspiration to exchange oneself and others within samatha meditation.",
  "4.5.3.2.3.2.3.5": "Abandoning conceit and giving up aggression towards the learned is an outcome of meditating on envy that purifies the aspiration to exchange oneself and others within samatha meditation.",
  "4.5.3.2.3.3": "Meditation on competitiveness is the second aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.4": "Meditation on pride is the third aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.4.1": "Examining the types of pride specifies what must be addressed in the meditation on pride as an aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.4.2": "Appreciating the goodness of thinking about pride motivates the meditation on pride as an aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.4.3": "Having so meditated, identifying the practice to be relied on specifies the conduct that follows from the meditation on pride as an aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.4.4": "Addressing faults unrelated to pride ensures clarity within the meditation on pride as an aspiration practice for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.5": "Understanding the results of the meditations on envy, competitiveness, and pride completes the aspiration practices for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.5.1": "Recognizing the fault of looking after the unexchanged self demonstrates a result of failing to practise the aspiration meditations for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.5.2": "Appreciating the qualities of exchanging self and other demonstrates the positive result of the aspiration meditations within samatha meditation.",
  "4.5.3.2.3.5.3": "Experiencing the results of the meditations reveals the lived outcome of the aspiration practices for exchanging oneself and others within samatha meditation.",
  "4.5.3.2.3.5.4": "Making an effort to meditate for the sake of the results concludes the aspiration practices by urging diligent application in exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4": "A detailed explanation of the practices related to application specifies how to put exchanging oneself and others into action within samatha meditation.",
  "4.5.3.2.4.1": "Understanding how to accomplish the practice provides the method for applying the exchange of oneself and others within samatha meditation.",
  "4.5.3.2.4.1.1": "A general statement introduces how to accomplish the application practice of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.1.2": "Engaging in the practice for the benefit and happiness of others is a key method for accomplishing the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.1.3": "Taking on all faults oneself is a method for accomplishing the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.1.4": "Completely taking a lowly status for the benefit of others is a method for accomplishing the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.1.5": "A concise summary of the practice of accepting harm consolidates the methods for accomplishing the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.1.6": "Correctly protecting the mind ensures that the application of exchanging oneself and others within samatha meditation is sustained and stable.",
  "4.5.3.2.4.2": "Controlling the mind for practice ensures the sustained application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.1": "Subjugating the mind is the foundational aspect of controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2": "Recognizing the faults of activities for one's own sake supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2.1": "Recalling the meaningless actions of the past reveals a fault of self-serving activity that supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2.2": "Not giving away any control over the mind to self-serving impulses strengthens the practice of controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2.3": "Engaging in the practice of abandonment eliminates self-serving activities that obstruct controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2.4": "Recognizing the fault of not abandoning self-serving activities reinforces the need to control the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.2.5": "Contemplating the faults of self-serving activities completes the examination that supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3": "Recognizing the faults of taking the body as an object of grasping supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.1": "Examining dissatisfaction as a fault of grasping at the body supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.1.1": "Understanding the faults of dissatisfaction with the body supports controlling the mind by releasing bodily grasping in the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.1.2": "Appreciating the qualities of satisfaction counteracts dissatisfaction with the body, supporting the control of mind needed for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.2": "Examining immobility as a fault of grasping at the body supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.3": "Examining confusion as a fault of grasping at the body supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.3.1": "Examining confusion over good and bad exposes a fault of bodily grasping that supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.3.2": "Examining confusion over praise and blame exposes a fault of bodily grasping that supports controlling the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.3.3": "Abandoning an objection to this analysis secures the understanding that confusion from bodily grasping must be overcome for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.3.4": "Recognizing the necessity of a faulty support completes the examination of bodily grasping, clarifying how to control the mind for the application of exchanging oneself and others within samatha meditation.",
  "4.5.3.2.4.2.4": "Engaging in the practice of controlling the mind completes the application of exchanging oneself and others within the samatha meditation that accomplishes the bodhisattva's training.",
  "4.6": "Wisdom is the paramita that guides and gives purpose to all the other perfections within the bodhisattva's training.",
  "4.6.1": "Cultivating wisdom is necessary because without it the other perfections lack the insight that directs them toward liberation within the bodhisattva's training.",
  "4.6.1.1": "Understanding the relation of the perfections to wisdom shows that generosity and the rest were taught for the sake of wisdom, which is their principal within the training.",
  "4.6.1.2": "Understanding the relation of the two truths to wisdom provides the framework of conventional and ultimate reality that one must strive in to cultivate the wisdom of the training.",
  "4.6.2": "A detailed explanation of the meditation on wisdom unfolds the specific practices by which the bodhisattva realizes the emptiness of intrinsic nature.",
  "4.6.2.1": "Establishing the object as empty by examining the person demonstrates that neither the self nor its constituents withstand analysis, laying the ground for the meditation on wisdom.",
  "4.6.2.1.1": "Presenting the nature of the two truths in our tradition establishes the Madhyamaka framework within which the person is examined and found to be empty.",
  "4.6.2.1.1.1": "Distinguishing the two truths clarifies how conventional and ultimate reality are differentiated within our tradition's account of the nature of the two truths.",
  "4.6.2.1.1.1.1": "Identifying the basis of the distinction reveals what grounds the division into two truths as one begins to distinguish conventional from ultimate reality.",
  "4.6.2.1.1.1.2": "Explaining the meaning of the distinction clarifies what it actually signifies to separate conventional and ultimate truth when distinguishing the two truths.",
  "4.6.2.1.1.1.3": "Ascertaining the number confirms that there are exactly two truths, no more and no fewer, completing the formal distinction between conventional and ultimate.",
  "4.6.2.1.1.1.4": "Providing definitions of each truth gives precise criteria for what counts as conventional and what counts as ultimate when distinguishing the two truths.",
  "4.6.2.1.1.2": "Explaining the characteristics of the two truths specifies how conventional and ultimate truth each manifest within the Madhyamaka presentation.",
  "4.6.2.1.1.3": "Identifying the valid cognitions which ascertain those characteristics establishes which types of awareness correctly apprehend conventional and ultimate truth.",
  "4.6.2.1.1.3.1": "Distinguishing the types of conceptual thought sorts the modes of cognition to determine which validly ascertain the characteristics of the two truths.",
  "4.6.2.1.1.3.2": "Explaining the graduations of refuter shows how progressively subtler levels of analysis refine the valid cognition that ascertains the two truths.",
  "4.6.2.1.1.3.3": "Abandoning objections about these graduations addresses challenges to the graduated levels of refutation within the valid cognitions that ascertain the two truths.",
  "4.6.2.1.1.3.3.1": "Abandoning the objection that practice is meaningless refutes the claim that graduated analysis serves no purpose, defending the validity of these levels of refutation.",
  "4.6.2.1.1.3.3.2": "Abandoning the objection that there are no distinctions in understanding refutes the claim that all levels of insight are the same, affirming meaningful graduations among refuters.",
  "4.6.2.1.2": "Abandoning objections to the emptiness of the person addresses challenges raised by the lower Buddhist schools against the Madhyamaka position.",
  "4.6.2.1.2.1": "Abandoning the objections of Vaibhashikas responds to the realist school's challenges to the Madhyamaka view that the person is established as empty.",
  "4.6.2.1.2.1.1": "Abandoning objections of contradiction with valid cognition answers the Vaibhashika claim that emptiness contradicts direct perception and inference.",
  "4.6.2.1.2.1.2": "Abandoning objections of contradiction with the textual tradition of the Bhagavan answers the Vaibhashika claim that emptiness contradicts the Buddha's own scriptures.",
  "4.6.2.1.2.2": "Abandoning the objections of Sautrantikas addresses the representationalist school's concerns about the implications of emptiness for Buddhist doctrine.",
  "4.6.2.1.2.2.1": "Addressing the Sautrantika objection to do with the bases of accumulation shows that emptiness does not undermine the aggregates upon which merit and wisdom are gathered.",
  "4.6.2.1.2.2.2": "Addressing the Sautrantika objection to do with rebirth shows that emptiness does not negate the continuity of consciousness that makes rebirth intelligible.",
  "4.6.2.1.2.2.3": "Addressing the Sautrantika objection to do with karma shows that emptiness does not undermine the workings of cause and effect in the moral domain.",
  "4.6.2.1.2.2.4": "Addressing the Sautrantika objection to do with the distinction between samsara and nirvana shows that emptiness does not collapse the difference between cyclic existence and liberation.",
  "4.6.2.1.2.3": "Abandoning objections of the Vijnaptimatrins responds to the Mind-Only school's challenges to the Madhyamaka position on the emptiness of the person.",
  "4.6.2.1.2.3.1": "Addressing the non-establishment of the subject refutes the Vijnaptimatrin claim that the Madhyamaka lacks a valid subject for its thesis about emptiness.",
  "4.6.2.1.2.3.1.1": "Abandoning objections of the False Representationalists addresses the branch of Mind-Only that holds appearances to be false while consciousness is real.",
  "4.6.2.1.2.3.1.2": "Abandoning objections of the True Representationalists addresses the branch of Mind-Only that holds both appearances and consciousness to be truly existent.",
  "4.6.2.1.2.3.1.2.1": "Responding to the objection that mind is an appearance confronts the True Representationalist claim that mind itself constitutes a real appearance.",
  "4.6.2.1.2.3.1.2.1.1": "Presenting the objection in brief states the True Representationalist position that mind is a real appearance, setting up the refutation that follows.",
  "4.6.2.1.2.3.1.2.1.2": "Establishing the pervasion through scriptures examines scriptural citations invoked by the True Representationalists to support the claim that mind is an appearance.",
  "4.6.2.1.2.3.1.2.1.2.1": "Citing the scriptural reference presents the specific passage the True Representationalists invoke as evidence that mind is established as a real appearance.",
  "4.6.2.1.2.3.1.2.1.2.2": "Providing an example of the agency of cognition illustrates how the True Representationalists use the analogy of cognition's activity to support their scriptural claim.",
  "4.6.2.1.2.3.1.2.1.2.3": "Drawing the conclusion of the scriptural argument completes the True Representationalist case that scriptures establish mind as a real appearance.",
  "4.6.2.1.2.3.1.2.1.3": "Settling that with reasoning applies logical analysis to determine whether the True Representationalist claim that mind is an appearance can withstand scrutiny.",
  "4.6.2.1.2.3.1.2.1.3.1": "Abandoning uncertainty with the illumination of a lamp uses the analogy of a lamp to refute the notion that mind can illuminate itself as a real appearance.",
  "4.6.2.1.2.3.1.2.1.3.2": "Abandoning uncertainty with the spontaneous arising of blue uses the example of blue arising to refute the idea that mind is a self-cognizing appearance.",
  "4.6.2.1.2.3.1.2.2": "Rejecting arguments that mind is self-aware directly challenges the True Representationalist doctrine that consciousness knows itself without an external object.",
  "4.6.2.1.2.3.1.2.2.1": "Demonstrating the nonexistence of the general concept shows that the abstract category of self-awareness has no basis, undermining the claim that mind knows itself.",
  "4.6.2.1.2.3.1.2.2.2": "Rejecting the perception of its existence denies that self-awareness can be directly perceived, further undermining the True Representationalist position.",
  "4.6.2.1.2.3.1.2.2.3": "Showing there is no inference to the conclusion demonstrates that no valid inferential reasoning establishes the existence of self-awareness.",
  "4.6.2.1.2.3.1.2.2.3.1": "Identifying the error in the reason of the effect exposes the flaw in inferring self-awareness from its supposed resultant cognition.",
  "4.6.2.1.2.3.1.2.2.3.2": "Identifying the error in the reason of its intrinsic nature exposes the flaw in inferring self-awareness from the very nature of consciousness itself.",
  "4.6.2.1.2.3.1.2.2.3.3": "Abandoning objections to this refutation answers remaining challenges to the demonstration that no inference establishes self-awareness.",
  "4.6.2.1.2.3.2": "Addressing the non-establishment of the basis refutes the Vijnaptimatrin claim that the Madhyamaka lacks a valid ground upon which to predicate emptiness.",
  "4.6.2.1.2.3.2.1": "Presenting the objection states the Vijnaptimatrin challenge that the Madhyamaka cannot establish the very basis of its emptiness thesis.",
  "4.6.2.1.2.3.2.2": "Providing the logic which refutes the objection applies reasoning to show that the Madhyamaka basis is indeed established despite the Vijnaptimatrin challenge.",
  "4.6.2.1.2.3.2.3": "Raising a counterobjection presents a further challenge that emerges from the logic used to refute the non-establishment of the basis.",
  "4.6.2.1.2.3.2.4": "Establishing the pervasion for the counterobjection completes the defence by demonstrating that the logical entailment holds against this further challenge.",
  "4.6.2.2": "Establishing the object as empty by examining phenomena extends the analysis beyond the person to show that all dharmas are likewise devoid of intrinsic nature within the meditation on wisdom.",
  "4.6.2.2.1": "Establishing subject cognition as the path shows how the wisdom that knows emptiness itself functions as the means of liberation within the examination of phenomena.",
  "4.6.2.2.1.1": "Presenting the objection raises the challenge of how cognition can serve as the path if all phenomena, including the mind itself, are empty.",
  "4.6.2.2.1.2": "Responding to the objection demonstrates that cognition of emptiness does function as a genuine path even though the cognizing mind is itself empty.",
  "4.6.2.2.1.2.1": "Showing that a partial knowledge of illusion is not the antidote establishes that merely recognizing some things as illusory while clinging to others fails to liberate.",
  "4.6.2.2.1.2.2": "Showing that knowledge that everything is illusion is the antidote establishes that only the complete realization of all phenomena as illusory functions as the path.",
  "4.6.2.2.1.2.2.1": "Abandoning clinging to existence addresses the extreme of reification, showing how the knowledge that everything is illusion overcomes attachment to things as truly real.",
  "4.6.2.2.1.2.2.2": "Abandoning clinging to nonexistence addresses the extreme of nihilism, showing how complete illusory knowledge avoids falling into the denial of conventional reality.",
  "4.6.2.2.1.2.2.3": "Providing the reason for these two abandonments explains why both extremes of existence and nonexistence must be relinquished for the knowledge of illusion to serve as the antidote.",
  "4.6.2.2.1.2.3": "Explaining how that is the arising of the wisdom without dualistic appearances shows the culmination where subject and object dissolve in non-dual realization on the path.",
  "4.6.2.2.1.2.4": "Showing that engaging in activity does not depend on effort demonstrates that a buddha's liberating activity arises spontaneously from the realization of emptiness.",
  "4.6.2.2.1.2.4.1": "Describing the appearance of the Conqueror's kaya to trainees who have purified their streams of being shows how the buddha-form manifests effortlessly to those ready to receive it.",
  "4.6.2.2.1.2.4.2": "Showing that those appearances engage in benefit demonstrates that the spontaneously arising buddha-forms actually accomplish the welfare of beings without deliberate contrivance.",
  "4.6.2.2.1.2.4.3": "Abandoning an objection to effortless activity addresses challenges to the claim that a buddha can benefit beings without intentional exertion.",
  "4.6.2.2.1.2.4.3.1": "Presenting the objection states the challenge that effortless buddha-activity seems contradictory or impossible within the framework of cause and effect.",
  "4.6.2.2.1.2.4.3.2": "Presenting the reason of scriptural citation invokes authoritative texts to support the position that buddha-activity operates without deliberate effort.",
  "4.6.2.2.1.2.4.3.3": "Establishing the pervasion of that demonstrates the logical entailment showing that the scriptural evidence fully supports the possibility of effortless buddha-activity.",
  "4.6.2.2.2": "Abandoning the objections of sravakas addresses the Hinayana challenge to the Madhyamaka examination of phenomena as empty.",
  "4.6.2.2.2.1": "Presenting the objection states the sravaka challenge that the Madhyamaka view of universal emptiness contradicts or supersedes the Buddha's earlier teachings.",
  "4.6.2.2.2.2": "Establishing the scriptural criterion for the path identifies the standard by which any teaching can be assessed as an authentic path to liberation.",
  "4.6.2.2.2.3": "Establishing the Mahayana scriptures as Buddha's word demonstrates that the texts teaching emptiness carry the same authority as the sutras accepted by the sravakas.",
  "4.6.2.2.2.3.1": "Showing that we have the same criteria for accepting texts as scriptures demonstrates that Mahayana and Hinayana apply identical standards when authenticating Buddha's word.",
  "4.6.2.2.2.3.2": "Showing that we have the same criteria for rejecting texts as scriptures demonstrates that the standards for disqualifying texts also apply equally across traditions.",
  "4.6.2.2.2.4": "Establishing the Mahayana scriptures as definitive meaning shows that the emptiness teachings are not merely provisional but express the Buddha's final intent.",
  "4.6.2.2.2.4.1": "Identifying the error for the sravaka tradition in the monk who has abandoned defilements exposes a contradiction in the Hinayana account of the arhat's liberation.",
  "4.6.2.2.2.4.2": "Identifying the error for the sravaka tradition in a nirvana in which suffering is abandoned exposes a contradiction in the Hinayana understanding of cessation.",
  "4.6.2.2.2.4.3": "Overcoming objections to that responds to sravaka challenges against the identification of these errors in their own tradition's account of liberation.",
  "4.6.2.2.2.4.3.1": "Addressing the existence of the suffering of this life examines whether the sravaka can coherently account for present suffering while overcoming objections about definitive meaning.",
  "4.6.2.2.2.4.3.1.1": "Presenting the objection states the sravaka challenge regarding how present-life suffering is to be understood if the Mahayana critique of their position holds.",
  "4.6.2.2.2.4.3.1.2": "Providing the response answers the sravaka objection by showing that the existence of present suffering is coherent within the Madhyamaka framework.",
  "4.6.2.2.2.4.3.1.3": "Responding to a counter objection addresses a further sravaka challenge that arises from the initial response about the suffering of this life.",
  "4.6.2.2.2.4.3.2": "Addressing the existence of the suffering of future lives examines whether the sravaka can coherently account for future suffering while defending definitive meaning.",
  "4.6.2.2.2.4.3.2.1": "Presenting the objection states the sravaka challenge regarding how the suffering of future lives can be coherently explained.",
  "4.6.2.2.2.4.3.2.2": "Demonstrating the existence of craving itself shows that craving persists even for the arhat on the sravaka's own terms, undermining their account of cessation.",
  "4.6.2.2.2.4.3.2.3": "Demonstrating the existence of its cause, sensation, shows that because sensation continues, craving has an ongoing basis that the sravaka account cannot eliminate.",
  "4.6.2.2.2.4.3.2.4": "Drawing the logical conclusion derives the final consequence that the sravaka position on future suffering is untenable, supporting the Mahayana as definitive.",
  "4.6.2.2.2.5": "Summarizing the meaning of this section draws together the arguments that establish the Mahayana view against the sravaka objections regarding emptiness.",
  "4.6.2.2.2.6": "Explaining extensively the criteria for establishing the Mahayana scriptures as Buddha's word provides a thorough account of how these texts meet the standards of authenticity.",
  "4.6.2.2.2.6.1": "Reaffirming that we have the same criteria underscores the shared standards of textual authentication that both Mahayana and sravaka traditions employ.",
  "4.6.2.2.2.6.2": "Showing that to abandon the Mahayana because of not understanding it is an error challenges the sravaka rejection of what they have not yet comprehended.",
  "4.6.2.2.2.6.3": "Explaining the function of the two cognitions shows how conventional and ultimate awareness each serve their purpose within the extensive criteria for authenticating Mahayana scripture.",
  "4.6.2.2.2.6.3.1": "Showing how the two cognitions generate the result which will become supreme demonstrates that conventional and ultimate awareness together produce the unsurpassed fruit of buddhahood.",
  "4.6.2.2.2.6.3.2": "Concluding that therefore you have no objections to our position demonstrates that the sravaka challenges have been fully answered by the function of the two cognitions.",
  "4.6.2.2.2.6.3.3": "Showing that meditation on emptiness functions as an antidote demonstrates that the realization of emptiness actively counteracts the defilements, fulfilling the purpose of the path.",
  "4.6.2.2.2.6.3.4": "Establishing that emptiness is not something to be afraid of reassures those who fear that the teaching of emptiness undermines meaning and purpose.",
  "4.6.2.2.2.6.3.4.1": "Showing that emptiness is not a cause of suffering demonstrates that realizing the empty nature of phenomena brings relief rather than despair.",
  "4.6.2.2.2.6.3.4.2": "Cultivating the quality of having no fear before emptiness completes the reassurance that the practitioner can embrace the teaching of emptiness with confidence and courage.",
  "4.6.2.3": "Engaging in meditation on emptiness puts into practice the wisdom of intrinsic emptiness through a detailed investigation of non-self within the bodhisattva's training.",
  "4.6.2.3.1": "A general explanation of individual non-self in the six elements introduces the meditation on emptiness by analyzing earth, water, fire, wind, space, and consciousness as lacking any self.",
  "4.6.2.3.2": "Refuting the self of the skandhas and elements as designated by the tirthikas dismantles non-Buddhist assertions of selfhood within the meditation on emptiness.",
  "4.6.2.3.2.1": "Refuting the Samkhyas targets their assertion of a permanent individual consciousness as the self of the skandhas and elements within the meditation on emptiness.",
  "4.6.2.3.2.1.1": "A general refutation of the individual consciousness challenges the Samkhya claim that a single permanent awareness underlies all experience, within the emptiness meditation that refutes tirthika views of self.",
  "4.6.2.3.2.1.1.1": "Drawing out the consequence of its permanence shows that if the Samkhya individual consciousness were truly permanent, it could never come into contact with objects, thereby refuting this view of self.",
  "4.6.2.3.2.1.1.2": "Establishing the pervasion demonstrates that the reasoning against the Samkhya individual consciousness applies universally, strengthening the general refutation within the meditation on emptiness.",
  "4.6.2.3.2.1.1.2.1": "Showing the violation of its intrinsic nature proves that if the individual consciousness changes through contact with objects, it contradicts the Samkhyas' own claim of permanence.",
  "4.6.2.3.2.1.1.2.2": "Presenting the absurd consequence reveals that an unchanging individual consciousness could never function as a knower, since knowing requires transformation through contact.",
  "4.6.2.3.2.1.1.2.3": "Drawing the conclusion from the pervasion establishes that the Samkhya individual consciousness remains in its prior state regardless of objects, making cognition impossible.",
  "4.6.2.3.2.1.1.3": "Abandoning objections to the general refutation addresses the Samkhya attempts to salvage their individual consciousness from the foregoing critique.",
  "4.6.2.3.2.1.1.3.1": "Showing that it is unreasonable for cognition of form to perceive sound exposes the impossibility of a single permanent consciousness apprehending fundamentally different sense objects.",
  "4.6.2.3.2.1.1.3.2": "Pointing out that this has the same fault previously explained shows the Samkhya response merely restates the original problem of a permanent consciousness needing to change in order to cognize.",
  "4.6.2.3.2.1.1.3.3": "Demonstrating that it is unreasonable to call it the same thing refutes the Samkhya claim that their individual consciousness retains its identity while manifesting as different cognitions.",
  "4.6.2.3.2.1.1.3.4": "Showing that the example is not established undermines the analogy the Samkhyas invoke to defend their individual consciousness, since the example itself cannot withstand analysis.",
  "4.6.2.3.2.1.1.3.5": "Establishing that the individual consciousness is not conceivable as a singularity concludes the abandoning of objections by showing that a unitary permanent self cannot be maintained.",
  "4.6.2.3.2.1.2": "Refuting temporary multiplicity dismantles the Samkhya suggestion that the individual consciousness is permanently one yet temporarily manifests as many distinct cognitions.",
  "4.6.2.3.2.1.3": "Refuting the single nature of the Samkhya individual consciousness addresses whether consciousness and its qualities can ultimately be one and the same entity.",
  "4.6.2.3.2.1.3.1": "Posing the question of what the Samkhya individual consciousness would be if its qualities were stripped away opens the investigation into whether it can truly be single in nature.",
  "4.6.2.3.2.1.3.2": "Answering the question about the single nature of the individual consciousness demonstrates through three consequences that a truly unitary self cannot be sustained.",
  "4.6.2.3.2.1.3.2.1": "Drawing the consequence that all beings would be one shows that if the individual consciousness were truly single, there could be no distinction between different sentient beings.",
  "4.6.2.3.2.1.3.2.2": "Drawing the consequence that the mirror of mind and the individual consciousnesses would be one reveals that the Samkhya system collapses its own distinction between universal and particular awareness.",
  "4.6.2.3.2.1.3.2.3": "Establishing that the general case is not established concludes the refutation of the Samkhya single nature by showing its foundational category lacks validity.",
  "4.6.2.3.2.2": "Refuting the Naiyayikas targets their assertion of a self that possesses material nature, as a second tirthika view challenged within the meditation on emptiness.",
  "4.6.2.3.2.2.1": "Showing the consequence which refutes a self with a material nature demonstrates that if the Naiyayika self were material, it would be subject to destruction like any physical thing.",
  "4.6.2.3.2.2.2": "Establishing the pervasion confirms that the reasoning against a material self applies comprehensively to the Naiyayika position, leaving no room for exception.",
  "4.6.2.3.2.2.3": "Summarizing the meaning of the Naiyayika refutation consolidates the conclusion that a permanent self with a material nature cannot withstand logical analysis.",
  "4.6.2.3.3": "Abandoning objections to non-self addresses challenges raised against the Buddhist position once the tirthika views of self have been refuted within the meditation on emptiness.",
  "4.6.2.3.3.1": "Abandoning the objection that the connection of actions and effects is not logical responds to the claim that without a self, karma cannot coherently link deeds to their results.",
  "4.6.2.3.3.1.1": "Presenting the objection articulates the opponent's challenge that if there is no self, there can be no bearer of karma to connect actions with their eventual effects.",
  "4.6.2.3.3.1.2": "Showing that our positions are the same points out that the opponent's own system faces an equivalent difficulty in explaining how a permanent self could be modified by karmic results.",
  "4.6.2.3.3.1.3": "Giving the actual response explains that actions and effects connect through the continuum of dependently arising phenomena, without requiring a substantial self as their basis.",
  "4.6.2.3.3.1.4": "Abandoning contradiction to scripture demonstrates that the teaching of non-self does not conflict with the Buddha's own words on karma and its results.",
  "4.6.2.3.3.1.5": "Abandoning another objection addresses a further challenge to the coherence of karmic continuity in the absence of a permanent self.",
  "4.6.2.3.3.1.6": "Summarizing the meaning of this discussion consolidates the defense that actions and effects operate coherently through dependent arising without any need for a substantial self.",
  "4.6.2.3.3.2": "Abandoning the objection that cultivating compassion for others is illogical without a self responds to the claim that emptiness undermines the very basis for bodhisattva practice.",
  "4.6.2.3.3.2.1": "Raising the objection voices the concern that if sentient beings have no true self, there can be no valid object toward which compassion is directed.",
  "4.6.2.3.3.2.2": "Responding to the objection about compassion being illogical establishes that sentient beings function as valid objects of compassion precisely as designations within dependent arising.",
  "4.6.2.3.3.2.2.1": "Establishing that sentient beings are designated shows that beings exist as conventional designations, which is sufficient for compassion to operate even without a truly existent self.",
  "4.6.2.3.3.2.2.2": "Abandoning an objection to the designated nature of beings addresses the concern that mere designations cannot serve as genuine objects of care and practice.",
  "4.6.2.3.3.2.2.2.1": "Clarifying the independence of the substantially established individual shows that what the opponent asserts as a real self is not found upon analysis, removing any basis for the objection.",
  "4.6.2.3.3.2.2.2.2": "Establishing that the mere designation is not to be abandoned confirms that conventional designations of persons remain valid and should not be discarded, preserving the ground for compassion.",
  "4.6.2.3.3.2.2.3": "Abandoning a contradiction in our own words resolves the apparent tension between asserting non-self and simultaneously speaking of beings who suffer and need compassion.",
  "4.6.2.3.3.2.2.4": "Abandoning the claim that the Buddhist and opponent positions are the same distinguishes the Madhyamaka understanding of designated beings from the tirthika assertion of a substantially real self.",
  "4.6.2.3.4": "Refuting the understanding of the skandhas and elements as self through the four foundations of mindfulness applies the Buddhist's own analytical framework to the meditation on emptiness.",
  "4.6.2.3.4.1": "Mindfulness of the body investigates whether the body can be identified as a self, applying the first foundation of mindfulness to the meditation on emptiness.",
  "4.6.2.3.4.1.1": "Showing that the individual parts are not the body demonstrates that hands, feet, and other limbs cannot individually or collectively constitute a truly existent body.",
  "4.6.2.3.4.1.2": "Establishing that an existent body which possesses the parts is not established proves there is no separate entity called the body standing apart from its constituent parts.",
  "4.6.2.3.4.1.2.1": "Refuting that each part is connected to a body-possessor shows that no individual limb has a relationship with a separate whole body, since the body cannot be found in any single part.",
  "4.6.2.3.4.1.2.2": "Refuting a connection throughout the entire self demonstrates that a body-possessor pervading all parts simultaneously would require it to be multiple or partless, both of which are untenable.",
  "4.6.2.3.4.1.2.3": "Summarizing the logic establishes that since the body is not found in the parts and the parts are not found in the body, there is no basis for identifying the body as a self.",
  "4.6.2.3.4.1.2.4": "Concluding that the body is deluded conception reveals that grasping at a truly existent body is a mistaken superimposition upon what is merely a collection of parts.",
  "4.6.2.3.4.1.2.5": "Establishing the delusion explains how the false cognition of a truly existent body arises, persists, and can be recognized for what it is.",
  "4.6.2.3.4.1.2.5.1": "Identifying the cause of the delusion shows that the mistaken perception of a body arises from a specific configuration of parts, just as a scarecrow is mistaken for a person.",
  "4.6.2.3.4.1.2.5.2": "Examining the deluded cognition itself reveals that projecting a body onto the arrangement of parts functions like perceiving a face in a reflection or a human form in a pile of stones.",
  "4.6.2.3.4.1.2.5.3": "Offering a general summary of the body analysis concludes that the body is neither established in its parts nor as their possessor, completing mindfulness of the body within the meditation on emptiness.",
  "4.6.2.3.4.2": "Mindfulness of sensations investigates whether feelings of pleasure, pain, and neutrality can be identified as a self, applying the second foundation of mindfulness to the emptiness meditation.",
  "4.6.2.3.4.2.1": "Demonstrating the non-establishment of the intrinsic nature of sensations shows that feelings lack inherent existence by examining suffering, happiness, and their relation to analysis.",
  "4.6.2.3.4.2.1.1": "Establishing the non-establishment of suffering as ultimate shows that if suffering truly existed by its own nature, it could never be alleviated by experiences of happiness.",
  "4.6.2.3.4.2.1.2": "Establishing the non-establishment of happiness as ultimate demonstrates that if happiness existed inherently, one who experiences grief could never cease to feel pleasure.",
  "4.6.2.3.4.2.1.3": "Abandoning objections to the non-establishment of sensations addresses counterarguments that attempt to preserve the inherent existence of feelings despite the foregoing analysis.",
  "4.6.2.3.4.2.1.3.1": "Addressing the consequence that sensations would still be experienced even if they lack inherent nature clarifies that conventional experience is not negated by the absence of ultimate existence.",
  "4.6.2.3.4.2.1.3.2": "Showing that if the reason were not established it would be no different from happiness demonstrates that the opponent's challenge actually supports the conclusion that sensations lack intrinsic nature.",
  "4.6.2.3.4.2.1.4": "Recognizing conditionality reveals that sensations arise only in dependence upon causes and conditions, confirming they lack any independent intrinsic nature.",
  "4.6.2.3.4.2.1.5": "Connecting with the yogic activity of analysis encourages the practitioner to cultivate the analytical meditation that directly undermines the habitual grasping at sensations as real.",
  "4.6.2.3.4.2.2": "Demonstrating the non-establishment of contact as the cause of sensations shows that if the meeting of object, sense organ, and consciousness is not established, sensations have no ultimate ground.",
  "4.6.2.3.4.2.2.1": "Establishing that objects do not meet with sense organs undermines the foundational claim that physical contact between object and faculty produces sensation.",
  "4.6.2.3.4.2.2.1.1": "Showing there is no contact with coarse objects demonstrates that gross material forms cannot truly meet sense organs, since upon analysis they dissolve into parts that never fully touch.",
  "4.6.2.3.4.2.2.1.2": "Showing there is no contact with subtle particles refutes the last refuge of the materialist claim, demonstrating that even at the level of partless atoms, genuine meeting cannot occur.",
  "4.6.2.3.4.2.2.1.2.1": "Stating the consequence draws out the implication that if partless particles cannot meet, the entire edifice of contact-based sensation collapses.",
  "4.6.2.3.4.2.2.1.2.2": "Establishing the reason demonstrates why partless particles cannot merge or make contact, since they lack the spatial extension required for physical meeting.",
  "4.6.2.3.4.2.2.1.2.3": "Establishing the pervasion confirms that the impossibility of contact at the atomic level applies universally to all claimed instances of physical meeting between objects and sense organs.",
  "4.6.2.3.4.2.2.1.2.4": "Drawing the conclusion from the analysis of subtle particles seals the point that contact between objects and sense faculties cannot be established at any level of material analysis.",
  "4.6.2.3.4.2.2.2": "Establishing that objects do not meet with consciousness shows that even the immaterial encounter between an object and awareness cannot constitute genuine contact.",
  "4.6.2.3.4.2.2.3": "Demonstrating that a composite of object, organ, and consciousness is completely refuted shows that no combination of these three can produce a truly existent instance of contact.",
  "4.6.2.3.4.2.2.4": "Offering a summary conclusion on the non-establishment of contact consolidates the finding that no form of meeting between object, sense organ, and consciousness ultimately exists.",
  "4.6.2.3.4.2.2.5": "Clarifying the point of establishing the non-existence of contact explains that this analysis serves to uproot the grasping at sensations that drives the cycle of suffering.",
  "4.6.2.3.4.2.3": "Demonstrating the non-establishment of the object of sensation shows that what is felt has no inherent existence, since the external objects that supposedly give rise to feeling are themselves unfindable.",
  "4.6.2.3.4.2.4": "Demonstrating the non-establishment of the subject of sensation shows that no experiencer with inherent existence can be found, completing the analysis of sensations within the emptiness meditation.",
  "4.6.2.3.4.2.4.1": "Showing there is no experiencing mind demonstrates that the consciousness which supposedly feels pleasure and pain cannot be identified as a truly existent subject of sensation.",
  "4.6.2.3.4.2.4.2": "Showing there is no self-experience establishes that sensations cannot be their own experiencer, since a single entity cannot simultaneously be the agent and object of feeling.",
  "4.6.2.3.4.2.4.3": "Showing there is no experiencer apart from those demonstrates that beyond mind and sensation themselves, no additional self or witness can be found to serve as the subject of experience.",
  "4.6.2.3.4.2.4.4": "Offering a concluding summary on the non-establishment of the subject establishes that with no experiencer found in mind, in sensation itself, or apart from them, the self of sensations is thoroughly refuted.",
  "4.6.2.3.4.3": "Mindfulness of mind investigates whether consciousness itself can be identified as a self, applying the third foundation of mindfulness to the meditation on emptiness.",
  "4.6.2.3.4.3.1": "Demonstrating that the nature of mind is not established shows that consciousness has no fixed location or inherent essence, whether sought inside the body, outside it, or elsewhere.",
  "4.6.2.3.4.3.2": "Showing that perception of the five consciousnesses is not established demonstrates that visual, auditory, and other sense cognitions lack the inherent existence needed to constitute a self.",
  "4.6.2.3.4.4": "Mindfulness of dharmas investigates whether phenomena in general can be identified as having inherent existence, applying the fourth foundation of mindfulness to the meditation on emptiness.",
  "4.6.2.3.4.4.1": "Establishing all dharmas as non-arising demonstrates that phenomena do not come into existence through inherent nature, since their arising cannot be found upon ultimate analysis.",
  "4.6.2.3.4.4.2": "Abandoning objections to the non-arising of dharmas addresses challenges that question whether this position eliminates conventional reality or generates logical contradictions.",
  "4.6.2.3.4.4.2.1": "Abandoning the objection that there is no relative reality shows that establishing non-arising does not negate the conventional world, since appearances continue to function within dependent origination.",
  "4.6.2.3.4.4.2.2": "Abandoning the objection that this ascertainment entails an infinite regress addresses the concern that analyzing the analysing mind leads to an endless chain of further analyses.",
  "4.6.2.3.4.4.2.2.1": "Offering a general comment on the division of object and subject acknowledges that when the object of analysis is established as non-arising, the question naturally turns to the status of the analysing subject.",
  "4.6.2.3.4.4.2.2.2": "Presenting the concern that if the non-arising of the subject depends upon a further understanding there is an infinite regress articulates the opponent's worry that analysis has no natural stopping point.",
  "4.6.2.3.4.4.2.2.3": "Demonstrating that our position does not have that fault shows that once the analysed object is established as non-arising, the analysing subject is simultaneously freed, halting any regress and completing the meditation on emptiness.",
  "4.6.2.4": "Ceasing to grasp at true existence is the central undertaking within the detailed explanation of the meditation on wisdom that accomplishes the bodhisattva's training.",
  "4.6.2.4.1": "Demonstrating that there is no reason establishing all dharmas as having inherent nature directly undermines the grasping at true existence within the wisdom meditation that accomplishes the bodhisattva's training.",
  "4.6.2.4.2": "Refuting the tirthikas' position that the arising of the inherent nature of all dharmas is established exposes the errors of non-Buddhist schools as part of ceasing to grasp at true existence in the wisdom meditation that accomplishes the bodhisattva's training.",
  "4.6.2.4.2.1": "The main teaching on refuting an arising with intrinsic nature forms the core argument against the tirthikas' assertion that inherent nature is established, within the process of ceasing to grasp at true existence in the wisdom meditation.",
  "4.6.2.4.2.1.1": "Refuting arising from no cause dismantles the first of the four extreme positions on origination within the main teaching that refutes an arising with intrinsic nature in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.1.1": "A general explanation of why arising from no cause is untenable opens the refutation of causeless origination within the main teaching against arising with intrinsic nature in the wisdom meditation.",
  "4.6.2.4.2.1.1.2": "Examining the differences of effect in relation to cause reveals the impossibility of causeless origination, since varied effects imply dependence on causes, within the refutation of arising from no cause in the wisdom meditation.",
  "4.6.2.4.2.1.1.3": "Examining the differences of cause in relation to cause shows that distinct causal sequences preclude causeless arising within the refutation of origination without a cause in the wisdom meditation.",
  "4.6.2.4.2.1.1.4": "Examining the differences of power in relation to cause demonstrates that the varying capacities of causes refute causeless arising within the main teaching against intrinsic origination in the wisdom meditation.",
  "4.6.2.4.2.1.2": "Refuting arising from other challenges the claim that truly existent effects originate from inherently distinct causes, within the main teaching against arising with intrinsic nature in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.2.1": "Refuting arising from an impermanent other addresses temporal objections to causation by an inherently distinct and changing cause within the refutation of arising from other in the wisdom meditation.",
  "4.6.2.4.2.1.2.1.1": "Examining whether an effect could exist before the cause exposes the absurdity of temporal priority in arising from an impermanent other within the refutation of arising from other in the wisdom meditation.",
  "4.6.2.4.2.1.2.1.2": "Examining whether an effect could be simultaneous with the cause reveals the logical impossibility of co-temporal arising from an impermanent other within the refutation of arising from other in the wisdom meditation.",
  "4.6.2.4.2.1.2.1.3": "Examining whether an effect arises after the cause completes the temporal analysis of arising from an impermanent other within the refutation of arising from other in the wisdom meditation.",
  "4.6.2.4.2.1.2.2": "Refuting arising from a permanent other addresses the claim that unchanging entities can produce effects, within the broader refutation of arising from other in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.2.2.1": "Refuting arising from Isvara dismantles the theistic claim that a permanent creator god produces all phenomena, within the refutation of arising from a permanent other in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.1": "Demonstrating that Isvara is not established as an entity challenges the very existence of the proposed creator within the refutation of arising from Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.1.1": "Refuting Isvara as the elements shows that identifying the creator god with material elements fails to establish a permanent cause, within the proof that Isvara is not established in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.1.2": "Refuting Isvara as space demonstrates that an inert and partless entity like space cannot serve as a creator, within the proof that Isvara is not established in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.1.3": "Refuting Isvara as self shows that equating the creator with the atman undermines the claim of an independent permanent cause, within the proof that Isvara is not established in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.1.4": "Refuting Isvara as inconceivable exposes the logical evasion of declaring the creator beyond comprehension, within the proof that Isvara is not established in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.2": "Showing that effects are impossible from a permanent Isvara demonstrates that no outcome can arise from an unchanging creator, within the refutation of arising from Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.2.1": "Refuting a permanent effect shows that an unchanging result contradicts the observable impermanence of phenomena, within the demonstration that effects from Isvara are impossible in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.2.2": "Refuting an impermanent effect from a permanent cause exposes the contradiction of transient results arising from an unchanging Isvara, within the demonstration that effects from a creator are impossible in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3": "Revealing contradictions in Isvara's being a creator exposes the internal incoherence of asserting a permanent entity that produces temporal effects, within the refutation of arising from Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.1": "Showing the contradiction to a temporary effect demonstrates that a permanent creator cannot account for effects that arise at particular times, within the analysis of contradictions in Isvara's creatorship in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.2": "Establishing the pervasion by Isvara's independence shows that if Isvara were truly autonomous, all effects would arise simultaneously, within the analysis of contradictions in his creatorship in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3": "Refuting Isvara's dependence on other conditions challenges the coherence of a supposedly independent creator who nonetheless requires auxiliary factors, within the analysis of contradictions in his creatorship in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3.1": "Showing that everything being an effect of Isvara contradicts his dependence reveals the impossibility of a creator who is both the sole cause and yet reliant on conditions, within the refutation of Isvara's dependence in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3.2": "Demonstrating that dependence is contrary to Isvara exposes how reliance on conditions fundamentally undermines the claim of a supreme independent creator, within the refutation of Isvara's dependence in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3.2.1": "Establishing the concurrence of conditions as the cause shows that multiple converging factors, not a single creator, bring about effects, within the demonstration that dependence is contrary to Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3.2.2": "Showing that Isvara's autonomy is violated by dependence on conditions directly contradicts the assertion of an independent creator, within the demonstration that dependence is contrary to Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.1.3.3.2.3": "Showing that Isvara would be under the power of desire reveals that a creator motivated by wanting is neither permanent nor independent, within the demonstration that dependence is contrary to Isvara in the wisdom meditation.",
  "4.6.2.4.2.1.2.2.2": "Refuting the Vaisesika tradition of arising from sempiternal particles dismantles the claim that permanent atoms combine to produce impermanent phenomena, within the refutation of arising from a permanent other in the wisdom meditation.",
  "4.6.2.4.2.1.3": "Refuting arising from self challenges the Samkhya assertion that effects pre-exist within their cause, within the main teaching against arising with intrinsic nature in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.3.1": "Formulating the position of the Samkhya tradition sets out the opposing view that effects arise from a self-same primal substance, prior to its refutation within the analysis of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.1.1": "A general explanation of the Samkhya position introduces the basic framework of self-arising from the primal substance, as the view to be refuted within the analysis of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.1.2": "Presenting the nature of the primal substance describes the Samkhya view of the fundamental ground from which all phenomena supposedly emerge, within the formulation of their position in the wisdom meditation.",
  "4.6.2.4.2.1.3.1.3": "Presenting the nature of the primal substance's effects describes the Samkhya account of how manifestations arise from the ground, within the formulation of their position in the wisdom meditation.",
  "4.6.2.4.2.1.3.2": "Demonstrating the error in the Samkhya position systematically dismantles the claim that effects arise from a self-same cause, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.1": "A general expression of the objection presents the broad logical problems with the Samkhya view of self-arising, within the demonstration of its errors in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.3.2.1.1": "Refuting the primal substance shows that the foundational ground posited by the Samkhyas cannot withstand logical scrutiny, within the general objection to arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.1.2": "Refuting the qualities of the primal substance demonstrates that the three gunas attributed to it are logically untenable, within the general objection to arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.1.3": "Refuting the effects of the primal substance shows that the phenomena supposedly produced by self-arising are not logically established, within the general objection to arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2": "Refuting pleasure and so forth being external challenges the Samkhya claim that experiential qualities exist outside the mind, within the demonstration of errors in arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.1": "Refuting by not perceiving the appearance shows that pleasure and similar qualities cannot be established as external because they are not observed outside subjective experience, within the analysis of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.2": "Refuting an external cause of pleasure and so forth challenges the notion that a material primal substance produces subjective experiences, within the analysis of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.2.1": "Recalling the logic that was already completed draws on previously established arguments to reinforce that an external cause of pleasure is untenable, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.2.2": "Showing that the idea contradicts the Samkhyas' own words reveals internal inconsistencies in their assertion of an external cause of pleasure, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.2.3": "Demonstrating that pleasure does not preexist in its basis refutes the claim that experiential qualities already reside in a material ground, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.2.2.4": "Showing that pleasure and so forth do not exist in reality concludes the argument that subjective experiences lack the external inherent existence the Samkhyas claim, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.3": "Demonstrating that a permanent primal substance is unreasonable directly challenges the Samkhya foundation by showing its ground cannot be unchanging, within the refutation of arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.3.1": "Refuting by not perceiving the appearance of a permanent primal substance shows that no unchanging ground manifests to perception, within the demonstration that a permanent primal substance is unreasonable in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.3.2": "Showing that gross and subtle are contradictory reveals that a primal substance cannot be both the subtle ground and the source of gross manifestations while remaining permanent, within the wisdom meditation.",
  "4.6.2.4.2.1.3.2.3.3": "Establishing the contingent states of the primal substance as impermanent proves that its transformations cannot preserve permanence, within the demonstration that a permanent primal substance is unreasonable in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.3.4": "Establishing the primal substance itself as impermanent completes the argument that neither the ground nor its states can maintain the permanence the Samkhyas require, within the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.1.3.2.4": "Exposing contradictions in an existent arising challenges the Samkhya claim that already-existent effects can meaningfully arise, within the demonstration of errors in arising from self in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.1": "Presenting the position to be refuted lays out the Samkhya assertion that an already-existent effect undergoes genuine arising, as the target of analysis within the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.2": "Exposing the position's uncertainty reveals the logical instability of claiming that something already existent can arise anew, within the analysis of contradictions in existent arising in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.3": "Showing the mixing up of roles demonstrates that the Samkhya position confuses cause and effect when asserting that an existent arises from itself, within the analysis of contradictions in existent arising in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.4": "Abandoning objections to the refutation of existent arising addresses the Samkhya responses and shows they cannot salvage the position, within the analysis of contradictions in existent arising in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.4.1": "Showing that the roles are the same demonstrates that cause and effect become indistinguishable in the Samkhya framework, within the abandonment of objections to the refutation of existent arising in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.4.2": "Showing the position is contradictory to worldly confusion reveals that the Samkhya view of existent arising cannot account for the conventional experience of novelty, within the abandonment of objections in the wisdom meditation.",
  "4.6.2.4.2.1.3.2.4.4.3": "Drawing the consequence that the role of the effect is a delusion exposes the final absurdity of the Samkhya position on existent arising, within the abandonment of objections in the wisdom meditation.",
  "4.6.2.4.2.2": "Abandoning objections to the middle way addresses challenges raised against the Madhyamaka position itself, within the refutation of the tirthikas' assertion of inherent arising in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.2.2.1": "Setting out the objections presents the challenges posed to the Madhyamaka refutation of inherent arising, within the section on abandoning objections to the middle way in the wisdom meditation.",
  "4.6.2.4.2.2.2": "Responding that our position is not a valid cognition with a positive affirmation clarifies that the Madhyamaka refutation does not assert an inherently existent thesis, within the abandonment of objections to the middle way in the wisdom meditation.",
  "4.6.2.4.2.2.3": "Responding that the pervasion is not established, since even though there is an analysis it is not contrary to valid cognition, shows the compatibility of Madhyamaka reasoning with conventional validity, within the abandonment of objections to the middle way in the wisdom meditation.",
  "4.6.2.4.3": "Showing that all dharmas arise merely through dependent origination establishes the positive corollary to refuting inherent arising, within the process of ceasing to grasp at true existence in the wisdom meditation.",
  "4.6.2.4.3.1": "A summary of the refutation of the four kinds of arising consolidates the arguments against causeless, other, self, and both-arising, within the demonstration that all dharmas arise through dependent origination in the wisdom meditation.",
  "4.6.2.4.3.2": "Showing that there is no arising or ceasing, coming or going establishes the freedom from the four extremes of production, within the demonstration that dharmas arise through dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3": "Drawing the implication that what is dependently originated is mere illusion reveals the ultimate nature of conventional appearances, within the demonstration that dharmas arise through dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3.1": "Showing that dependent origination is like an illusion uses the analogy of magical display to illuminate how phenomena appear yet lack true existence, within the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.3.3.2": "Showing dependent origination itself demonstrates how phenomena arise in reliance on conditions without inherent nature, within the implication that what is dependently originated is mere illusion in the wisdom meditation.",
  "4.6.2.4.3.3.2.1": "Presenting the reason for dependent origination provides the logical basis for understanding conditioned arising as free from inherent nature, within the demonstration of dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3.2.2": "Showing the forward pervasion establishes that whatever is dependently originated necessarily lacks inherent existence, within the demonstration of dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3.2.3": "Providing the example of dependent origination uses a concrete illustration to clarify how conditioned arising operates without true existence, within the demonstration of dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3.2.4": "Presenting the logic of dependent origination offers the formal reasoning that establishes conditioned arising as empty of inherent nature, within the demonstration of dependent origination in the wisdom meditation.",
  "4.6.2.4.3.3.3": "Establishing the pervasion that all dependently originated phenomena are like illusions confirms the universal scope of emptiness, within the implication that what is dependently originated is mere illusion in the wisdom meditation.",
  "4.6.2.4.3.3.3.1": "Presenting the logic for the pervasion provides the formal argument that all dependently arisen phenomena must be illusory, within the establishment of pervasion in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.3.3.3.1.1": "Refuting something existent arising as an effect shows that a truly existing entity cannot undergo production, within the logical establishment of the pervasion in the wisdom meditation.",
  "4.6.2.4.3.3.3.1.2": "Refuting something nonexistent arising as an effect shows that a completely nonexistent entity cannot be produced either, within the logical establishment of the pervasion in the wisdom meditation.",
  "4.6.2.4.3.3.3.1.2.1": "Presenting the logic in brief offers a concise argument against the arising of something nonexistent, within the refutation of nonexistent arising in the wisdom meditation.",
  "4.6.2.4.3.3.3.1.2.2": "Showing the contradiction in the possibility of something nonexistent being the cause for an object reveals the logical impossibility of production from nothing, within the refutation of nonexistent arising in the wisdom meditation.",
  "4.6.2.4.3.3.3.1.2.3": "Refuting the cessation of the object itself completes the argument against nonexistent arising by showing that even cessation does not produce a truly nonexistent entity, within the wisdom meditation.",
  "4.6.2.4.3.3.3.2": "Making certain of the reason confirms the logical basis for the pervasion between dependent origination and illusory nature, within the establishment of pervasion in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.4.3.3.3.2.1": "Demonstrating freedom from the two extremes of eternalism and nihilism shows that dependent origination avoids both, within making certain of the reason for the pervasion in the wisdom meditation.",
  "4.6.2.4.3.3.3.2.2": "Showing that abiding is like an illusion extends the understanding that not only arising and ceasing but also abiding lacks true existence, within making certain of the reason for the pervasion in the wisdom meditation.",
  "4.6.2.4.3.3.3.2.3": "Establishing the sameness of existence and pacification reveals that samsaric existence and nirvanic peace are ultimately indivisible, within making certain of the reason for the pervasion in the wisdom meditation on ceasing to grasp at true existence.",
  "4.6.2.5": "Exploring the result of meditation on emptiness shows the fruition that follows from ceasing to grasp at true existence within the detailed wisdom meditation that accomplishes the bodhisattva's training.",
  "4.6.2.5.1": "Examining the benefit of self reveals the personal fruits of meditating on emptiness within the result of the wisdom meditation that accomplishes the bodhisattva's training.",
  "4.6.2.5.1.1": "Pacifying attachment through the realization of emptiness frees oneself from clinging as a personal benefit of the meditation on emptiness within the wisdom training.",
  "4.6.2.5.1.1.1": "Demonstrating the non-establishment of the eight worldly dharmas as objects of attachment shows that gain, loss, fame, disgrace, praise, blame, pleasure, and pain lack true existence, thereby pacifying attachment within the result of the wisdom meditation.",
  "4.6.2.5.1.1.2": "Ending conditioned existence that depends upon attachment to the eight worldly dharmas reveals how emptiness meditation dissolves the perpetuation of samsara within the result of the wisdom training.",
  "4.6.2.5.1.2": "Pacifying suffering through the realization of emptiness shows how understanding the nature of reality liberates one from affliction as a personal benefit within the result of the wisdom meditation.",
  "4.6.2.5.1.2.1": "A summary of visible sufferings catalogs the readily apparent afflictions that are pacified through the meditation on emptiness within the personal benefit of the wisdom training.",
  "4.6.2.5.1.2.2": "Examining the invisible sufferings of other lives extends the scope of pacification to afflictions beyond the present existence within the result of the emptiness meditation in the wisdom training.",
  "4.6.2.5.1.2.2.1": "Addressing the sufferings of the lower realms reveals the hidden anguish of unfortunate rebirths that the meditation on emptiness can pacify within the wisdom training.",
  "4.6.2.5.1.2.2.2": "Showing that one continuously experiences suffering reveals the relentless nature of affliction across lives that the meditation on emptiness addresses within the wisdom training.",
  "4.6.2.5.1.2.2.2.1": "Demonstrating that the roots of suffering have not been pacified explains why affliction persists across lifetimes without the realization of emptiness, within the analysis of continuous suffering in the wisdom meditation.",
  "4.6.2.5.1.2.2.2.2": "Showing that one does not have the means to dispel suffering reveals the helplessness of beings who lack the meditation on emptiness, within the analysis of continuous suffering in the wisdom training.",
  "4.6.2.5.1.2.2.2.3": "Identifying the many obstacles to overcoming suffering shows the barriers that compound affliction across lives, within the analysis of continuous suffering in the wisdom meditation.",
  "4.6.2.5.1.2.2.2.3.1": "Identifying outer obstacles reveals the external circumstances that prevent beings from overcoming suffering, within the analysis of obstacles to liberation in the wisdom meditation.",
  "4.6.2.5.1.2.2.2.3.2": "Identifying inner obstacles reveals the mental afflictions and habitual patterns that prevent beings from overcoming suffering, within the analysis of obstacles to liberation in the wisdom meditation.",
  "4.6.2.5.1.2.2.2.4": "Showing that it is difficult to rely on the supports for liberation highlights how rare and fragile the conditions for practice are, within the analysis of continuous suffering in the wisdom meditation.",
  "4.6.2.5.1.2.2.2.5": "Showing that it is difficult to abandon the causes of suffering reveals how deeply entrenched the afflictions are without the realization of emptiness, within the analysis of continuous suffering in the wisdom meditation.",
  "4.6.2.5.1.2.2.3": "Revealing that beings do not even know they are suffering exposes the deepest layer of delusion that the meditation on emptiness penetrates, within the examination of invisible sufferings in the wisdom training.",
  "4.6.2.5.1.2.2.4": "Describing the kinds of suffering which will be experienced forewarns of the specific afflictions awaiting those who fail to realize emptiness, within the examination of invisible sufferings in the wisdom training.",
  "4.6.2.5.2": "Examining the benefit of others reveals how the realization of emptiness enables compassionate action for all beings within the result of the wisdom meditation that accomplishes the bodhisattva's training.",
  "4.6.2.5.2.1": "Pacifying the suffering of others through the realization of emptiness shows how the bodhisattva's wisdom directly alleviates the afflictions of all beings within the result of the wisdom meditation.",
  "4.6.2.5.2.2": "Pacifying the attachment of others through the realization of emptiness shows how the bodhisattva's wisdom frees all beings from clinging within the result of the wisdom meditation that accomplishes the training.",
  "5": "Having completed the practice, all accumulated merit is dedicated so that its fruits may ripen for the benefit of all beings.",
  "5.1": "Dedicating merit in relation to the means ensures that the skillful methods of practice yield their full result through proper dedication.",
  "5.2": "Merit is dedicated specifically for the benefit of others, directing all virtue outward toward the welfare of sentient beings.",
  "5.2.1": "Within the dedication for others, worldly benefit is sought first, aspiring that beings may enjoy happiness and freedom from suffering in this life and beyond.",
  "5.2.1.1": "A general dedication for worldly benefit expresses the broad wish that all beings throughout the world may find relief from suffering.",
  "5.2.1.2": "Dedication narrows to focus on the specific lower realms, directing merit toward beings trapped in the most intense forms of suffering.",
  "5.2.1.2.1": "Among the lower realms, dedication for hell-beings addresses those enduring the most extreme anguish, aspiring that their torment may be pacified.",
  "5.2.1.2.1.1": "Dedicating for the hell-beings' own pacification of suffering wishes that they themselves may find direct relief from their torment.",
  "5.2.1.2.1.1.1": "A general dedication for pacification aspires broadly that all forms of hell-suffering may be calmed through the power of accumulated merit.",
  "5.2.1.2.1.1.2": "Dedicating for the pacification of the cold hells aspires that beings frozen in unbearable cold may find warmth and relief through the force of merit.",
  "5.2.1.2.1.1.3": "Dedicating for the pacification of the hot hells aspires that beings consumed by fire and molten metal may find cooling and relief.",
  "5.2.1.2.1.1.3.1": "Dedicating for pacifying the suffering of the main hot hells addresses the most severe burning torments that beings endure at the heart of these realms.",
  "5.2.1.2.1.1.3.2": "Dedicating for pacifying the neighbouring hells addresses the ancillary torments surrounding the main hot hells, where beings suffer as they attempt to escape.",
  "5.2.1.2.1.2": "Beyond the hell-beings' own relief, dedication is made for their pacification through the compassionate intervention of others.",
  "5.2.1.2.1.2.1": "Through the power of Vajrapani, hell-beings may be pacified by the forceful blessing of this mighty bodhisattva's intervention.",
  "5.2.1.2.1.2.2": "Through the compassion of Padmapani, the suffering of hell-beings may be soothed by Avalokiteshvara's limitless love.",
  "5.2.1.2.1.2.3": "Through the emanation of Manjughosa, the wisdom of Manjushri's manifestation may illuminate and pacify the darkness of the hells.",
  "5.2.1.2.1.2.4": "Through the force of the other bodhisattvas' proximity, the mere presence of these noble beings may bring relief to those trapped in hell.",
  "5.2.1.2.2": "Among the lower realms, dedication for the benefit of animals aspires that beings suffering in ignorance and exploitation may find protection and ease.",
  "5.2.1.2.3": "Among the lower realms, dedication for the benefit of hungry ghosts aspires that beings tormented by insatiable craving may find nourishment and satisfaction.",
  "5.2.1.3": "Within the dedication for worldly benefit, attention turns to the higher realms, aspiring that human and celestial beings may enjoy freedom from suffering and fulfilment of their wishes.",
  "5.2.1.3.1": "Freedom from suffering is dedicated for beings in the higher realms, aspiring that even those in fortunate states may be released from the subtle sorrows that remain.",
  "5.2.1.3.2": "Beyond mere freedom from suffering, dedication is made for beings in the higher realms to attain their wholesome wishes and aspirations.",
  "5.2.1.3.2.1": "A general dedication for attaining wishes encompasses the broad hopes of beings in the higher realms for wealth, spiritual progress, and happiness.",
  "5.2.1.3.2.1.1": "Attaining wealth and possessions is dedicated so that beings in the higher realms may have the material conditions to support their welfare and practice.",
  "5.2.1.3.2.1.2": "Entering the path of perfection is dedicated so that beings in the higher realms may begin the journey of the bodhisattva's paramitas.",
  "5.2.1.3.2.1.3": "Attaining worldly happiness is dedicated so that beings in the higher realms may enjoy the full measure of well-being that fortunate existence can offer.",
  "5.2.1.3.2.2": "A dedication specific to monastics aspires that those who have renounced worldly life may find the conditions for their vows and practice to flourish.",
  "5.2.2": "Beyond worldly welfare, dedication is made for the transcendental benefit of others, aspiring that all beings may ultimately attain liberation and enlightenment.",
  "5.3": "Dedication turns inward for the benefit of the author himself, aspiring that personal merit may sustain the capacity to serve all beings.",
  "5.4": "Merit is dedicated so that the precious teachings may remain long in the world as an enduring source of happiness for all who encounter them.",
  "5.5": "The chapter concludes with a homage of remembrance to the kind teachers and guides whose generosity made the composition and practice possible."
}