{
  "1.1": "Śāntideva hasn't started the heavy lifting yet — he's still warming up.",
  "1.2": "We're still in the opening pages — the author is introducing himself.",
  "1.3": "The author is being humbly self-deprecating about what he's about to write.",
  "1.4": "This is about why you're lucky to even be reading this right now.",
  "1.5": "The rarity of the present opportunity is being emphasised.",
  "1.6": "Elixirs, jewels, trees, warriors, cosmic fire — Śāntideva is reaching for every analogy he can find.",
  "1.7": "This verse uses a vivid image to illustrate the power of one specific mind state.",
  "1.8": "Think of a section where everything is compared to something miraculous.",
  "1.9": "Śāntideva is still selling you on why this one thing matters above all else.",
  "1.10": "The author is piling up metaphors — each grander than the last.",
  "1.11": "Great evils being consumed, prisons being escaped — the imagery is dramatic.",
  "1.12": "A single mental quality is being praised as though it could change the universe.",
  "1.13": "Plantain trees, alchemical elixirs, and fires at the end of time — all in service of one point.",
  "1.14": "Limitless benefits are being enumerated — this section reads like an advertisement.",
  "1.15": "A distinction is being drawn between wishing and doing — both valuable, but differently.",
  "1.16": "Two varieties of the same precious thing are being compared.",
  "1.17": "This is about the difference between wanting to go somewhere and actually setting off.",
  "1.18": "Aspiration and application — the text is distinguishing two modes of the same quality.",
  "1.20": "Even parents, gods, and sages are being compared unfavourably here.",
  "1.21": "The intention to help all beings is being exalted above every other virtue.",
  "1.23": "This part reads like a love letter to a particular state of mind.",
  "1.24": "Śāntideva is arguing that even wanting to cure headaches generates boundless merit.",
  "1.25": "The text is making the case that this intention has never arisen before — not even in dreams.",
  "1.26": "A treasure of mind is being described as unprecedented and immeasurable.",
  "1.27": "The mere wish to help is being ranked above offerings to all the Buddhas.",
  "1.28": "Beings chase suffering while longing to escape it — the irony is deliberate.",
  "1.31": "Śāntideva is wrapping up his opening argument with crescendo praise.",
  "1.32": "The author is near the end of the beginning — the great advertisement.",
  "1.34": "Malevolent thoughts toward certain beings are said to carry aeon-long consequences.",
  "1.35": "Worldly generosity — even done contemptuously — earns respect. This is about something far greater.",
  "1.36": "We're approaching a chapter boundary — the praise is reaching its peak.",
  "2.1": "Think incense, jewels, and lotus ponds — an elaborate display of generosity.",
  "2.2": "Śāntideva is visualising gifts fit for the entire universe.",
  "2.8": "This verse is part of an imagined feast for enlightened beings.",
  "2.10": "Mountains, forests, and wish-granting trees are being mentally offered.",
  "2.13": "Bodies are being offered, bathing rituals described — a personal act of devotion.",
  "2.14": "The finest cloths and fragrant robes are being offered to holy beings.",
  "2.15": "Scented oils, parasols, and melodious praise — the ritual continues.",
  "2.16": "This is a structured devotional sequence — think of the branches of a prayer.",
  "2.17": "Prostrations and praise are being made with great formality.",
  "2.18": "The author is physically bowing — not just with body but with the full weight of his voice.",
  "2.19": "Jewel lamps, golden lotuses, and palaces — offered in imagination.",
  "2.21": "Songs of praise are being composed to the sages and their sons.",
  "2.22": "Taking refuge is being pledged — until a very specific endpoint.",
  "2.23": "Bodies are being offered, bathing rituals described — a personal act of devotion.",
  "2.24": "The finest cloths and fragrant robes are being offered to holy beings.",
  "2.26": "This is a very personal moment — the author is facing his own failures.",
  "2.27": "Śāntideva is not being philosophical here — he's being brutally honest about himself.",
  "2.28": "The tone shifts from grand offerings to raw vulnerability.",
  "2.30": "Impermanence is making the confession urgent — death could come at any time.",
  "2.32": "The author is terrified of what his actions have set in motion.",
  "2.33": "Friends, family, possessions — all will be left behind. Only karma remains.",
  "2.34": "The Lord of Death is approaching and there is nowhere to hide.",
  "2.35": "Fear of consequences is motivating a desperate honesty.",
  "2.36": "Past nonvirtues are being recalled with genuine regret.",
  "2.37": "The confession is powered by a visceral awareness of mortality.",
  "2.38": "Śāntideva is asking to be freed from his own accumulated negativity.",
  "2.39": "The author realises his body will be cremated — but his karma will follow him.",
  "2.40": "This is a very personal moment — the author is facing his own failures.",
  "2.43": "Specific bodhisattvas are being called upon by name for protection.",
  "2.45": "The author is taking refuge in particular enlightened beings — Mañjughoṣa, Avalokiteśvara and others.",
  "2.47": "An analogy with illness or a precipice is being used to establish urgency.",
  "2.49": "If ordinary dangers demand such caution, how much more so for these?",
  "2.53": "The power of reliance — turning to protectors in a time of need.",
  "2.54": "Śāntideva is reaching out to compassionate beings for help with his predicament.",
  "2.57": "The seven-branch prayer is nearing completion.",
  "2.58": "Restraint for the future is being pledged alongside confession of the past.",
  "2.60": "Think of what you do at the end of an elaborate ritual sequence.",
  "2.62": "The author is wrapping up a structured devotional practice with distinct steps.",
  "2.63": "Purification of former lives and a vow of restraint — the confession concludes.",
  "2.65": "The closing acts of a multi-part prayer are underway.",
  "3.1": "Rejoicing is happening — in others' virtue, liberation, and enlightenment.",
  "3.2": "The seven-branch prayer continues here — this is one of its middle branches.",
  "3.3": "The author is celebrating others' good deeds with genuine delight.",
  "3.4": "Buddhas are being asked not to disappear — to keep teaching.",
  "3.5": "The dharma wheel is being requested to turn — a formal supplication.",
  "3.6": "Rejoicing in virtue at every level — from worldly goodness to the bhūmis.",
  "3.7": "Merit is being dedicated toward removing all forms of suffering.",
  "3.8": "Something irreversible is happening — a point of no return.",
  "3.9": "The author is giving away everything — body, pleasures, all accumulated merit.",
  "3.10": "Think of a solemn ceremony — formal words are being spoken.",
  "3.11": "The aspiration here is total: to be a bridge, a boat, a lamp for others.",
  "3.12": "Śāntideva aspires to be whatever beings need — medicine, food, sustenance.",
  "3.13": "This verse has the feeling of a ceremony — think vows and celebrations.",
  "3.16": "The bodhisattva vow is being taken — the actual words are being recited.",
  "3.17": "The author is no longer just talking about the path — he's stepping onto it.",
  "3.18": "Witnesses are being called — something formal and irreversible is happening.",
  "3.21": "All beings are being invited to a feast of temporary and ultimate happiness.",
  "3.22": "In the presence of the protectors, a commitment is being made.",
  "3.23": "The vow itself is being spoken aloud — this is the pivotal moment.",
  "3.25": "The joy here comes from a specific moment of commitment — it's celebratory.",
  "3.27": "The author has just done something momentous and is revelling in it.",
  "3.28": "Birth into the Buddha family is being celebrated — the author feels transformed.",
  "3.29": "A blind person finding a jewel in a heap of refuse — that kind of astonishment.",
  "3.32": "Śāntideva is calling on all beings to share in his happiness.",
  "3.33": "The power to dispel suffering, ignorance, and bad rebirths is now in hand.",
  "4.1": "Śāntideva is essentially saying: 'Do you realise what you just promised?'",
  "4.2": "This is the 'but seriously though' moment after the celebration.",
  "4.4": "Having taken the vow, the stakes of failure are now terrifyingly clear.",
  "4.5": "The commitment must never be neglected — the consequences of doing so are spelled out.",
  "4.7": "The faults of breaking one's word are being laid out with mathematical precision.",
  "4.8": "Even beings who give up lesser commitments fall — how much worse for this one?",
  "4.9": "The text is describing a terrifying cycle of rebirth that follows from carelessness.",
  "4.10": "The rarity of the right conditions is emphasised — they may never come again.",
  "4.11": "This reads like a stern warning label attached to a powerful commitment.",
  "4.12": "Lower realms, no opportunity for virtue, no way back — the stakes are existential.",
  "4.13": "The tone here is urgent — like a warning on the edge of a cliff.",
  "4.14": "The faults of breaking one's word are being laid out with mathematical precision.",
  "4.15": "Even beings who give up lesser commitments fall — how much worse for this one?",
  "4.16": "The text is describing a terrifying cycle of rebirth that follows from carelessness.",
  "4.17": "The defilements are being described as adversaries in a battle you can't afford to lose.",
  "4.18": "Nonvirtues have been accumulated over many lives and they don't exhaust themselves.",
  "4.19": "The enemy here isn't external — it lives in the mind and has been there a long time.",
  "4.20": "Śāntideva is cataloguing the ways the defilements ruin everything — systematically.",
  "4.21": "Without striving now, despondency and regret will come — but too late.",
  "4.22": "The author is reflecting on how much negativity has been accumulated over lifetimes.",
  "4.23": "Time is running out — and the defilements are getting stronger, not weaker.",
  "4.24": "These enemies have no beginning and no end — unless you take action.",
  "4.25": "The 'honeyed lip of the poisoned cup' — pleasures that lead to destruction.",
  "4.26": "The defilements are being described as adversaries in a battle you can't afford to lose.",
  "4.27": "Nonvirtues have been accumulated over many lives and they don't exhaust themselves.",
  "4.28": "The defilements are being examined as though Śāntideva were a general studying the enemy.",
  "4.30": "These are not ordinary foes — they've occupied the mind since beginningless time.",
  "4.32": "Loss of autonomy is the key theme — the defilements are the ones in control.",
  "4.33": "The author is building resolve — identifying exactly what must be overcome.",
  "4.34": "If you'd fight an ordinary enemy to the death, why tolerate this one?",
  "4.35": "Even banished enemies regroup and return — but these ones never left.",
  "4.36": "The defilements have stolen your freedom and you didn't even notice.",
  "4.37": "Śāntideva is arguing that tolerating this internal occupation is madness.",
  "4.38": "The defilements are being examined as though Śāntideva were a general studying the enemy.",
  "4.39": "These are not ordinary foes — they've occupied the mind since beginningless time.",
  "4.40": "Loss of autonomy is the key theme — the defilements are the ones in control.",
  "4.41": "The author is building resolve — identifying exactly what must be overcome.",
  "4.43": "The final resolve is being made — this battle must be fought to the end.",
  "4.44": "Dedication, antidotes, and unwavering commitment — the chapter's practical conclusion.",
  "4.45": "Bears and bees pursue their goals single-mindedly — why can't you?",
  "4.46": "The essential nature of the defilements is being examined — they're not as solid as they seem.",
  "4.47": "The chapter closes with a rallying cry — no more passivity toward the real enemy.",
  "4.48": "Śāntideva grips his weapons of mindfulness and clear comprehension.",
  "5.1": "The mind is being identified as the root of all troubles — and all virtues.",
  "5.2": "If just one thing is guarded, everything else falls into place.",
  "5.3": "Śāntideva is arguing that an unguarded mind is more dangerous than any external threat.",
  "5.4": "All the sufferings of the hells were created by the mind — not by anyone else.",
  "5.6": "Weapons, snakes, enemies — none compare to the danger of your own undisciplined mind.",
  "5.7": "When the elephant of the mind is bound, all fears are bound.",
  "5.9": "The mind is being identified as the root of all troubles — and all virtues.",
  "5.11": "The perfections themselves — giving, ethics, patience — all depend on mental training.",
  "5.12": "The subject here is how to pay attention — not what to pay attention to.",
  "5.13": "Guarding the mind is presented as the single most important practice.",
  "5.14": "Like protecting a wound in a jostling crowd — that's the level of vigilance needed.",
  "5.15": "It's better to let everything else degenerate than to lose control of the mind.",
  "5.16": "All the dangers in the world were created by mind alone — this is the central argument.",
  "5.17": "The perfections themselves — giving, ethics, patience — all depend on mental training.",
  "5.18": "The subject here is how to pay attention — not what to pay attention to.",
  "5.19": "Guarding the mind is presented as the single most important practice.",
  "5.20": "Like protecting a wound in a jostling crowd — that's the level of vigilance needed.",
  "5.21": "It's better to let everything else degenerate than to lose control of the mind.",
  "5.22": "All the dangers in the world were created by mind alone — this is the central argument.",
  "5.23": "Mindfulness and clear comprehension are the gatekeepers being introduced.",
  "5.24": "Without these two, learning won't help — knowledge leaks like water from a cracked pot.",
  "5.25": "The text is describing what happens when awareness lapses — defilements rush in.",
  "5.26": "Think of someone standing guard at the doorway of the mind — that's the practice here.",
  "5.27": "Mindfulness is the sentinel — clear comprehension follows naturally when it's present.",
  "5.28": "Teachers, a sense of proper mental attitude — these are presented as causes.",
  "5.29": "Mindfulness and clear comprehension are the gatekeepers being introduced.",
  "5.30": "Without these two, learning won't help — knowledge leaks like water from a cracked pot.",
  "5.31": "The text is describing what happens when awareness lapses — defilements rush in.",
  "5.33": "Think of someone standing guard at the doorway of the mind — that's the practice here.",
  "5.34": "This reads more like a rulebook than a poem — very practical instructions.",
  "5.35": "Śāntideva sounds like a mindfulness teacher giving moment-by-moment instructions.",
  "5.39": "How to look, how to sit, how to walk — the instructions are startlingly specific.",
  "5.40": "The elephant of the mind is being tied to the great pillar of practice.",
  "5.42": "Every bodily action is being brought under the scope of awareness.",
  "5.43": "Before acting, check your motivation — that's the essential message.",
  "5.44": "Root defilements, secondary defilements — the mind is being examined at granular level.",
  "5.45": "Stand firm like a tree — don't move without clear purpose.",
  "5.46": "The gaze, the posture, the speech — everything is being regulated.",
  "5.47": "This is the most practical, day-to-day section of the entire text.",
  "5.55": "Think of someone following you around all day saying 'are you paying attention?'",
  "5.58": "This reads more like a rulebook than a poem — very practical instructions.",
  "5.59": "The body is being described as essentially useless — impure, inanimate, without essence.",
  "5.61": "Why protect this body so carefully when it will be food for vultures?",
  "5.62": "The body should be put to good use — not pampered as though it were precious.",
  "5.65": "Cheerful faces, quiet voices, accepting advice — practical guidelines for daily conduct.",
  "5.67": "Praising others' merit, speaking gently — the instructions are interpersonal now.",
  "5.71": "This is about how to behave around other people — very grounded advice.",
  "5.74": "The body is like a boat — useful for crossing, not for worshipping.",
  "5.75": "Actions, speech, looking at others — all are being brought under mindful regulation.",
  "5.76": "The body is being described as essentially useless — impure, inanimate, without essence.",
  "5.77": "Why protect this body so carefully when it will be food for vultures?",
  "5.79": "The body should be put to good use — not pampered as though it were precious.",
  "5.80": "Cheerful faces, quiet voices, accepting advice — practical guidelines for daily conduct.",
  "5.81": "Praising others' merit, speaking gently — the instructions are interpersonal now.",
  "5.82": "This is about how to behave around other people — very grounded advice.",
  "5.83": "The body is like a boat — useful for crossing, not for worshipping.",
  "5.84": "Benefitting sentient beings is the focus — how to teach, share, and protect others' minds.",
  "5.85": "The text is talking about how to give dharma teachings — to suitable recipients.",
  "5.86": "Eating, sleeping, moving — even these are being dedicated to others' benefit.",
  "5.88": "The training is being summarised — the key point is to apply everything to practice.",
  "5.89": "Śāntideva recommends reading the Sutra of Three Heaps three times daily.",
  "5.91": "Becoming knowledgeable through study, then applying it — that's the instruction.",
  "5.98": "Everything you do should benefit beings — directly or indirectly.",
  "5.99": "The chapter is wrapping up with a call to learn from the teacher and the sūtras.",
  "5.101": "Benefitting sentient beings is the focus — how to teach, share, and protect others' minds.",
  "5.102": "The text is talking about how to give dharma teachings — to suitable recipients.",
  "5.103": "Eating, sleeping, moving — even these are being dedicated to others' benefit.",
  "5.104": "The training is being summarised — the key point is to apply everything to practice.",
  "5.107": "Śāntideva recommends reading the Sutra of Three Heaps three times daily.",
  "5.109": "Becoming knowledgeable through study, then applying it — that's the instruction.",
  "6.1": "One instant of this emotion can destroy the merit of a thousand aeons.",
  "6.3": "Think of the one emotion that undoes everything good in an instant.",
  "6.4": "No peace, no happiness, no sleep — the visible consequences are being listed.",
  "6.6": "Friends become enemies and even those who are helped turn against you.",
  "6.7": "The cause of this destructive state is being identified: unhappiness of mind.",
  "6.8": "If you remove the fuel, the fire cannot burn — that's the logic here.",
  "6.9": "One instant of this emotion can destroy the merit of a thousand aeons.",
  "6.11": "Suffering is being examined — and the conclusion is that getting angry about it doesn't help.",
  "6.12": "The text asks: if you can fix it, why be upset? If you can't, why be upset?",
  "6.13": "Habituation is key — even what seems unbearable becomes tolerable with practice.",
  "6.14": "Renunciation is described as having a beneficial quality — not a punishing one.",
  "6.19": "Śāntideva is using logic to cool down a very hot emotion.",
  "6.21": "The analogy of gradually increasing tolerance — from small pains to great ones.",
  "6.22": "Neither the angry person nor the anger itself chose to arise — both lack autonomy.",
  "6.23": "Conditions produce the harm — no one actually decides to be harmful.",
  "6.24": "This verse asks: if you wouldn't be angry at bile for causing pain, why be angry at a person?",
  "6.25": "Sticks and weapons don't anger you — so why be angry at the hand that wields them?",
  "6.26": "The opponent being analysed here is not a person — it's a feeling everyone recognises.",
  "6.27": "Śāntideva is arguing that the real culprit is the defilements, not the person.",
  "6.28": "Anger itself is compelled by conditions — even the angry person is a victim.",
  "6.29": "Neither the angry person nor the anger itself chose to arise — both lack autonomy.",
  "6.31": "Conditions produce the harm — no one actually decides to be harmful.",
  "6.32": "This verse asks: if you wouldn't be angry at bile for causing pain, why be angry at a person?",
  "6.33": "Sticks and weapons don't anger you — so why be angry at the hand that wields them?",
  "6.35": "The harm-doer is driven by delusion — understanding this changes everything.",
  "6.39": "Like a hallucination causing someone to attack — the anger isn't truly their own.",
  "6.42": "Your own karma brought this situation about — why blame the other person?",
  "6.43": "This chapter asks: if you wouldn't kick a stick, why kick the one who swung it?",
  "6.45": "Praise and reputation are being examined — do they actually benefit you?",
  "6.47": "Getting angry about insults makes as much sense as getting angry at an echo.",
  "6.48": "Disrespect doesn't harm the body or possessions — so what exactly is threatened?",
  "6.50": "The analysis here is forensic — every reason for anger is being dismantled.",
  "6.51": "The harm-doer is driven by delusion — understanding this changes everything.",
  "6.52": "Even when the Three Jewels are harmed, patience is the response — they don't need your anger.",
  "6.54": "Obstacles to getting what you want are examined — and anger is shown to be pointless about them.",
  "6.55": "Someone harming your teacher or friend? Even then, patience is prescribed.",
  "6.56": "The faults of others should make you think of your own faults first.",
  "6.57": "Examining the results of actions — anger's consequences are worse than the original harm.",
  "6.59": "Whether the harm is to yourself or those you love, the analysis points the same way.",
  "6.60": "Even when the Three Jewels are harmed, patience is the response — they don't need your anger.",
  "6.61": "Obstacles to getting what you want are examined — and anger is shown to be pointless about them.",
  "6.62": "Someone harming your teacher or friend? Even then, patience is prescribed.",
  "6.64": "The faults of others should make you think of your own faults first.",
  "6.66": "Examining the results of actions — anger's consequences are worse than the original harm.",
  "6.67": "Whether the harm is to yourself or those you love, the analysis points the same way.",
  "6.68": "Even when the Three Jewels are harmed, patience is the response — they don't need your anger.",
  "6.70": "Obstacles to getting what you want are examined — and anger is shown to be pointless about them.",
  "6.72": "Enemies are being recast as teachers — they provide the opportunity to practise.",
  "6.74": "Without someone to forgive, there would be no patience — harm-doers are essential.",
  "6.76": "Merit from patience is limitless — and it requires an adversary to arise.",
  "6.78": "If beggars are fields of merit for generosity, enemies are fields of merit for this practice.",
  "6.80": "The suffering that motivates renunciation is itself a form of benefit.",
  "6.81": "Śāntideva is making the radical argument that harm-doers deserve gratitude.",
  "6.84": "Someone is being harmed — and Śāntideva is arguing they shouldn't react.",
  "6.87": "The text is examining whether the 'enemy' is really an enemy at all.",
  "6.90": "Patience brings good fortune, beauty, health, long life — the benefits are listed.",
  "6.92": "If you truly want to help others, losing your temper is the worst thing you can do.",
  "6.94": "Enemies are being recast as teachers — they provide the opportunity to practise.",
  "6.95": "Without someone to forgive, there would be no patience — harm-doers are essential.",
  "6.96": "Merit from patience is limitless — and it requires an adversary to arise.",
  "6.97": "If beggars are fields of merit for generosity, enemies are fields of merit for this practice.",
  "6.98": "The suffering that motivates renunciation is itself a form of benefit.",
  "6.100": "Śāntideva is making the radical argument that harm-doers deserve gratitude.",
  "6.102": "The benefits of patience are being catalogued — from reputation to good rebirth.",
  "6.104": "Compassion for the harm-doer is the unexpected conclusion of this analysis.",
  "6.106": "The chapter is nearing its close — patience has been thoroughly established as supreme.",
  "6.109": "Anger is being compared to other austerities — and found to be the only one that matters.",
  "6.112": "Good fortune, prosperity, beauty — all fruits of mastering this one practice.",
  "6.113": "The final verses read like a summation — every reason not to give in to this emotion.",
  "6.114": "Śāntideva asks: if patience brings all this, why would you choose its opposite?",
  "6.116": "The person who harmed you is now being viewed with something close to tenderness.",
  "6.117": "The benefits of patience are being catalogued — from reputation to good rebirth.",
  "6.119": "Compassion for the harm-doer is the unexpected conclusion of this analysis.",
  "6.120": "The chapter is nearing its close — patience has been thoroughly established as supreme.",
  "6.121": "Anger is being compared to other austerities — and found to be the only one that matters.",
  "6.122": "Good fortune, prosperity, beauty — all fruits of mastering this one practice.",
  "6.124": "The final verses read like a summation — every reason not to give in to this emotion.",
  "6.125": "Śāntideva asks: if patience brings all this, why would you choose its opposite?",
  "6.126": "The person who harmed you is now being viewed with something close to tenderness.",
  "6.127": "The benefits of patience are being catalogued — from reputation to good rebirth.",
  "6.128": "Compassion for the harm-doer is the unexpected conclusion of this analysis.",
  "6.131": "The chapter is nearing its close — patience has been thoroughly established as supreme.",
  "6.133": "Anger is being compared to other austerities — and found to be the only one that matters.",
  "7.1": "A new pāramitā is being introduced — built on the foundation of the previous one.",
  "7.2": "The definition is deceptively simple: joy in what is virtuous.",
  "7.3": "Śāntideva is essentially giving himself a pep talk about getting off the couch.",
  "7.4": "Three kinds of laziness are being identified — and none of them look like what you'd expect.",
  "7.5": "The obstacle here isn't anger or attachment — it's plain old inertia.",
  "7.6": "Death is mentioned here not to scare you, but to light a fire under you.",
  "7.7": "Think of someone who knows exactly what to do but just... can't get started.",
  "7.8": "The Yama's messengers are approaching — and you're lying there distracted.",
  "7.9": "Like a buffalo with a butcher — that's how unaware you are of what's coming.",
  "7.11": "If someone sentenced to have their hand cut off could be freed by losing a finger — they'd rejoice.",
  "7.12": "Distractions and idle pleasures are being identified as forms of laziness.",
  "7.13": "The suffering ahead is being used to generate urgency now.",
  "7.14": "Śāntideva is essentially giving himself a pep talk about getting off the couch.",
  "7.15": "Three kinds of laziness are being identified — and none of them look like what you'd expect.",
  "7.16": "Despondency — thinking 'I can't do this' — is being systematically dismantled.",
  "7.17": "Even insects and animals can attain the goal — how much more a human with faculties?",
  "7.20": "The text is building motivation — like a coach's halftime speech.",
  "7.24": "Difficulties on the path are reframed as trivial compared to the sufferings of saṃsāra.",
  "7.27": "A doctor cutting to heal causes less suffering than the disease — that's the logic.",
  "7.31": "Four powers are being introduced as the engine of sustained practice.",
  "7.33": "Motivation, steadfastness, joy, and rest — the recipe for sustained application.",
  "7.35": "Contemplating karma's ripening is prescribed — to generate the will to act.",
  "7.37": "The power of motivation is built through reflecting on what actions lead to.",
  "7.39": "Preparing to act without hesitation — testing your strength before committing.",
  "7.41": "Taking pride in one's ability to practise — not arrogance, but confident resolve.",
  "7.44": "Like an elephant entering a lake — plunging into virtue with delight.",
  "7.45": "Actions should not be started and abandoned — better to prepare well first.",
  "7.46": "Four powers are being introduced as the engine of sustained practice.",
  "7.47": "Steadfastness in action — not wavering once committed.",
  "7.48": "The defilements should be looked down upon, not feared — you have the advantage.",
  "7.49": "A crow encountering a dying snake puffs up with confidence — act the same way with defilements.",
  "7.50": "Pride in one's actions, one's capability, and one's power over defilements — three forms of healthy confidence.",
  "7.51": "Joy in virtuous action should be like a child's joy in play — effortless and absorbing.",
  "7.52": "Worldly people work so hard for uncertain results — why not apply the same to certain ones?",
  "7.53": "Never satisfied with virtue — that's the attitude being cultivated.",
  "7.54": "Steadfastness in action — not wavering once committed.",
  "7.55": "The defilements should be looked down upon, not feared — you have the advantage.",
  "7.59": "A crow encountering a dying snake puffs up with confidence — act the same way with defilements.",
  "7.60": "Pride in one's actions, one's capability, and one's power over defilements — three forms of healthy confidence.",
  "7.63": "Rest when needed — like a soldier between engagements — then return to the fight.",
  "7.64": "An experienced warrior sidesteps the sword — that's how to handle the defilements.",
  "7.65": "Drop what's failing like a dropped sword in battle — pick up another weapon immediately.",
  "7.66": "Mindfulness, concern, and self-control — the chapter's concluding triad.",
  "7.67": "Light as cotton — that's how responsive the body and mind should become.",
  "7.68": "The chapter closes with practical advice on maintaining sustained enthusiasm.",
  "7.69": "Like cotton moved by the wind — effortless, responsive, and always in motion.",
  "7.70": "Rest when needed — like a soldier between engagements — then return to the fight.",
  "7.72": "An experienced warrior sidesteps the sword — that's how to handle the defilements.",
  "7.74": "Drop what's failing like a dropped sword in battle — pick up another weapon immediately.",
  "7.75": "Mindfulness, concern, and self-control — the chapter's concluding triad.",
  "8.1": "Śāntideva is making a case for leaving everything behind.",
  "8.3": "This verse suggests that other people might be the biggest obstacle.",
  "8.4": "Attachment to beings is identified as the primary distraction.",
  "8.5": "Friends are unreliable, hard to please, and will eventually leave — why cling?",
  "8.6": "Getting close to others leads to disappointment — that's the argument being made.",
  "8.7": "Desire for companionship is presented as a subtle chain.",
  "8.8": "The text is warning that even well-meaning relationships can derail practice.",
  "8.9": "Childish people — neither satisfied nor satisfying — are best kept at a distance.",
  "8.10": "If you praise them, they're pleased; if you speak truthfully, they're angry.",
  "8.11": "Śāntideva is making a case for leaving everything behind.",
  "8.12": "This verse suggests that other people might be the biggest obstacle.",
  "8.13": "Attachment to beings is identified as the primary distraction.",
  "8.14": "Friends are unreliable, hard to please, and will eventually leave — why cling?",
  "8.15": "Getting close to others leads to disappointment — that's the argument being made.",
  "8.17": "Forests and graveyards sound appealing in this section.",
  "8.19": "Caves, abandoned shrines, and the foot of trees — the ideal dwelling is being described.",
  "8.20": "Deer, birds, and trees as companions — the author is serious about this.",
  "8.21": "Living with nothing to protect and no one to please — that's the vision.",
  "8.22": "The body will be left behind at death — why not leave everything else behind now?",
  "8.25": "A meagre robe and a begging bowl — all that's needed.",
  "8.26": "Solitude is being presented not as deprivation but as freedom.",
  "8.28": "No mourners at your funeral, no one to be missed — that's the preferred situation.",
  "8.29": "The natural world is described with genuine longing — a place of peace.",
  "8.31": "This section reads like a love letter to the forest.",
  "8.32": "Forests and graveyards sound appealing in this section.",
  "8.33": "Caves, abandoned shrines, and the foot of trees — the ideal dwelling is being described.",
  "8.34": "Deer, birds, and trees as companions — the author is serious about this.",
  "8.38": "The body's impurity is being examined — in vivid, unflinching detail.",
  "8.40": "Burial grounds and decomposition feature prominently here.",
  "8.43": "What is so attractive about a body? Śāntideva systematically takes it apart.",
  "8.45": "Bones, flesh, and skin — the object of desire is being disassembled.",
  "8.46": "The analysis is visceral — what lies beneath the surface of what we find attractive.",
  "8.47": "Attraction is being examined forensically — what exactly are you attached to?",
  "8.48": "A body wrapped in skin versus unwrapped — the difference is only concealment.",
  "8.49": "The living body is no different from the dead one — just warmer.",
  "8.58": "Desire for bodies is being described as fundamentally confused.",
  "8.59": "Even your own body — why pamper something that's essentially a walking corpse?",
  "8.61": "The body's impurity is being examined — in vivid, unflinching detail.",
  "8.62": "Burial grounds and decomposition feature prominently here.",
  "8.63": "What is so attractive about a body? Śāntideva systematically takes it apart.",
  "8.65": "Bones, flesh, and skin — the object of desire is being disassembled.",
  "8.71": "Joy in solitude — this section describes its incomparable happiness.",
  "8.72": "Free from disputes, free from defilements — the meditator's life is being praised.",
  "8.76": "Others' bodies will never bring lasting happiness — the logic is relentless.",
  "8.85": "Thinking about impermanence here — everything that seems solid will dissolve.",
  "8.86": "Cool moonlight, silence, vast spaces — the contemplative life at its most appealing.",
  "8.87": "Equality of self and others is being introduced — a pivotal concept.",
  "8.89": "Happiness and suffering are distributed equally — that's the starting premise.",
  "8.91": "Śāntideva is asking you to imagine being someone else — literally trading places.",
  "8.92": "The logic here is radical: what if 'self' and 'other' could be swapped?",
  "8.94": "This verse is part of the most psychologically daring section of the text.",
  "8.95": "If my foot's pain bothers me because it's 'mine' — why not extend that to others?",
  "8.97": "The boundary between self and other is being philosophically dissolved.",
  "8.98": "Protecting others from suffering should be as natural as protecting yourself.",
  "8.99": "The continuum of suffering doesn't respect the borders we draw around 'me'.",
  "8.100": "Self-cherishing is the source of all suffering — cherishing others is the source of all happiness.",
  "8.101": "The hands protect the feet not because they're the same, but because they belong to one body.",
  "8.102": "An imagined rival and an imagined inferior — Śāntideva is roleplaying both perspectives.",
  "8.104": "Look at the faults of cherishing yourself — look at the virtues of cherishing others.",
  "8.107": "What you fear for yourself, wish away from others. What you wish for yourself, give to others.",
  "8.108": "Śāntideva is asking you to imagine being someone else — literally trading places.",
  "8.109": "The logic here is radical: what if 'self' and 'other' could be swapped?",
  "8.110": "This verse is part of the most psychologically daring section of the text.",
  "8.111": "If my foot's pain bothers me because it's 'mine' — why not extend that to others?",
  "8.113": "The boundary between self and other is being philosophically dissolved.",
  "8.114": "Protecting others from suffering should be as natural as protecting yourself.",
  "8.115": "The continuum of suffering doesn't respect the borders we draw around 'me'.",
  "8.116": "Self-cherishing is the source of all suffering — cherishing others is the source of all happiness.",
  "8.117": "The hands protect the feet not because they're the same, but because they belong to one body.",
  "8.118": "An imagined rival and an imagined inferior — Śāntideva is roleplaying both perspectives.",
  "8.119": "Look at the faults of cherishing yourself — look at the virtues of cherishing others.",
  "8.120": "What you fear for yourself, wish away from others. What you wish for yourself, give to others.",
  "8.121": "The exchange is becoming practical — specific contemplations are being prescribed.",
  "8.122": "Envy, competitiveness, and pride are being examined from the reversed perspective.",
  "8.125": "Imagine taking on the suffering of others and giving them your happiness — that's the practice.",
  "8.131": "The self is being turned inside out — what was 'mine' becomes 'theirs' and vice versa.",
  "8.132": "This section describes the actual meditation technique — not just the philosophy.",
  "8.133": "Your own body should be used for others' benefit — that's the conclusion being drawn.",
  "8.134": "Looking at yourself through others' eyes — the text is painfully honest about what they'd see.",
  "8.136": "The reversal is complete — self-interest has been redirected outward.",
  "8.137": "Specific scenarios of rivalry and condescension are being examined — from the other side.",
  "8.138": "Whatever happiness exists in the world comes from wishing others well.",
  "8.139": "The contemplation here is deeply interior — think cushion, not classroom.",
  "8.140": "Giving away your merit, taking on others' suffering — the practice is being described in detail.",
  "8.141": "The exchange is becoming practical — specific contemplations are being prescribed.",
  "8.142": "Envy, competitiveness, and pride are being examined from the reversed perspective.",
  "8.145": "Imagine taking on the suffering of others and giving them your happiness — that's the practice.",
  "8.146": "The self is being turned inside out — what was 'mine' becomes 'theirs' and vice versa.",
  "8.147": "This section describes the actual meditation technique — not just the philosophy.",
  "8.151": "Your own body should be used for others' benefit — that's the conclusion being drawn.",
  "8.152": "Looking at yourself through others' eyes — the text is painfully honest about what they'd see.",
  "8.153": "The reversal is complete — self-interest has been redirected outward.",
  "8.154": "Specific scenarios of rivalry and condescension are being examined — from the other side.",
  "8.155": "Whatever happiness exists in the world comes from wishing others well.",
  "8.156": "The contemplation here is deeply interior — think cushion, not classroom.",
  "8.157": "Giving away your merit, taking on others' suffering — the practice is being described in detail.",
  "8.158": "The exchange is becoming practical — specific contemplations are being prescribed.",
  "8.159": "Envy, competitiveness, and pride are being examined from the reversed perspective.",
  "8.160": "Imagine taking on the suffering of others and giving them your happiness — that's the practice.",
  "8.161": "The meditation instructions are reaching their conclusion.",
  "8.163": "Body, speech, and mind are being yoked to the service of others.",
  "8.165": "Abandoning incompatible factors, relying on conducive ones — the final practical advice.",
  "8.166": "Eyes should never wander without purpose — the instructions are precise.",
  "8.167": "The body should be like a wish-fulfilling tree for other beings.",
  "8.169": "This section wraps up with specific advice on how to sustain the practice.",
  "8.170": "Solitude, few wants, contentment — the conditions for deep practice are being established.",
  "8.171": "Life is short — don't waste it. That's the chapter's closing note.",
  "8.172": "The meditation instructions are reaching their conclusion.",
  "8.174": "Body, speech, and mind are being yoked to the service of others.",
  "8.177": "Abandoning incompatible factors, relying on conducive ones — the final practical advice.",
  "8.178": "Eyes should never wander without purpose — the instructions are precise.",
  "8.180": "The body should be like a wish-fulfilling tree for other beings.",
  "8.182": "This section wraps up with specific advice on how to sustain the practice.",
  "8.183": "Solitude, few wants, contentment — the conditions for deep practice are being established.",
  "8.184": "Life is short — don't waste it. That's the chapter's closing note.",
  "8.185": "The meditation instructions are reaching their conclusion.",
  "9.1": "You might need a philosophy degree for this section — it's about to get dense.",
  "9.2": "The text shifts from practice to theory — sharp analysis begins here.",
  "9.3": "Two truths are being introduced — the framework for everything that follows.",
  "9.4": "All the previous chapters were taught for the sake of this one.",
  "9.5": "Relative and ultimate — a distinction is being drawn that changes everything.",
  "9.6": "An objection is being raised and systematically demolished.",
  "9.7": "A particular Buddhist school's position is being challenged.",
  "9.9": "The debate is about whether external objects truly exist — or only appear to.",
  "9.10": "This is a classic Indian philosophical exchange — objection, response, counter-response.",
  "9.11": "The text is dismantling a realist position with surgical precision.",
  "9.14": "Tiny particles and their relationships are being examined — do they hold up?",
  "9.16": "Mind-only — the position is being examined and found wanting.",
  "9.17": "If everything is just mind, who's perceiving whom?",
  "9.18": "The text is arguing against reducing all experience to consciousness alone.",
  "9.19": "Even the Buddha said 'mind only' for a specific purpose — not as final truth.",
  "9.20": "One school of thought is being dismantled piece by piece.",
  "9.21": "The question of whether illusions can perceive themselves is being raised.",
  "9.22": "Self-awareness of mind is being analysed — can a sword cut itself?",
  "9.23": "Mind-only — the position is being examined and found wanting.",
  "9.24": "If everything is just mind, who's perceiving whom?",
  "9.25": "The text is arguing against reducing all experience to consciousness alone.",
  "9.28": "Even the Buddha said 'mind only' for a specific purpose — not as final truth.",
  "9.29": "One school of thought is being dismantled piece by piece.",
  "9.30": "If everything is like an illusion, how does that help end suffering?",
  "9.31": "The path is being established — understanding illusion-nature is itself the antidote.",
  "9.32": "Śāntideva is defending the Mahāyāna against those who question its scriptural authority.",
  "9.33": "The objection is that Mahāyāna is not the Buddha's word — the response is methodical.",
  "9.34": "Like fire not being truly fire — even the antidote is ultimately empty.",
  "9.35": "Activities of awakened beings continue even without a self — like a wish-fulfilling tree.",
  "9.36": "Offerings still matter even though the recipient is beyond concepts — an important point.",
  "9.38": "Things are being taken apart to see if anything is really there.",
  "9.39": "If everything is like an illusion, how does that help end suffering?",
  "9.40": "The path is being established — understanding illusion-nature is itself the antidote.",
  "9.41": "Śāntideva is defending the Mahāyāna against those who question its scriptural authority.",
  "9.43": "The objection is that Mahāyāna is not the Buddha's word — the response is methodical.",
  "9.44": "Like fire not being truly fire — even the antidote is ultimately empty.",
  "9.45": "Activities of awakened beings continue even without a self — like a wish-fulfilling tree.",
  "9.46": "Offerings still matter even though the recipient is beyond concepts — an important point.",
  "9.47": "Things are being taken apart to see if anything is really there.",
  "9.48": "If everything is like an illusion, how does that help end suffering?",
  "9.49": "The path is being established — understanding illusion-nature is itself the antidote.",
  "9.51": "The analysis is getting more granular — the self is being looked for and not found.",
  "9.52": "Earth, water, fire, wind, space, consciousness — where is the self among these?",
  "9.53": "If 'I' is the aggregate of parts, which part is doing the aggregating?",
  "9.54": "Physical form is being reduced to its elements — and none of them is 'body'.",
  "9.55": "The mind is being examined — is it in the sense organs? The objects? The space between?",
  "9.56": "Feelings, perceptions, formations, consciousness — each is examined and found to be not-self.",
  "9.57": "The analysis is relentless — nothing survives the search for inherent existence.",
  "9.60": "If there's no self, who suffers? The question is being addressed head-on.",
  "9.61": "The reasoning here follows a pattern: look for the thing, fail to find it, draw the conclusion.",
  "9.62": "Śāntideva is dismantling the very thing we cling to most tightly.",
  "9.63": "The analysis is getting more granular — the self is being looked for and not found.",
  "9.64": "Earth, water, fire, wind, space, consciousness — where is the self among these?",
  "9.65": "If 'I' is the aggregate of parts, which part is doing the aggregating?",
  "9.66": "Physical form is being reduced to its elements — and none of them is 'body'.",
  "9.67": "The mind is being examined — is it in the sense organs? The objects? The space between?",
  "9.68": "Feelings, perceptions, formations, consciousness — each is examined and found to be not-self.",
  "9.69": "The analysis is relentless — nothing survives the search for inherent existence.",
  "9.70": "If there's no self, who suffers? The question is being addressed head-on.",
  "9.71": "The reasoning here follows a pattern: look for the thing, fail to find it, draw the conclusion.",
  "9.72": "Śāntideva is dismantling the very thing we cling to most tightly.",
  "9.73": "The analysis is getting more granular — the self is being looked for and not found.",
  "9.74": "Earth, water, fire, wind, space, consciousness — where is the self among these?",
  "9.75": "If 'I' is the aggregate of parts, which part is doing the aggregating?",
  "9.76": "Physical form is being reduced to its elements — and none of them is 'body'.",
  "9.77": "The mind is being examined — is it in the sense organs? The objects? The space between?",
  "9.78": "The analysis is reaching its conclusion — what remains when everything is examined?",
  "9.80": "Atoms, contact, perception — the building blocks of experience are being scrutinised.",
  "9.81": "Can partless particles touch? If they can't, what is 'contact'?",
  "9.82": "Consciousness without form apprehending form — the circularity is being exposed.",
  "9.83": "The text is now in deep philosophical territory — each concept examined and deconstructed.",
  "9.84": "Emptiness isn't being introduced here — it's being driven home with forensic rigour.",
  "9.85": "The debate has moved to the very foundations of perception and reality.",
  "9.87": "If you thought the earlier analysis was thorough, this section goes even deeper.",
  "9.88": "Conventional designation is being distinguished from ultimate reality — carefully.",
  "9.89": "The analysis is reaching its conclusion — what remains when everything is examined?",
  "9.90": "Atoms, contact, perception — the building blocks of experience are being scrutinised.",
  "9.91": "Can partless particles touch? If they can't, what is 'contact'?",
  "9.92": "Consciousness without form apprehending form — the circularity is being exposed.",
  "9.93": "The text is now in deep philosophical territory — each concept examined and deconstructed.",
  "9.94": "Emptiness isn't being introduced here — it's being driven home with forensic rigour.",
  "9.95": "The debate has moved to the very foundations of perception and reality.",
  "9.96": "If you thought the earlier analysis was thorough, this section goes even deeper.",
  "9.97": "Conventional designation is being distinguished from ultimate reality — carefully.",
  "9.98": "The analysis is reaching its conclusion — what remains when everything is examined?",
  "9.99": "Atoms, contact, perception — the building blocks of experience are being scrutinised.",
  "9.100": "Can partless particles touch? If they can't, what is 'contact'?",
  "9.101": "The argument is now between Mādhyamikas and other Buddhist schools.",
  "9.102": "Suffering exists by convention — but not ultimately. The implications are being worked out.",
  "9.104": "Compassion arises from the conventional — and is no less valid for being empty.",
  "9.106": "The four noble truths are being reconciled with emptiness — a delicate operation.",
  "9.108": "This is a dialogue — positions are being stated and refuted in alternation.",
  "9.109": "The freedom that comes from not clinging to any view — that's the prize being described.",
  "9.110": "If nothing truly exists, does the path still work? Yes — and here's why.",
  "9.111": "The text is navigating the knife-edge between nihilism and realism.",
  "9.112": "The opponent keeps saying 'but if things are empty, then...' — and Śāntideva keeps responding.",
  "9.113": "Conventional truth does the work of liberation — ultimate truth is its nature.",
  "9.114": "Even emptiness is empty — the analysis doesn't exempt itself.",
  "9.116": "The argument is now between Mādhyamikas and other Buddhist schools.",
  "9.117": "Suffering exists by convention — but not ultimately. The implications are being worked out.",
  "9.118": "Compassion arises from the conventional — and is no less valid for being empty.",
  "9.120": "The four noble truths are being reconciled with emptiness — a delicate operation.",
  "9.121": "This is a dialogue — positions are being stated and refuted in alternation.",
  "9.122": "The freedom that comes from not clinging to any view — that's the prize being described.",
  "9.123": "If nothing truly exists, does the path still work? Yes — and here's why.",
  "9.124": "The text is navigating the knife-edge between nihilism and realism.",
  "9.125": "The opponent keeps saying 'but if things are empty, then...' — and Śāntideva keeps responding.",
  "9.126": "Conventional truth does the work of liberation — ultimate truth is its nature.",
  "9.127": "Even emptiness is empty — the analysis doesn't exempt itself.",
  "9.128": "The argument is now between Mādhyamikas and other Buddhist schools.",
  "9.129": "Suffering exists by convention — but not ultimately. The implications are being worked out.",
  "9.130": "Compassion arises from the conventional — and is no less valid for being empty.",
  "9.131": "The benefits of realising emptiness are now being described — they're immense.",
  "9.132": "Cyclic existence is being examined — what keeps it going, and what stops it.",
  "9.133": "The text asks: what is it that continues from life to life?",
  "9.134": "Karma and its results are being examined in the light of emptiness.",
  "9.135": "Merit and nonvirtue still function — even in the absence of inherent existence.",
  "9.136": "The bodhisattva's compassion becomes even more powerful when combined with this understanding.",
  "9.137": "Like a dream, like a magical illusion — the comparisons are piling up.",
  "9.138": "If beings are like illusions, why help them? Because their suffering is real to them.",
  "9.139": "The text is addressing the most common objection: doesn't emptiness undermine compassion?",
  "9.140": "Saṃsāra and nirvāṇa — the distinction is being dissolved.",
  "9.141": "The benefits of realising emptiness are now being described — they're immense.",
  "9.142": "Cyclic existence is being examined — what keeps it going, and what stops it.",
  "9.143": "The text asks: what is it that continues from life to life?",
  "9.145": "Karma and its results are being examined in the light of emptiness.",
  "9.146": "Merit and nonvirtue still function — even in the absence of inherent existence.",
  "9.149": "The bodhisattva's compassion becomes even more powerful when combined with this understanding.",
  "9.150": "Like a dream, like a magical illusion — the comparisons are piling up.",
  "9.151": "If beings are like illusions, why help them? Because their suffering is real to them.",
  "9.153": "The text is addressing the most common objection: doesn't emptiness undermine compassion?",
  "9.154": "Saṃsāra and nirvāṇa — the distinction is being dissolved.",
  "9.155": "The benefits of realising emptiness are now being described — they're immense.",
  "9.156": "The ocean of suffering can be crossed — that's the promise of this analysis.",
  "9.157": "Emptiness is the medicine that cures the root illness — clinging to existence.",
  "9.158": "The chapter is reaching its peak — the highest wisdom is being pointed to.",
  "9.161": "For the sake of beings, Śāntideva would endure anything — understanding emptiness makes this possible.",
  "9.162": "The final verses of this analysis read like a crescendo of realisation.",
  "9.163": "Having dismantled everything, the text arrives at something luminous.",
  "9.165": "The ocean of suffering can be crossed — that's the promise of this analysis.",
  "9.166": "Emptiness is the medicine that cures the root illness — clinging to existence.",
  "9.167": "The chapter is reaching its peak — the highest wisdom is being pointed to."
}