{
  "1": "The branches of the explanandum establish the preliminary framework of authorship, teaching quality, and proper conduct before the main instructions of the Lamp of the Path are presented.",
  "1.1": "Recognizing the greatness of Atisha as the author of the text inspires confidence and devotion as a preliminary to receiving the main instructions.",
  "1.2": "Appreciating the greatness of the teaching itself establishes the value and authority of the Lamp of the Path before its instructions are given.",
  "1.3": "Guidance on how a teaching endowed with the greatness of both its author and its content should be properly heard and explained sets the tone for receiving the Lamp of the Path.",
  "2": "The meaning of the main instructions constitutes the heart of the Lamp of the Path, presenting the complete graduated training from lesser through superior persons.",
  "2.1": "The title of the text announces the scope and purpose of the main instructions of the Lamp of the Path to Enlightenment.",
  "2.2": "The translator's homage honours the lineage of transmission through which the main instructions of the Lamp of the Path have been conveyed.",
  "2.3": "The text itself contains the full body of Atisha's main instructions, from the opening homage through the complete exegesis of the graduated path.",
  "2.3.1": "Atisha's homage and commitment to compose the work opens the text itself with reverence and resolve to set forth the main instructions.",
  "2.3.2": "The main exegesis of the text unfolds the core teachings of the Lamp of the Path, presenting the entire graduated framework of practice.",
  "2.3.2.1": "An analytical summary of the Three Persons provides the organizing principle for the main exegesis, distinguishing lesser, intermediate, and superior practitioners of the path.",
  "2.3.2.2": "The exegesis of the characteristics of each of the three paths elaborates in detail how lesser, intermediate, and superior persons each practise within the graduated framework of the main instructions.",
  "2.3.2.2.1": "The characteristics of the lesser person's path describe the foundational orientation toward higher rebirth within the graduated framework of the three types of practitioner.",
  "2.3.2.2.2": "The characteristics of the intermediate person's path describe the cultivation of renunciation and liberation within the graduated framework of the three types of practitioner.",
  "2.3.2.2.3": "The characteristics of the superior person's path present the bodhisattva's training in compassion, bodhicitta, and the union of method and wisdom as the highest of the three graduated levels of practice.",
  "2.3.2.2.3.1": "A brief summary introduces the essential features of the superior person's path before they are elaborated in detail within the exegesis of the three paths.",
  "2.3.2.2.3.2": "The detailed explanation of the characteristics of the superior person's path unfolds the full scope of the bodhisattva's training in both the perfection and mantra vehicles.",
  "2.3.2.2.3.2.1": "The extensive explanation of the path of the perfections lays out the bodhisattva's graduated training in detail within the superior person's path.",
  "2.3.2.2.3.2.1.1": "An analytical presentation of the path structures the bodhisattva's progressive training within the extensive explanation of the perfection vehicle on the superior person's path.",
  "2.3.2.2.3.2.1.1.1": "The commitment to explain signals Atisha's intention to set forth the analytical presentation of the bodhisattva's path of the perfections in a systematic manner.",
  "2.3.2.2.3.2.1.1.2": "The explanation of the authentic path presents the actual content of the bodhisattva's graduated training in aspiration and application within the perfection vehicle.",
  "2.3.2.2.3.2.1.1.2.1": "Aspiration and its training address the cultivation and stabilization of the wish for enlightenment as the first phase of the authentic bodhisattva path of the perfections.",
  "2.3.2.2.3.2.1.1.2.1.1": "Preparations for generating aspirational bodhicitta lay the necessary groundwork of accumulation, refuge, and mental training before the main practice on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.1.1": "Gathering the accumulations of merit and wisdom serves as a foundational preparation for generating aspirational bodhicitta on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.1.2": "The act of going for special refuge provides a distinct and elevated form of taking shelter as preparation for generating aspirational bodhicitta on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.1.3": "Training the mind in compassion and love prepares the practitioner inwardly for the generation of aspirational bodhicitta on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.2": "The main practice constitutes the actual generation of aspirational bodhicitta, the central act within the training of the bodhisattva's aspiration on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.1.3": "Subsequent practices sustain and strengthen aspirational bodhicitta after it has been generated, ensuring the wish for enlightenment is not lost on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.3.1": "Training in remembering the benefits of bodhicitta reinforces the practitioner's resolve as a subsequent practice following the generation of aspiration on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.3.2": "Training in the cultivation of bodhicitta deepens and stabilizes the altruistic intention as an ongoing practice after aspirational bodhicitta has been generated.",
  "2.3.2.2.3.2.1.1.2.1.3.3": "Training in gathering the two accumulations of merit and wisdom sustains the force of aspirational bodhicitta as an ongoing practice on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.3.4": "Training in not abandoning sentient beings in one's thoughts preserves the inclusive scope of bodhicitta as a subsequent practice on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.1.3.5": "Training in accepting and rejecting black and white dharmas guides the practitioner's ethical discernment as a subsequent practice sustaining aspirational bodhicitta on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2": "Application and its training address the active engagement in bodhisattva conduct through taking and upholding the vow of application bodhicitta on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.1": "Connecting aspiration with the vow of application bodhicitta bridges the wish for enlightenment with the commitment to active bodhisattva conduct on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.2": "How one takes the vow details the process of formally receiving the bodhisattva vow of application within the training of active engagement on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.2.1": "The recipient of the vow specifies who is qualified to receive the bodhisattva vow of application within the training of active engagement on the superior person's path.",
  "2.3.2.2.3.2.1.1.2.2.2.2": "The bestower of the vow identifies the qualified master who confers the bodhisattva vow of application within the training of active engagement on the superior person's path.",
  "2.3.2.2.3.2.1.1.2.2.2.3": "The ritual method of taking the vow describes the ceremonial procedure for receiving the bodhisattva vow of application on the superior person's path.",
  "2.3.2.2.3.2.1.1.2.2.2.3.1": "The ritual when the lama is present sets out the standard ceremonial method for receiving the bodhisattva vow of application in the presence of a qualified master.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2": "The ritual when the lama is absent provides an alternative method for receiving the bodhisattva vow of application when no qualified master is available.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.1": "General and specific commitments to explain the vow ritual in accord with the tradition establish the framework for the self-generation of the bodhisattva vow when no lama is present.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2": "Showing how to generate bodhicitta and take the vow as taught in the sutra presents the scriptural basis for self-administering the bodhisattva vow when no lama is present.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2.1": "Generating bodhicitta is the inner prerequisite for taking the bodhisattva vow according to the sutra method when no lama is present.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2.2": "Taking the vow formalizes the commitment to bodhisattva conduct according to the sutra method when no lama is present on the superior person's path.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2.2.1": "Adopting the moral conduct of avoiding violations of the vow establishes the restraint dimension of the bodhisattva precepts taken according to the sutra method.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2.2.2": "Adopting the moral conduct of benefitting sentient beings establishes the altruistic dimension of the bodhisattva precepts taken according to the sutra method.",
  "2.3.2.2.3.2.1.1.2.2.2.3.2.2.2.3": "Adopting the moral conduct of gathering virtuous dharmas establishes the dimension of cultivating positive qualities within the bodhisattva precepts taken according to the sutra method.",
  "2.3.2.2.3.2.1.1.2.2.3": "Advice on training for one who has taken the vow guides the bodhisattva in the threefold discipline of moral conduct, mind, and wisdom after receiving the vow of application on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.1": "Training of moral conduct constitutes the ethical foundation of the bodhisattva's discipline after taking the vow of application on the superior person's path.",
  "2.3.2.2.3.2.1.1.2.2.3.1.1": "The actual training in moral conduct specifies the practices of ethical discipline that the bodhisattva undertakes after receiving the vow of application.",
  "2.3.2.2.3.2.1.1.2.2.3.1.2": "The great importance of moral conduct underscores why ethical discipline is indispensable for the bodhisattva's training after taking the vow of application.",
  "2.3.2.2.3.2.1.1.2.2.3.2": "Training of mind develops the meditative concentration that supports the bodhisattva's discipline after taking the vow of application on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.2.1": "Recognizing that training in calm abiding is the cause of developing the higher knowledges motivates the bodhisattva to cultivate meditative concentration within the training of mind.",
  "2.3.2.2.3.2.1.1.2.2.3.2.2": "How to train in calm abiding provides practical guidance on developing meditative concentration within the bodhisattva's training of mind on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.2.2.1": "The prerequisites of calm abiding identify the conditions that must be established before the bodhisattva can effectively cultivate meditative concentration.",
  "2.3.2.2.3.2.1.1.2.2.3.2.2.2": "How to meditate on calm abiding instructs the bodhisattva in the actual practice of developing meditative concentration within the training of mind.",
  "2.3.2.2.3.2.1.1.2.2.3.2.2.3": "The benefits of the meditation on calm abiding encourage the bodhisattva by showing the fruits of developing meditative concentration within the training of mind.",
  "2.3.2.2.3.2.1.1.2.2.3.3": "Training of wisdom cultivates the penetrating insight that completes the bodhisattva's threefold discipline after taking the vow of application on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1": "Showing the training in higher insight introduces the need for and nature of the wisdom that penetrates reality within the bodhisattva's training on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.1": "The essential point of the need to train in the wisdom of higher insight establishes why penetrating insight into reality is indispensable for the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.2": "The essential point of the need to train in unifying means and wisdom establishes that neither compassionate method nor penetrating insight alone suffices on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3": "Explaining the actual path of unification presents how means and wisdom are practised together as the authentic method of the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3.1": "A brief summary introduces the key points of the actual path unifying means and wisdom within the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3.2": "The detailed explanation of the path of unification elaborates on how means and wisdom work together within the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3.2.1": "Identifying means clarifies what constitutes the compassionate method aspect of the unified path within the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3.2.2": "The necessity of developing means establishes why the compassionate method aspect must be cultivated on the unified path of the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.1.3.2.3": "Identifying wisdom clarifies what constitutes the insight aspect of the unified path within the bodhisattva's training in higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2": "How to train in higher insight provides the practical methods for developing penetrating wisdom within the bodhisattva's training on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1": "The detailed explanation of how to train in higher insight unfolds the specific contemplative and scriptural methods for cultivating penetrating wisdom on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1": "The basis for accumulating higher insight establishes the foundational analytical and scriptural methods from which penetrating wisdom is developed on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1.1": "Showing the wisdom of reflection which arises from analytical contemplation presents the reasoning methods that serve as a basis for accumulating higher insight on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1.1.1": "The analysis of result through the argument of arising and cessation from existence or nonexistence examines phenomena through their effects as a contemplative method for developing higher insight.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1.1.2": "The analysis of cause through the argument of the vajra slivers examines the nature of origination as a contemplative method for developing higher insight on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1.1.3": "The analysis of nature through the argument of the one and the many examines the essential character of phenomena as a contemplative method for developing higher insight on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.1.2": "Showing the wisdom of hearing which arises in dependence upon scripture presents the textual basis for accumulating higher insight alongside the analytical methods on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.2": "How to meditate on higher insight instructs the bodhisattva in the actual contemplative practice of cultivating penetrating wisdom on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.3": "The results of meditating on higher insight describe the fruits that arise from the bodhisattva's sustained cultivation of penetrating wisdom on the path of the perfections.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.3.1": "The main part of the results of meditating on higher insight presents the primary attainments that arise from cultivating penetrating wisdom on the bodhisattva's path.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.1.3.2": "Establishing the results of higher insight by scriptural reference provides authoritative textual support for the attainments described within the bodhisattva's training in wisdom.",
  "2.3.2.2.3.2.1.1.2.2.3.3.2.2": "A concluding summary of how to train in higher insight draws together the essential points of cultivating penetrating wisdom within the bodhisattva's training on the path of the perfections.",
  "2.3.2.2.3.2.1.2": "The analytical presentation of the result describes the fruition of the bodhisattva's training within the extensive explanation of the path of the perfections on the superior person's path.",
  "2.3.2.2.3.2.2": "A brief explanation of how to practise the mantra vehicle introduces the Vajrayana as a complementary path within the detailed explanation of the superior person's training.",
  "2.3.2.2.3.2.2.1": "Showing the necessity of entering into the Vajrayana by attaining empowerment establishes that tantric initiation is the gateway to practising the mantra vehicle on the superior person's path.",
  "2.3.2.2.3.2.2.1.1": "The individual who is the basis identifies the qualities required of a person who would receive tantric empowerment as the entry point to the mantra vehicle.",
  "2.3.2.2.3.2.2.1.2": "The empowerment which ripens them describes the specific initiations that mature the practitioner for tantric practice within the mantra vehicle on the superior person's path.",
  "2.3.2.2.3.2.2.1.3": "Showing the importance of the empowerment underscores why tantric initiation is indispensable for authentic practice of the mantra vehicle on the superior person's path.",
  "2.3.2.2.3.2.2.2": "Specific qualifications for those who would receive the two higher empowerments delineate the additional requirements for advanced tantric initiation within the mantra vehicle.",
  "2.3.2.2.3.2.2.3": "Analysing whether it is appropriate to teach, hear, or study the tantras without having received the two higher empowerments addresses the boundaries of tantric engagement within the mantra vehicle.",
  "2.3.3": "The reason for composing the text explains Atisha's motivation for writing the Lamp of the Path, completing the main body of the work before the colophon.",
  "2.4": "The colophon records the historical details of authorship and translation that conclude the main instructions of the Lamp of the Path.",
  "2.4.1": "Who wrote the text identifies Atisha as the author in the colophon that concludes the Lamp of the Path.",
  "2.4.2": "Who translated it identifies the translators responsible for rendering the Lamp of the Path into Tibetan in the concluding colophon."
}
