{
  "1": "Introductory topics set the stage for the King of Aspirations by establishing the context and framework for the prayer.",
  "1.1": "Explaining the meaning of the name reveals the significance and intention behind the title of the King of Aspirations.",
  "1.2": "The translators' homage honors the lineage of transmission as a customary opening within the introductory topics of the prayer.",
  "2": "The Seven Branch Prayer serves as the preliminary practice that accumulates merit and purifies obscurations in preparation for the actual aspiration.",
  "2.1": "Prostration and homage express reverence to the buddhas as the first of the seven branches that form the preliminary practice.",
  "2.1.1": "The extensive presentation of homage elaborates in detail on the ways of paying respect to the buddhas within the preliminary prostration practice.",
  "2.1.1.1": "Physical homage employs the body as an instrument of reverence within the extensive presentation of prostration in the Seven Branch Prayer.",
  "2.1.1.2": "Mental homage engages the mind in devotion and visualization within the extensive presentation of prostration in the Seven Branch Prayer.",
  "2.1.1.3": "Verbal homage uses speech to praise and honor the buddhas within the extensive presentation of prostration in the Seven Branch Prayer.",
  "2.2": "Offerings presented to the buddhas constitute the second branch of the preliminary Seven Branch Prayer.",
  "2.2.1": "Quantifiable offerings describe material and tangible gifts presented to the buddhas within the offering branch of the Seven Branch Prayer.",
  "2.2.2": "Unsurpassable offerings transcend ordinary material gifts to present the highest possible offerings within the offering branch of the Seven Branch Prayer.",
  "2.3": "Confession purifies negativities and downfalls as the third branch of the preliminary Seven Branch Prayer.",
  "2.4": "Rejoicing in the virtue of others multiplies one's own merit as the fourth branch of the preliminary Seven Branch Prayer.",
  "2.5": "Requesting the wheel of Dharma to be turned invites the buddhas to teach for the benefit of all beings as the fifth branch of the preliminary Seven Branch Prayer.",
  "2.6": "Supplicating the buddhas not to pass into nirvana beseeches them to remain present in the world as the sixth branch of the preliminary Seven Branch Prayer.",
  "2.7": "Dedicating all fruits to enlightenment directs the accumulated merit toward the ultimate goal as the seventh and final branch of the preliminary Seven Branch Prayer.",
  "3": "The actual aspiration forms the main body of the prayer, where Samantabhadra's profound wishes for the benefit of all beings are expressed in full.",
  "3.1": "Aspiring for a pure intention establishes the altruistic motivation that underlies all subsequent aspirations in the main body of the prayer.",
  "3.1.1": "The intention to offer to all the buddhas expresses the wish to serve every awakened being as part of cultivating a pure aspiration.",
  "3.1.2": "Aspiring to fulfill the buddhas' intentions aligns one's purpose with the wishes of the awakened ones within the cultivation of pure aspiration.",
  "3.1.3": "Aspiring to purify buddha realms envisions the creation of perfect environments for awakening within the cultivation of pure intention.",
  "3.1.4": "Aspiring to benefit beings directs the pure intention toward the welfare of all sentient life within the main aspiration.",
  "3.2": "Aspiring never to forget bodhicitta safeguards the awakening mind across all lifetimes as a central wish within the main aspiration.",
  "3.2.1": "Aspiring to remember previous lives supports the continuity of bodhicitta by maintaining awareness across rebirths within the aspiration never to forget the awakening mind.",
  "3.2.2": "Aspiring to become a renunciate ensures the conditions for spiritual practice are maintained as a support for never forgetting bodhicitta.",
  "3.2.3": "Aspiring to train in general conduct and pure discipline establishes ethical foundations that protect bodhicitta from being forgotten.",
  "3.2.4": "Aspiring to teach the Dharma in various languages enables the communication of truth to all beings as a means of sustaining bodhicitta.",
  "3.2.5": "Aspiring to exertion in virtue cultivates diligent engagement in wholesome activity as a cause for never losing the awakening mind.",
  "3.2.6": "Aspiring not to forget bodhicitta through these five causes consolidates the preceding supports into a firm resolve to maintain the awakening mind.",
  "3.2.7": "Aspiring to be free from negative conditions removes obstacles that could cause the loss of bodhicitta within the aspiration to maintain the awakening mind.",
  "3.3": "Aspiring to be free from defilements expresses the wish to purify all afflictive emotions within the main body of the actual aspiration.",
  "3.4": "Aspiring to lead beings to benefit and happiness directs the bodhisattva's activity toward the welfare of all sentient beings within the main aspiration.",
  "3.5": "Aspiring to wear the bodhisattva armor expresses the courageous commitment to persevere in benefiting beings regardless of difficulty within the main aspiration.",
  "3.6": "Aspiring to be with friends of similar karmic maturity seeks the companionship of like-minded practitioners as a support on the path within the main aspiration.",
  "3.7": "Aspiring to rely on spiritual friends and please them honors the vital role of the teacher-student relationship within the main aspiration.",
  "3.8": "Aspiring to make offerings to the buddhas continues the devotional practice of generosity toward the awakened ones within the main body of the aspiration.",
  "3.9": "Aspiring to retain the genuine Dharma commits to preserving and upholding the authentic teachings within the main aspiration.",
  "3.10": "Aspiring to become an inexhaustible treasury wishes for boundless resources to benefit beings within the main aspiration.",
  "3.11": "Aspiring to engage in different methods for good actions encompasses the diverse skillful means a bodhisattva employs within the main aspiration.",
  "3.11.1": "Engaging in seeing the buddhas in their pure realms envisions direct encounter with the awakened ones as one of the diverse methods for good actions in the main aspiration.",
  "3.11.2": "Engaging in the speech of the buddhas attunes to the enlightened communication of the awakened ones as one of the methods for good actions in the main aspiration.",
  "3.11.3": "Engaging in the turning of the Dharma wheel participates in the dissemination of the teachings as one of the methods for good actions in the main aspiration.",
  "3.11.4": "Entering into all aeons extends the bodhisattva's activity across the entirety of time as one of the methods for good actions in the main aspiration.",
  "3.11.5": "Engaging in seeing the tathagatas cultivates the vision of the thus-gone ones as one of the methods for good actions in the main aspiration.",
  "3.11.6": "Engaging in the sphere of activity of the buddhas enters into the field of enlightened action as one of the methods for good actions in the main aspiration.",
  "3.11.7": "Engaging in producing and entering pure realms manifests and inhabits awakened environments as one of the methods for good actions in the main aspiration.",
  "3.11.8": "Engaging in going before the tathagatas presents oneself in the presence of the buddhas as one of the methods for good actions in the main aspiration.",
  "3.12": "Aspiring for the powers of enlightenment seeks to attain the extraordinary capacities of awakening within the main aspiration.",
  "3.12.1": "The power of swift miracles enables instantaneous enlightened activity as the first of the powers sought within the aspiration for enlightenment.",
  "3.12.2": "The power of the yana serves as the vehicle or doorway through which beings are led to liberation within the aspiration for the powers of enlightenment.",
  "3.12.3": "The power of conduct perfects all aspects of bodhisattva behavior within the aspiration for the powers of enlightenment.",
  "3.12.4": "The power of all-pervasive love extends compassionate concern to every being without exception within the aspiration for the powers of enlightenment.",
  "3.12.5": "The power of merit provides the accumulated positive force needed for awakening within the aspiration for the powers of enlightenment.",
  "3.12.6": "The power of wisdom penetrates the true nature of reality within the aspiration for the powers of enlightenment.",
  "3.12.7": "The power of knowledge encompasses the full scope of understanding within the aspiration for the powers of enlightenment.",
  "3.12.8": "The power of methods employs skillful means to benefit beings within the aspiration for the powers of enlightenment.",
  "3.12.9": "The power of samadhi cultivates profound meditative absorption within the aspiration for the powers of enlightenment.",
  "3.13": "Aspiring to practice remedies to pacify the obscurations seeks to apply antidotes that eliminate obstacles to awakening within the main aspiration.",
  "3.14": "Aspiring for enlightened activity envisions the spontaneous and effortless benefit of beings that flows from full awakening within the main aspiration.",
  "3.15": "Aspiring to enter the training commits to following the path of practice within the main aspiration.",
  "3.15.1": "Emulating the buddhas takes the fully awakened ones as the model for one's own training within the aspiration to enter the path of practice.",
  "3.15.2": "Emulating the bodhisattva Samantabhadra follows the example of the bodhisattva of good actions as a guide for entering the training within the main aspiration.",
  "3.15.3": "Emulating the bodhisattva Manjushri follows the example of the bodhisattva of wisdom as a guide for entering the training within the main aspiration.",
  "3.16": "Summary and concluding aspirations gather and seal the full range of wishes expressed throughout the main body of the actual aspiration.",
  "3.17": "The extent of aspirations describes the boundless scope and reach of all the wishes made within the main body of the actual aspiration.",
  "4": "The benefits of making aspirations reveal the fruits and advantages that arise from engaging wholeheartedly in Samantabhadra's prayer.",
  "4.1": "A brief presentation introduces the benefits that arise from making aspirations in a concise overview.",
  "4.2": "The detailed presentation elaborates extensively on the many specific benefits that arise from making aspirations.",
  "4.2.1": "Freedom from going to the lower realms is among the first protective benefits presented in the detailed account of the fruits of making aspirations.",
  "4.2.2": "Never having unwholesome friends ensures one is surrounded by positive influences as a benefit of making aspirations.",
  "4.2.3": "Seeing Amitabha soon promises swift encounter with the buddha of boundless light as a benefit of making aspirations.",
  "4.2.4": "Acquiring all benefits for practice grants the favorable conditions needed for spiritual development as a fruit of making aspirations.",
  "4.2.5": "Being sustained in physical and mental happiness ensures well-being on all levels as a benefit of making aspirations.",
  "4.2.6": "Present life going well brings immediate worldly benefit in this very lifetime as a fruit of making aspirations.",
  "4.2.7": "Becoming like Samantabhadra promises the attainment of qualities equal to the great bodhisattva as a benefit of making aspirations.",
  "4.2.8": "Negative acts being purified cleanses accumulated wrongdoing as a transformative benefit of making aspirations.",
  "4.2.9": "Possession of wisdom grants the development of profound understanding as a benefit of making aspirations.",
  "4.2.10": "Having an attractive form bestows a pleasing physical appearance as a benefit of making aspirations.",
  "4.2.11": "Not being overpowered by aggressors provides protection from harm and hostile forces as a benefit of making aspirations.",
  "4.2.12": "Being respected by all earns universal esteem and reverence as a benefit of making aspirations.",
  "4.2.13": "Quick completion of paths and bhumis accelerates progress through the stages of awakening as a benefit of making aspirations.",
  "4.3": "The benefits presented in brief recapitulates concisely the advantages of making aspirations after the detailed account.",
  "5": "The dedication of merit directs all accumulated virtue from the prayer toward the fulfillment of the aspirations and the benefit of all beings.",
  "5.1": "Entering into the dedication of the supreme bodhisattvas follows the example of the great bodhisattvas in directing merit within the concluding dedication.",
  "5.2": "Entering into the dedication of the buddhas follows the example of the fully awakened ones in directing merit within the concluding dedication.",
  "5.3": "Dedication towards actualizing the result directs merit toward the attainment of full awakening within the concluding dedication.",
  "5.4": "Dedication towards receiving a prophecy from the Buddha aspires to the confirmation of one's future awakening within the concluding dedication.",
  "5.5": "Dedication to accomplish the benefit of beings directs all merit toward the welfare of sentient life within the concluding dedication.",
  "6": "The concluding dedication seals the entire King of Aspirations prayer by directing all virtue toward the ultimate benefit of all beings."
}
