{
  "1.1": "This verse belongs to: Prostration and homage.",
  "1.2": "This verse belongs to: Physical.",
  "1.3": "This verse belongs to: Verbal.",
  "1.4": "This verse belongs to: Verbal.",
  "1.5": "This verse belongs to: Quantifiable.",
  "1.6": "This verse belongs to: Quantifiable.",
  "1.7": "This verse belongs to: Unsurpassable.",
  "1.8": "This verse belongs to: Confession.",
  "1.9": "This verse belongs to: Rejoicing.",
  "1.10": "This verse belongs to: Requesting the wheel of Dharma to be turned.",
  "1.11": "This verse belongs to: Supplicating buddhas not to pass into nirvana.",
  "1.12": "This verse belongs to: Dedication of all fruits to enlightenment.",
  "1.13": "This verse belongs to: The intention to offer to all the buddhas.",
  "1.14": "This verse belongs to: To purify buddha realms.",
  "1.15": "This verse belongs to: To benefit beings.",
  "1.16": "This verse belongs to: Aspiring to remember previous lives.",
  "1.17": "This verse belongs to: Aspiring to train in the general conduct and pure discipline.",
  "1.18": "This verse belongs to: Aspiring to teach the Dharma in various languages.",
  "1.19": "This verse belongs to: Aspiring to exertion in virtue.",
  "1.20": "This verse belongs to: Aspiration to be free from defilements.",
  "1.21": "This verse belongs to: Aspiration to lead beings to benefit and happiness.",
  "1.22": "This verse belongs to: Aspiration to wear the bodhisattva armor.",
  "1.23": "This verse belongs to: Aspiration to be with friends of similar karmic maturity.",
  "1.24": "This verse belongs to: Aspiration to rely on spiritual friends and thus to please them.",
  "1.25": "This verse belongs to: Aspiration to make offerings to the buddhas.",
  "1.26": "This verse belongs to: Aspiration to retain the genuine Dharma.",
  "1.27": "This verse belongs to: Aspiration to become an inexhaustible treasury.",
  "1.28": "This verse belongs to: Engage in seeing the buddhas in their pure realms.",
  "1.29": "This verse belongs to: Engage in seeing the buddhas in their pure realms.",
  "1.30": "This verse belongs to: Engage in the speech of the buddhas.",
  "1.31": "This verse belongs to: Engage in the turning of the Dharma wheel.",
  "1.32": "This verse belongs to: Entering into all aeons.",
  "1.33": "This verse belongs to: Engage in seeing the tathagatas.",
  "1.34": "This verse belongs to: Engage in producing and entering pure realms.",
  "1.35": "This verse belongs to: Engage in going before the tathagatas.",
  "1.36": "This verse belongs to: The power of swift miracles.",
  "1.37": "This verse belongs to: The power of merit.",
  "1.38": "This verse belongs to: Aspiration to practice remedies to pacify the obscurations.",
  "1.39": "This verse belongs to: Aspiration for enlightened activity.",
  "1.40": "This verse belongs to: Aspiration for enlightened activity.",
  "1.41": "This verse belongs to: Emulating the buddhas.",
  "1.42": "This verse belongs to: Emulating the bodhisattvas: Samantabhadra.",
  "1.43": "This verse belongs to: Emulating the bodhisattvas: Samantabhadra.",
  "1.44": "This verse belongs to: Emulating the bodhisattvas: Manjushri.",
  "1.45": "This verse belongs to: Summary / concluding aspirations.",
  "1.46": "This verse belongs to: Extent of aspirations.",
  "1.47": "This verse belongs to: Brief presentation.",
  "1.48": "This verse belongs to: Brief presentation.",
  "1.49": "This verse belongs to: Free from going to the lower realms.",
  "1.50": "This verse belongs to: Acquiring all benefits for practice.",
  "1.51": "This verse belongs to: Negative acts will be purified.",
  "1.52": "This verse belongs to: Possession of wisdom.",
  "1.53": "This verse belongs to: Quick completion of paths and bhumis.",
  "1.54": "This verse belongs to: The benefits in brief.",
  "1.55": "This verse belongs to: Entering into the dedication of the supreme bodhisattvas.",
  "1.56": "This verse belongs to: Entering into the dedication of the buddhas.",
  "1.57": "This verse belongs to: Dedication towards actualizing the result.",
  "1.58": "This verse belongs to: Dedication towards actualizing the result.",
  "1.59": "This verse belongs to: Dedication towards receiving a prophecy from the Buddha.",
  "1.60": "This verse belongs to: Dedication to accomplish the benefit of beings.",
  "1.61": "This verse belongs to: Concluding dedication.",
  "1.62": "This verse belongs to: Concluding dedication.",
  "1.63": "This verse belongs to: Concluding dedication."
}
