{
  "1": "The introduction to the Friendly Letter establishes what is virtuous in the beginning by presenting the text's title, paying homage, and extolling the qualities of the Buddha.",
  "1.1": "Explaining the correspondence between the Sanskrit and Tibetan titles of the shastra establishes the textual identity at the outset of the Friendly Letter's introduction.",
  "1.2": "Paying homage to Manjushri, the supreme deity of wisdom, consecrates the beginning of the shastra with an invocation of the highest discernment.",
  "1.3": "Advising the king to listen attentively to the recounting of the Buddha's mental qualities opens the introduction by directing the mind toward the Bhagavan's awakened wisdom.",
  "1.4": "Recounting the qualities of the Buddha's body serves to diminish the king's pride within the introductory praise that establishes a receptive frame of mind.",
  "1.5": "Praising the king as a protector of the dharma while recounting the qualities of the Buddha's speech completes the introduction's encomium of body, speech, and mind.",
  "2": "The body of the text constitutes what is virtuous in the interim, presenting the complete practical instructions on the three higher trainings of moral discipline, meditative concentration, and wisdom.",
  "2.1": "Training in higher moral discipline forms the first of the three trainings in the main body of the text, establishing the ethical foundation for the entire path.",
  "2.1.1": "An explanation of what is generally important for both householders and renunciates addresses the universal foundations of moral discipline shared by all practitioners.",
  "2.1.1.1": "Increasing faith through training in the six things to remember is taught as the root of all dharma and the cause of merit within the general foundations of moral discipline.",
  "2.1.1.2": "Once faith has been stabilized, training in virtue while avoiding sinful actions becomes necessary as the next step in the general foundations of moral discipline.",
  "2.1.1.3": "Abandoning alcohol, which causes unconcern in matters of acceptance and rejection, is singled out as essential within the general training in virtue for all practitioners.",
  "2.1.1.4": "Relying upon a virtuous livelihood that avoids harming others or breeding unconcern is advised as part of the general moral discipline for both householders and renunciates.",
  "2.1.1.5": "Giving up all wealth to benefit others is presented as the most excellent way of stabilizing virtue within the general foundations of moral discipline.",
  "2.1.1.6": "Retaining flawless moral discipline ensures that the merit of giving is not wasted or exhausted, safeguarding generosity within the general training for all practitioners.",
  "2.1.1.7": "Recounting the qualities of moral discipline highlights its inherent excellence within the general foundations shared by householders and renunciates alike.",
  "2.1.1.8": "Having developed the happiness of the higher realms through giving and moral discipline, training in the six perfections is advised to accomplish the bliss of non-dwelling nirvana within the general foundations for all practitioners.",
  "2.1.2": "An explanation of the specific points of conduct essential for householders addresses the particular ethical responsibilities of lay practitioners within the training in moral discipline.",
  "2.1.2.1": "Venerating one's parents with respect and service, remembering their kindness in developing body and mind, is the first specific conduct taught for householders within moral discipline.",
  "2.1.2.2": "Guarding the eight precepts of uposatha on holy days is advised as a specific practice essential for householders within the training in moral discipline.",
  "2.1.2.3": "Abandoning the most serious faults of mind is shown as necessary conduct for householders within the training in moral discipline.",
  "2.1.2.4": "Concern is shown to be the root of abandoning negativity and accomplishing virtue within the specific conduct essential for householders in the training in moral discipline.",
  "2.1.2.4.1": "Showing the necessity of concern establishes why conscientiousness is indispensable for householders who wish to abandon negativity and accomplish virtue.",
  "2.1.2.4.2": "Explaining the benefits of concern demonstrates the positive fruits that arise from conscientiousness within the householder's training in moral discipline.",
  "2.1.2.5": "Meditating on patience as the root of peace and happiness, having abandoned anger and resentment, is taught as essential conduct for householders within moral discipline.",
  "2.1.2.5.1": "Abandoning anger is the first aspect of cultivating patience as a source of peace and happiness within the householder's training in moral discipline.",
  "2.1.2.5.2": "Abandoning resentment completes the cultivation of patience alongside the abandonment of anger within the householder's training in moral discipline.",
  "2.1.2.6": "Rather than reinforcing negative concepts, holding stable a virtuous mind is advised as essential conduct for householders within the training in moral discipline.",
  "2.1.2.7": "Abandoning negative speech and speaking gently is taught as an important aspect of conduct for householders within the training in moral discipline.",
  "2.1.2.8": "Training in excellent physical behaviour, having dispensed with negative conduct of body, is advised for householders within the training in moral discipline.",
  "2.1.2.9": "Associating only with excellent friends and abandoning negative non-virtuous companions is advised as essential for householders within the training in moral discipline.",
  "2.1.2.10": "Inappropriate desire for another's wife is shown as the foundation for the harms of desire and hatred within the specific conduct for householders in moral discipline.",
  "2.1.2.10.1": "Explaining the method of rejecting desire for another's wife addresses the practical means of overcoming this particular affliction within the householder's moral training.",
  "2.1.2.10.2": "Explaining the faults of desire reveals the harmful consequences that arise from attachment within the householder's training to overcome inappropriate craving.",
  "2.1.2.10.3": "Sensual pleasures do not satisfy but rather bind one, deepening the understanding of desire's harms within the householder's moral training.",
  "2.1.2.10.4": "The supreme hero is one who is able to guard his mind, reframing the conquest of desire as the highest form of valor within the householder's moral training.",
  "2.1.2.10.5": "Reflecting that objects of desire are devoid of essence provides the method of guarding the mind against attachment within the householder's moral training.",
  "2.1.2.10.6": "The grave fault of desire is its insatiability, which is shown as the culminating reason to abandon craving within the householder's moral training.",
  "2.1.3": "An explanation of the specific trainings for both householders and renunciates addresses the shared advanced practices within the training in moral discipline.",
  "2.1.3.1": "Wisdom which cognizes the ultimate is shown to be the most supreme remedy, within the specific trainings in moral discipline shared by householders and renunciates.",
  "2.1.3.2": "Possessing both morality and wisdom together is shown to be the most supreme quality within the shared trainings of moral discipline.",
  "2.1.3.3": "The eight worldly dharmas are shown to be obstacles to morality and wisdom within the shared trainings of moral discipline for all practitioners.",
  "2.1.3.4": "Following the negative morality of outsiders who teach harmful religions is shown to be inappropriate within the shared trainings of moral discipline.",
  "2.1.3.5": "One must necessarily experience the ripening of whatever evil actions one has committed, reinforcing karmic accountability within the shared trainings of moral discipline.",
  "2.1.3.6": "Possession of the seven noble jewels is shown to be the most excellent wealth within the shared trainings of moral discipline for all practitioners.",
  "2.1.3.7": "Abandoning the six causes of damage to one's reputation as a religious person is instructed within the shared trainings of moral discipline.",
  "2.1.3.8": "The contented person has no regrets whether prosperity or decline occurs, illustrating the power of contentment within the shared trainings of moral discipline.",
  "2.1.3.9": "The faults of discontent are shown as a concluding warning within the shared trainings of moral discipline for both householders and renunciates.",
  "2.2": "Training in higher meditative concentration forms the second of the three trainings in the main body of the text, developing the mind's capacity for stable absorption.",
  "2.2.1": "The preliminaries to meditative concentration prepare the practitioner's conditions of body and lifestyle for the development of stable absorption.",
  "2.2.1.1": "Binding the doors of the senses is the first preliminary practice that prepares the ground for meditative concentration by restraining sensory engagement.",
  "2.2.1.1.1": "A bad wife who creates obstacles to meditative absorption and the path of liberation is shown to be inappropriate as a companion, within the preliminary of binding the senses for concentration.",
  "2.2.1.1.2": "Having taken a good wife who is the opposite, one must respect and honour her like a goddess, within the preliminary of binding the senses for meditative concentration.",
  "2.2.1.2": "Moderating one's eating is advised for both householders and renunciates as a preliminary condition for developing meditative concentration.",
  "2.2.1.3": "Striving in the yoga of not sleeping is advised for renunciates and householders as a preliminary practice supporting meditative concentration.",
  "2.2.2": "The main part of meditative concentration presents the actual absorptions and their application to both higher states and the path of liberation.",
  "2.2.2.1": "Meditative absorption which accomplishes higher states develops the concentration practices that lead to favorable rebirths and refined mental states.",
  "2.2.2.1.1": "Meditation on the four immeasurables of love, compassion, joy, and equanimity is taught as a means of accomplishing higher states through meditative concentration.",
  "2.2.2.1.1.1": "The actual meditation on love and the other immeasurables is the practice itself within the cultivation of the four immeasurables for accomplishing higher states.",
  "2.2.2.1.1.2": "The benefits of meditating on the four immeasurables reveal the positive results of cultivating love, compassion, joy, and equanimity for higher states.",
  "2.2.2.1.2": "Meditating on the four absorptions develops progressively deeper states of concentration as a means of accomplishing higher states.",
  "2.2.2.1.2.1": "The actual meditation on the absorptions is the practice of entering the four dhyanas within the concentration training for accomplishing higher states.",
  "2.2.2.1.2.2": "The benefits of the four absorptions reveal the fruits of practicing the dhyanas within the concentration training for accomplishing higher states.",
  "2.2.2.1.3": "Developing the power of virtue throughout subsequent attainment after meditating on the absorptions extends concentration's benefits into post-meditation activity.",
  "2.2.2.1.3.1": "The five particularities are shown as the means for maintaining virtue in subsequent attainment after rising from the absorptions that accomplish higher states.",
  "2.2.2.1.3.2": "Developing undaunted enthusiasm sustains the power of virtue in subsequent attainment after meditating on the absorptions for higher states.",
  "2.2.2.1.4": "Abandoning the five obstructions to meditative absorption removes the hindrances that prevent the accomplishment of higher states through concentration.",
  "2.2.2.2": "Meditative absorption which truly and correctly accomplishes the path of liberation turns concentration toward the ultimate goal of freedom from samsara.",
  "2.2.2.2.1": "Having relied upon the path of accumulation, meditating on the path of application serves as the direct cause of the noble path within the concentration that accomplishes liberation.",
  "2.2.2.2.2": "Abandoning pride as the obstruction to the path of meditation removes the principal hindrance within the concentration that accomplishes liberation.",
  "2.2.2.2.3": "Meditating on the correct view is shown to be of great importance within the concentration that truly accomplishes the path of liberation.",
  "2.2.2.2.3.1": "A brief explanation introduces the importance of meditating on the correct view within the concentration that accomplishes the path of liberation.",
  "2.2.2.2.3.1.1": "The benefits of meditation on the correct view are shown within the brief explanation of why correct view is essential for the path of liberation.",
  "2.2.2.2.3.1.2": "The defects of not meditating on the correct view are shown within the brief explanation of why correct view is essential for the path of liberation.",
  "2.2.2.2.3.2": "The extensive exposition elaborates in detail on the correct view that is essential for the concentration accomplishing the path of liberation.",
  "2.2.2.2.3.2.1": "Meditating on the meaning of non-self as the object of realization forms the core insight within the extensive exposition of the correct view for liberation.",
  "2.2.2.2.3.2.1.1": "Refuting the four perviews in respect of the body dismantles false identifications with the physical form within the meditation on non-self for liberation.",
  "2.2.2.2.3.2.1.2": "Refuting the twenty extremes which regard the aggregates as a self eliminates misconceptions about the five skandhas within the meditation on non-self for liberation.",
  "2.2.2.2.3.2.1.3": "Refuting the six erroneous views of the cause of the aggregates corrects wrong understanding of origination within the meditation on non-self for liberation.",
  "2.2.2.2.3.2.1.4": "Showing the inerrant cause establishes the correct understanding of dependent origination within the meditation on non-self for liberation.",
  "2.2.2.2.3.2.2": "Identifying liberation as the object of attainment clarifies what is to be realized within the extensive exposition of the correct view for liberation.",
  "2.2.2.2.3.2.2.1": "Even wishing for liberation is insufficient if one does not abandon all three adverse conditions, within the identification of liberation as the object of attainment in the correct view.",
  "2.2.2.2.3.2.2.2": "There is no possibility of being propelled to liberation by others if one does not create one's own liberation through meditation, within the identification of liberation as the object of attainment.",
  "2.2.2.2.3.2.2.3": "Meditating on the Four Truths as the means of liberation is shown to be necessary within the identification of liberation as the object of attainment in the correct view.",
  "2.2.2.2.3.2.2.4": "All paths to liberation are contained within the three trainings, consolidating the entire path within the identification of liberation as the object of attainment.",
  "2.2.2.2.3.2.2.5": "Cultivating the mindfulness of not forgetting the essential point of all the teachings is shown to be necessary within the identification of liberation as the object of attainment.",
  "2.2.2.2.3.2.3": "Showing that the three realms are devoid of essence motivates renunciation within the extensive exposition of the correct view for the path of liberation.",
  "2.2.2.2.3.2.3.1": "Meditating on impermanence in samsara reveals the transient nature of all conditioned phenomena within the teaching that the three realms are devoid of essence.",
  "2.2.2.2.3.2.3.1.1": "Meditating on the impermanence of sentient beings' lives in the inner realm reveals the fragility of existence within the contemplation of samsara's impermanence.",
  "2.2.2.2.3.2.3.1.2": "Meditating on the body's impermanence deepens the recognition of transience within the contemplation of samsara's impermanence for the correct view.",
  "2.2.2.2.3.2.3.1.3": "Meditating on the impermanence of the outer realm, the world itself, extends the contemplation of transience beyond sentient beings to the environment.",
  "2.2.2.2.3.2.3.1.4": "The condensed meaning of meditating on samsara's lack of essence summarizes the impermanence contemplations into a single realization of the futility of cyclic existence.",
  "2.2.2.2.3.2.3.2": "Meditating on the difficulty of acquiring leisure and endowment reveals the preciousness of human birth within the teaching that the three realms are devoid of essence.",
  "2.2.2.2.3.2.3.2.1": "Showing by example the difficulty of obtaining leisure and endowment illustrates through analogy how rare a precious human birth truly is.",
  "2.2.2.2.3.2.3.2.2": "Showing by example the unsuitability of wasting what has been acquired warns against squandering the rare opportunity of a precious human birth.",
  "2.2.2.2.3.2.3.2.3": "Meditating on the four great wheels which constitute one's own endowment identifies the specific attributes that make a human life conducive to practice.",
  "2.2.2.2.3.2.3.2.4": "Meditating on the great importance of relying upon a spiritual friend addresses the endowment provided by others within the contemplation of leisure and endowment.",
  "2.2.2.2.3.2.3.2.5": "Meditating on joy at having abandoned the eight unfree states and obtained the eight attributes of leisure cultivates appreciation for one's fortunate circumstances.",
  "2.2.2.2.3.2.3.3.1": "Meditating on the suffering of formations reveals the pervasive unsatisfactoriness of all conditioned existence within the teaching that the three realms are devoid of essence.",
  "2.2.2.2.3.2.3.3.1.1": "Meditating on suffering in samsara in general establishes the all-pervading nature of dissatisfaction within the contemplation of the suffering of formations.",
  "2.2.2.2.3.2.3.3.1.2": "Meditating on uncertainty in samsara reveals how nothing remains fixed or reliable within the contemplation of the suffering of formations.",
  "2.2.2.2.3.2.3.3.1.3": "Meditating on dissatisfaction shows that no amount of worldly experience can ever bring lasting fulfillment within the contemplation of the suffering of formations.",
  "2.2.2.2.3.2.3.3.1.4": "Meditating on immeasurability reveals the inconceivable extent of suffering endured across beginningless samsara within the contemplation of the suffering of formations.",
  "2.2.2.2.3.2.3.3.1.5": "Meditating on taking a body again and again reveals the relentless cycle of rebirth within the contemplation of the suffering of formations.",
  "2.2.2.2.3.2.3.3.2": "Meditating on the suffering of change reveals how apparent pleasures inevitably transform into pain within the teaching that the three realms are devoid of essence.",
  "2.2.2.2.3.2.3.3.2.1": "Meditating on the instability of superiors and inferiors in samsara shows how status constantly shifts within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.2": "Meditating on the instability of happy minds shows how even pleasant mental states are impermanent within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.3": "Meditating on the instability of pleasant dwelling places shows how favorable environments inevitably change within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.4": "Meditating on the instability of the happiness of delightful beauties shows how attractive appearances inevitably fade within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.5": "Meditating on the instability of the artificial happiness of bathing and similar comforts shows how manufactured pleasures are fleeting within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.6": "Meditating on the instability of the happiness and pleasure of the higher realms shows that even divine enjoyments eventually cease within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.7": "Meditating on the instability of the happiness of glory and brilliance shows how fame and radiance are impermanent within the contemplation of the suffering of change.",
  "2.2.2.2.3.2.3.3.2.8": "Collecting merit as the remedy to these sufferings, and recognizing that sinful practitioners will be friendless wherever they are born, concludes the contemplation of the suffering of change with an exhortation to virtuous practice.",
  "2.2.2.2.3.2.3.3.3": "Meditating on the suffering of suffering addresses the direct, manifest pain experienced in the lower states within the teaching that the three realms are devoid of essence.",
  "2.2.2.2.3.2.3.3.3.1": "Meditating on the sufferings of the lower states examines the intense torments of hell beings, animals, and pretas within the contemplation of the suffering of suffering.",
  "2.2.2.2.3.2.3.3.3.1.1": "Meditating on the sufferings of hell beings reveals the most extreme torments endured in the lower states within the contemplation of the suffering of suffering.",
  "2.2.2.2.3.2.3.3.3.1.1.1": "Meditating on the sufferings of the eight hot hells caused by hatred reveals how aversion leads to the most intense torments among the hell realms.",
  "2.2.2.2.3.2.3.3.3.1.1.2": "Specifically meditating on the suffering of crushing describes one of the particular torments within the hot hells born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.3": "Meditating on the suffering of the black threads describes the torment of being marked and sawn apart within the hot hells born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.4": "Meditating on the suffering of being filled with molten metal describes the agonizing immersion experienced in the heating hell born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.5": "Meditating on the suffering of being impaled on searing stakes describes another torment of the heating hell born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.6": "Meditating on the sufferings of the neighbouring hells reveals the additional torments surrounding the main hot hells born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.7": "Meditating on the suffering of the swamp of rotten corpses describes one of the specific agonies among the neighbouring hells surrounding the hot hells.",
  "2.2.2.2.3.2.3.3.3.1.1.8": "Meditating on the suffering of burning in torturous flames describes the agony of fire in the heating hell born from hatred.",
  "2.2.2.2.3.2.3.3.3.1.1.9": "Meditating on the suffering of blazing in the great vats of incessant torment describes the most extreme fiery anguish among the hot hells.",
  "2.2.2.2.3.2.3.3.3.1.1.10": "Meditating that it is appropriate to be fearful of the hells generates the urgency needed to turn away from the causes of such suffering.",
  "2.2.2.2.3.2.3.3.3.1.1.11": "Meditating on the terror in seeing mere depictions of the hell realms deepens the recognition of how unimaginably dreadful the actual experience must be.",
  "2.2.2.2.3.2.3.3.3.1.1.12": "Meditating on the unendurable suffering of the incessant torment hell contemplates the most extreme and relentless agony among all the hell realms.",
  "2.2.2.2.3.2.3.3.3.1.1.13": "In summary, no example can encompass the full extent of the suffering of the hells, concluding the detailed meditation on hell beings' torments.",
  "2.2.2.2.3.2.3.3.3.1.1.14": "One must experience the suffering of hells for as long as one's actions are not exhausted, revealing the karmic duration of hell-realm torment.",
  "2.2.2.2.3.2.3.3.3.1.1.15": "These hells are not experienced spontaneously or by chance but only by those who accumulate non-virtues of body, speech, and mind, revealing the karmic cause of hell-realm suffering.",
  "2.2.2.2.3.2.3.3.3.1.2": "Meditating on the sufferings of animals examines the particular torments of the animal realm within the contemplation of the lower states' suffering.",
  "2.2.2.2.3.2.3.3.3.1.2.1": "Meditating on the general suffering of animals provides an overview of the pervasive hardships faced across the animal realm.",
  "2.2.2.2.3.2.3.3.3.1.2.2": "Meditating on specific individual sufferings of animals details the particular torments endured by different creatures within the animal realm.",
  "2.2.2.2.3.2.3.3.3.1.3": "Meditating on the sufferings of pretas examines the torments of the hungry ghost realm within the contemplation of the lower states' suffering.",
  "2.2.2.2.3.2.3.3.3.1.3.1": "Meditating on the general sufferings of pretas provides an overview of the pervasive misery characterizing the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.2": "Meditating on the suffering of having inner obscurations reveals how internal blockages prevent pretas from consuming nourishment within the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.3": "Meditating on the suffering of having disgusting bodies reveals how pretas are tormented by their own repulsive physical forms within the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.4": "Meditating on the suffering of obscurations of hunger and thirst reveals how pretas are perpetually deprived of sustenance within the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.5": "Meditating on the suffering of eating one another out of extreme hunger reveals the desperate extremes of deprivation within the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.6": "Meditating on the suffering of the outer obscurations of pretas reveals how the external environment itself prevents them from finding nourishment within the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.1.3.7": "Meditating that the suffering of pretas is not exhausted until their negative karma is complete reveals the enduring duration of hungry ghost torment.",
  "2.2.2.2.3.2.3.3.3.1.3.8": "Showing the cause of undergoing the sufferings of pretas identifies the karmic roots of miserliness and greed that produce rebirth in the hungry ghost realm.",
  "2.2.2.2.3.2.3.3.3.2": "Meditating on the instability of happiness in the higher states reveals that even the gods and asuras are not free from suffering within the contemplation of the suffering of suffering.",
  "2.2.2.2.3.2.3.3.3.2.1": "Meditating on the suffering of the gods reveals that even celestial beings face inevitable decline within the contemplation of the instability of the higher states.",
  "2.2.2.2.3.2.3.3.3.2.1.1": "A general account of the suffering of the higher states establishes that even divine existence is permeated by unsatisfactoriness within the meditation on the gods' suffering.",
  "2.2.2.2.3.2.3.3.3.2.1.2": "The five sufferings which are signs of the gods' death are explained in particular, revealing the specific anguish of impending decline within the meditation on the gods' suffering.",
  "2.2.2.2.3.2.3.3.3.2.1.3": "Meditating on the suffering of falling again when the accumulation of virtuous deeds is exhausted reveals the tragic impermanence of divine existence.",
  "2.2.2.2.3.2.3.3.3.2.2": "Meditating on the suffering of the asuras reveals the torment of jealousy and constant warfare that characterizes the demigod realm within the higher states.",
  "2.2.2.2.3.2.3.4": "Since all three realms are without essence, meditating on the great importance of renouncing the entirety of samsara draws the conclusion from the preceding contemplations of suffering and impermanence.",
  "2.2.2.2.3.2.3.4.1": "No matter where one is born in the higher realms or lower states, it will be a container of suffering, reinforcing the imperative to renounce all of samsara.",
  "2.2.2.2.3.2.3.4.2": "Relying upon the method of ceasing all causes of craving for rebirth in samsara now, at this time when there is freedom, is shown to be of great importance for renouncing cyclic existence.",
  "2.2.2.2.3.2.3.4.3": "The method of ceasing craving for samsara is dependence upon the three trainings alone, identifying the complete path within the contemplation of renunciation.",
  "2.2.2.2.3.2.3.4.4": "The path of liberation, or nirvana, is not an object or place completely separate from oneself, correcting a fundamental misunderstanding within the contemplation of renunciation.",
  "2.2.2.2.3.2.3.4.5": "The path on which one attains liberation is the seven limbs of enlightenment alone, identifying the specific method of practice within the contemplation of renunciation.",
  "2.3": "Training in higher wisdom forms the third and final of the three trainings in the main body of the text, developing the insight that realizes the nature of reality.",
  "2.3.1": "The benefits of meditating on wisdom establish the motivation for cultivating the higher training in insight that realizes the nature of reality.",
  "2.3.2": "The beneficial wisdom itself presents the actual content of what is to be understood and contemplated within the training in higher wisdom.",
  "2.3.2.1": "The wisdom of that which is not to be contemplated identifies what lies beyond conceptual engagement within the presentation of the beneficial wisdom itself.",
  "2.3.2.2": "The wisdom of that which, when contemplated, is very beneficial presents the subjects whose investigation yields profound insight within the training in higher wisdom.",
  "2.3.2.2.1": "How samsara arises as the succession of the twelve links of dependent origination explains the mechanism of cyclic existence within the wisdom of what is very beneficial to contemplate.",
  "2.3.2.2.2": "How nirvana is attained by reversing the revolution of the twelve links reveals the path to liberation within the wisdom of dependent origination.",
  "2.3.2.2.3": "Understanding dependent origination reveals the essence of the Buddha's teachings, showing the profound benefit of this contemplation within the training in higher wisdom.",
  "2.3.2.2.4": "By mastery of dependent origination, the eightfold noble path focusing on the Four Noble Truths arises, connecting the wisdom of interdependence to the complete path of practice.",
  "2.3.2.2.5": "Focusing on the truths of the path is shown to be the Four Truths of a noble one, establishing the framework of suffering, origin, cessation, and path within the training in higher wisdom.",
  "2.3.3": "Advice to train in wisdom provides the concluding exhortations for the third higher training, encouraging diligent application of insight into the nature of reality.",
  "2.3.3.1": "Abandoning laziness through continual exertion in the Four Truths is the first piece of advice given for training in higher wisdom.",
  "2.3.3.2": "Praising the possibility of attaining nirvana even while remaining at home encourages all practitioners within the advice to train in higher wisdom.",
  "2.3.3.3": "Past masters who were noble ones became so through their effort and exertion as ordinary people, offering encouragement against disheartedness within the advice to train in wisdom.",
  "2.3.3.4": "Taming the mind alone is the root of dharma, and so one should abandon discouragement, as a final exhortation within the advice to train in higher wisdom.",
  "3": "The conclusion, virtuous in the end, brings the Friendly Letter to completion by proclaiming the greatness of its instructions, urging the Mahayana path, and dedicating merit.",
  "3.1": "Proclaiming the greatness of these instructions acknowledges the depth and completeness of the teachings contained within the Friendly Letter's conclusion.",
  "3.1.1": "Since the entirety of practical instructions on the three trainings is contained in this shastra, it will be difficult to accomplish it fully, acknowledging the vast scope of the teachings in the conclusion.",
  "3.1.2": "Nevertheless, accomplishing whatever one is able to makes one's life meaningful through the undiminished accumulation of merit, offering encouragement within the conclusion's proclamation of the text's greatness.",
  "3.2": "Training in the path of the Great Vehicle, the essence of dharma, is urged as the culminating direction of practice within the conclusion of the Friendly Letter.",
  "3.2.1": "Rejoicing without jealousy in others' virtue, dedicating roots of virtue to their benefit, and developing bodhichitta are taught as essential Mahayana practices within the conclusion.",
  "3.2.2": "Practising great waves of bodhisattva activity for the benefit of others is advised as necessary within the conclusion's presentation of the Great Vehicle path.",
  "3.2.3": "Attaining buddhahood as the ultimate training of perfect ripening is encouraged as the final aspiration within the conclusion's presentation of the Great Vehicle path.",
  "3.3": "Through these practices one attains the unsurpassable fruit of the ultimate fulfilment of the two benefits, revealing the final result within the conclusion of the Friendly Letter.",
  "3.4": "The shastra's colophon explains the composition and transmission of the text, providing the formal closing of the Friendly Letter."
}