{
  "verses": [
    "In the language of India, it is Suhrillekha. In Tibetan, it is bshes pa’i spring yig.",
    "I bow down to Manjushri Kumarabhuta.",
    "O virtuous and worthy one with intrinsic qualities,\nMerit arises from hearing the words of the Sugata.\nAspiring to this, it is appropriate that you\nShould listen to these few noble verses that I have put together.",
    "Just as an image of the Sugata, though it be made of wood\nAnd whatever it may be like, is venerated by the wise,\nSo likewise do not despise this which is based upon\nThe teachings of the sacred dharma, though its poetry may be poor.",
    "Although you may have already heard\nAnd understood in your heart many of the Great Sage’s words,\nIs it not the case that something made from limestone\nIs made whiter by the light of the midnight moon?",
    "The Buddha, dharma and sangha,\nGiving, moral discipline and the gods are the six things to be remembered.\nYou should remember the multitude of qualities of each of these,\nWhich have been thoroughly expounded by the Conqueror.",
    "Always practise the ten paths of virtuous deeds\nThrough body, speech and mind.\nRefrain from alcohol and likewise\nThoroughly delight in a virtuous livelihood.",
    "Knowing that wealth is unstable and devoid of essence,\nRightly bestow gifts upon bhikshus, brahmins,\nThe poor and friends. For the next life\nThere is no better friend than transcendent giving.",
    "You should practise moral discipline which is\nUnimpaired, blameless, unmixed and unsullied.\nMorality is said to be the foundation of all virtues,\nJust as the earth is the support of both the motile and immotile.",
    "Increase measureless transcendent giving, moral discipline,\nPatience, effort, absorption and wisdom.\nBecome a Lord of Conquerors\nWho has transcended the ocean of existence.",
    "One who venerates his parents\nPossesses the caste of Brahma and the acharyas.\nOne will win veneration and fame\nAnd later attain the higher realms.",
    "Abandon killing, theft, sex, lying,\nAlcohol, attachment to food at improper times,\nEnjoyment of high seats and beds and all kinds\nOf songs, dances and adornments.",
    "Possessing these eight limbs in emulation of\nThe moral discipline of the arhats,\nThe uposatha bestows the beautiful form\nOf a desire realm god upon men and women.",
    "Avarice, cunning, attachment, laziness,\nArrogance, desire, hatred and pride\nRegarding one’s caste, form, learning or youth, or\nGreat power: look upon conceit in these as enemies.",
    "The Sage has said that concern is the source of nectar\nAnd unconcern is the source of death.\nHence in order to increase your virtue,\nWith devotion always practise concern.",
    "Even one who previously was unconcerned\nBut later became concerned\nWill be completely resplendent like the moon free from clouds,\nAs with Nanda, Angulimala, Darshaka and Udayana.",
    "Since there is no austerity like patience,\nYou must give anger no opportunity to arise.\nBy giving up anger, the stage of a non­returner\nWill be attained. Thus the Buddha has said.",
    "‘I was abused by him, struck by him, defeated by him.\nHe stole my property.’\nHarbouring such resentment leads to trouble.\nOne who gives up resentment sleeps happily.",
    "Recognize thoughts to be like\nDrawings made on water, earth or stone.\nThe first of these is best for those with disturbing emotions\nAnd the last for those who desire dharma.",
    "The Conqueror taught that there are three kinds\nOf speech possessed by people—pleasant, truthful\nAnd false—which resemble\nHoney, flowers and excrement. Abandon the last of these.",
    "Light destined for light, darkness\nDestined for darkness, light destined for darkness\nAnd darkness destined for light:\nSuch are the four persons; be as the first of these.",
    "People should be understood to be like mangoes:\nClassified as ‘unripe but seemingly ripe’,\n‘Ripened but seemingly unripe’, ‘unripe and appearing unripe’\nAnd ‘ripe and appearing ripe’.",
    "Do not gaze upon another’s wife;\nWhen you see her, think of her according to her age as your mother, daughter\nOr sister. If desire persists,\nMeditate on her actual impurity.",
    "Protect the vacillating mind as you would learning, similar to a child,\nAs treasure or like life itself.\nHave revulsion for sensual pleasures which are like\nA snake, poison, a weapon, an enemy or fire.",
    "Desires produce destruction.\nSince the Lord of Conquerors declared those to be like kimbu fruits,\nAbandon them. Worldlings are fettered\nIn the prison of samsara by such iron chains.",
    "Of the one who conquers the ever­\nUnstable and wavering objects of the six senses\nAnd the one who conquers the enemy army in battle,\nThe wise know the first to be a greater hero.",
    "Look upon the body of a young maiden on its own to be foul­ smelling,\nWith impurities issuing from the nine doors,\nLike a vessel of all impurities, difficult to satisfy,\nCovered with skin and with jewellery on the outside.",
    "Just as the insect­-ridden leper,\nFor the sake of comfort, huddles by the fire,\nYet it brings no peace, know that those who cling to desires\nAre also like him.",
    "In order to see the ultimate, meditate on\nMaking the mind correctly understand substantial things.\nThere is no other dharma\nWith a similar quality to that.",
    "Although a person may possess caste, good appearance and learning,\nHe will not be esteemed if he lacks wisdom and morality.\nHowever, one who possesses these two qualities is venerated,\nEven if he lacks the other qualities.",
    "O knower of the world, gain and loss,\nHappiness and unhappiness, fame and infamy,\nPraise and blame—the eight worldly dharmas—\nAre not objects for your mind. Hence, be impartial to them.",
    "You should not commit sins for the sake of\nBrahmins, monks, gods, guests,\nParents, children, queens or entourage.\nThere is no one to share their full maturation in hell.",
    "Though some sinful deeds performed\nWill not harm you immediately as would a weapon,\nWhen the time of death comes,\nThe results from sinful actions will be clear.",
    "Faith, morality, giving, flawless learning,\nSelf ­respect, shame and\nWisdom are the seven riches as the Sage has well said.\nRecognize other ordinary riches to be meaningless.",
    "Gambling, attending gatherings,\nLaziness, reliance on sinful friends,\nAlcohol and nocturnal wandering are bad pursuits\nWhich will damage one’s reputation. Abandon these six.",
    "Contentment is the most excellent amongst all riches,\nAs the teacher of gods and men has taught.\nAlways have contentment. If one has contentment,\nEven without riches one will have true wealth.",
    "Gracious one, sufferings accord with the number\nOf possessions one has. Those with few desires will not have many.\nThe more heads the naga lords have,\nThe more sufferings these will bring.",
    "One whose character relates to oneself as an enemy like an executioner;\nOne who disrespects her husband like a great lady;\nOne who steals even small things like a thief;\nOne should avoid these three types of wife.",
    "One who is harmonious like a sister,\nCaring about one like a dear friend,\nWishing to benefit one like a mother and helping one\nLike an assistant, should be honoured like a familial deity.",
    "With the understanding that food is like medicine,\nApproach it without desire or hatred;\nNot to be full, not out of pride\nAnd not for vanity, but only for maintaining the body.",
    "Lord of reason, recite until the end of the day\nAnd in the early and later parts of the night.\nThen, so that even sleep will not be fruitless,\nSleep mindfully in the middle period.",
    "On love, compassion, joy\nAnd equanimity, always correctly meditate.\nEven if the supreme is not gained now,\nOne will obtain the bliss of the Brahma world.",
    "Sensual pleasure, joy and bliss, and suffering\nAre completely abandoned through the four absorptions, by which four,\nAn equal status to that of the Brahma, Clear Light,\nFlourishing Virtue And Great Fruition gods will be obtained.",
    "Constancy, full motivation, no opposition,\nBasis of qualities and primary basis:\nVirtues and non­virtues are amplified through these five factors.\nTherefore diligently engage them in virtuous conduct.",
    "Understand that a pinch of salt changes the taste of a\nLittle water but not that of the river Ganges;\nSimilarly a small sinful deed\nWith vast roots of virtue.",
    "Agitation and remorse, maliciousness, dullness and\nSleepiness, yearning for desires, and doubts:\nKnow these five obscurations to be thieves\nWhich will steal the wealth of virtue.",
    "Faith, energy, mindfulness,\nConcentration and wisdom are the highest dharma.\nAssiduously perform these five,\nCalled powers and faculties. You will indeed reach the summit.",
    "‘Sickness, ageing, death, separation from what is dear\nAnd similarly actions are mine alone and not yet transcended.’\nRepeatedly considering this\nIs the remedy by which there will be no conceit.",
    "If you really desire the higher realms or liberation,\nCultivate the true view.\nSomeone with wrong views, although they may practise goodness,\nThe full ripening of all that will contain torment.",
    "Understand that the true nature of humans is unhappiness,\nImpermanence, selflessness, and impurity.\nWithout the foundations of mindfulness\nOne is destroyed by the four opposite views.",
    "It is taught: ‘Form is not a self.’\nSelf does not have a form. Self does not abide in form.\nForm does not abide in a self. Similarly,\nRecognize that the four remaining aggregates are also empty.",
    "The aggregates did not come about through their own wishes, nor from time,\nNor from an intrinsic nature, nor from their own essence,\nNor from a creator god, nor without cause.\nUnderstand they arise from ignorance, actions and craving.",
    "Grasping at moral discipline and asceticism as supreme,\nThe mistaken view of the body and doubts:\nKnow that always practising these three\nObstructs the door to the city of liberation.",
    "Liberation depends upon oneself.\nSince there is nothing others can do to help,\nWith hearing, moral discipline and meditative absorption,\nStrive in the Four Truths.",
    "In superior moral discipline, superior wisdom\nAnd superior contemplation, one must constantly train.\nMore than one hundred and fifty trainings\nAre truly included in these three.",
    "Lord, mindfulness pertaining to the body\nWas thoroughly taught by the Sugata to be the only path.\nProtect it well through attentiveness.\nDeterioration of mindfulness will destroy the entire dharma.",
    "Life has many dangers. If it is no more permanent\nThan a bubble of water blown by the wind,\nWhy should exhalation follow inhalation,\nOr waking follow falling asleep? It is a great wonder.",
    "The body ends up as ashen, desiccated, putrefied,\nOr ultimately befouled. It is without essence.\nIt will completely decay, crumble or decompose.\nKnow that its nature is to disintegrate.",
    "The earth, Meru and the oceans will burn up\nIn an inferno of seven suns.\nIf not even the ashes will remain of these bodies,\nWhat need is there to say anything of very frail humans?",
    "Accordingly, all these are impermanent, devoid of self,\nWithout a refuge, without a protector and without a home.\nBecause of that, samsara is like the pithless plantain tree.\nExcellent one, take this to heart.",
    "It is much harder to attain a human body from an animal’s\nEven than it is for the hole of a yoke dwelling in one ocean\nTo be encountered by a turtle.\nLord of men, by practising the holy dharma, life will be made fruitful.",
    "One who, having obtained human birth, commits sins\nIs indeed far more foolish even than\nOne who clears up vomit\nUsing a jewel­adorned golden vessel.",
    "To live in a favourable place,\nTo associate with holy people,\nTo have good aspiration oneself and previous merits\nAre the four great wheels you possess.",
    "Since the Sage has taught that reliance on a spiritual friend\nCompletely perfects the brahmacharya,\nRely on holy beings. Through reliance on the conquerors,\nInnumerable ones obtained complete peace.",
    "A holder of wrong views, an animal,\nA preta, a hell being,\nWithout the Conqueror’s words, born in remote lands\nAs a primitive, or retarded,",
    "A long­lived god: any one of these\nIs called ‘rebirth’. Having parted from those\nEight disadvantages without opportunity, one has acquired opportunity.\nTherefore, make exertion in order to prevent rebirth.",
    "Gentle lord, samsara does not fulfil wishes\nAnd is the source of many sufferings\nSuch as death, sickness and ageing. Be saddened by it\nAnd listen to just some of its faults.",
    "Fathers become sons, mothers become wives\nEnemies become friends,\nAnd vice versa. Since that is so,\nThere are no certainties in samsara.",
    "Everyone has drunk more milk\nThan the four oceans. Nevertheless, a samsaric person\nWho follows ordinary beings\nWill have to consume still more.",
    "The heap of each person’s own bones\nIs equal to Mount Meru and surpasses it.\nIf one could count one’s mothers with beads the size of\nJuniper seeds, they would cover more space than the earth.",
    "Having been Indra, worthy of veneration by the world,\nOne will again fall down to the earth by the power of actions.\nHaving been a universal emperor,\nOne will become the servant of a servant in samsara.",
    "Having long enjoyed the pleasure of the feel\nOf the waists and breasts of heavenly girls,\nOne must return to the utterly unbearable feel\nOf the violent cutting and crushing machines in hell.",
    "Consider that having long dwelled at the summit of Mount Meru,\nWhich is pliant and delightfully receptive to the touch of one’s feet,\nSubsequently, one will be struck by the unbearable suffering\nOf traversing burning coals and rotten corpses.",
    "Accompanied by heavenly girls in higher realms and joyful,\nOne frolics in reaching completely beautiful groves.\nSubsequently, feet, hands, ears and nose will be severed\nHaving arrived at groves with leaves like blades.",
    "In gentle flows with golden lotuses,\nHaving accompanied heavenly girls with beautiful features,\nOnce again, in the Unfordable river of hell,\nOne will be plunged into the unbearable boiling salt waters.",
    "In the realm of the gods, having attained the very great bliss of desire\nOr the bliss free of craving as Brahma himself, again,\nThe incessant suffering of having become\nFuel for the fire of incessant torment will follow.",
    "Having illuminated the whole world\nWith the light of one’s own body that matched the sun and moon,\nOnce again one will arrive in a thick darkness\nWhere even one’s own outstretched arms cannot be seen.",
    "Accordingly, such faults indeed exist. Now there is merit;\nTake up the light of the threefold lamp,\nOr you will enter alone into an endless darkness\nWhich is untouched by the sun or moon.",
    "Sentient beings who commit negative actions\nWill experience suffering continuously in the hells\nOf reviving, black thread, intense heating,\nCrushing, screaming, incessant torment and so on.",
    "Some are pressed like sesame;\nSimilarly others are ground into fine powder.\nSome are sawn apart;\nLikewise others are split by the sharp blades of piercing axes.",
    "Likewise, others have blazing streams\nOf molten metal poured into them.\nSome are completely impaled\nOn searing metal spears with barbs.",
    "Some, overpowered by savage dogs\nWith iron fangs, thrust their arms towards the sky.\nOthers, powerless, are ripped apart by ravens\nWith agonizing claws and sharp iron beaks.",
    "Some, as they are bitten by many kinds of parasites and insects,\nAnd by ten thousand flesh flies, wasps and mosquitoes,\nUndergo many unbearable wounds\nAs they are eaten, and they writhe in lamentation.",
    "Some are continually ablaze in a mass\nOf burning embers and their mouths are agape.\nSome are thrust head first into\nGreat vats made of iron and cooked like balls of rice.",
    "Between sinners and the limitless sufferings of hell\nIs the time of just the inhalation and exhalation of a breath.\nHaving heard of these, who is not fearful\nIn one thousand ways? Someone as tough as a vajra.",
    "If seeing depictions, hearing,\nRecalling, reading and also fashioned images of the hells\nProduce fear, what can one say of the actual experience\nOf the unbearable full ripening?",
    "Just as among all happiness, the exhaustion of craving\nCreates the foremost happiness,\nSo among all sufferings,\nThe suffering of the incessant torment hell is the most unbearable.",
    "Here, who, in a single day, would suffer\nVery violent thrusts by three hundred lances?\nYet even the lesser sufferings of hell\nCannot be compared to that. They do not approach even a fraction.",
    "In that way, although extremely unbearable sufferings\nWill be experienced for a hundred million years,\nStill, for as long as the non­virtues have not been exhausted,\nThey cannot leave that life.",
    "The seeds of these fruitions of non­virtue\nAre the negative actions of body, speech and mind.\nHow can you be without even an atom of these?\nYou must energetically persevere in just that.",
    "Also, in the realm of animals, there are\nVarious sufferings such as being killed, tethered and struck.\nFor those who have abandoned true virtue which brings pacification\nEating one another is utterly unbearable.",
    "Some, in ignorance, will be killed\nFor the sake of their pearls, wool, bone, flesh or hide.\nPowerless, they are kicked by others, hit, whipped,\nPierced by iron hooks and bound into service.",
    "For pretas, the constant sufferings\nCreated by their impoverishment are unabated.\nThose created by hunger, thirst, cold, heat, weariness and fear\nMake their lives utterly unbearable.",
    "Some have mouths as small as the eye of a needle\nAnd stomachs the size of mountains. Tormented by hunger,\nThey do not have the ability\nTo find even a discarded string of filth.",
    "Some have bodies of bone and skin and are naked.\nThey are like the dried top of a palmyra.\nSome have flaming mouths by night, and\nAs food drops into their mouth of flames, they eat sand.",
    "Certain lower types cannot even acquire\nFilth such as pus, excrement or blood, so\nThey smash each other’s faces and take\nThe pus from the matured goitres on their necks.",
    "For them, in the summertime,\nEven the moon is hot and in winter, even the sun is cold.\nTrees will bear no fruit. By their\nJust looking upon them, even rivers will dry up.",
    "They will have unimpeded suffering.\nSome creatures who are firmly bound by\nThe leash of the karma of evil conduct\nWill not die for fifteen thousand years.",
    "That being so, why do the pretas\nReceive the one taste of manifold sufferings?\nIts cause is the avarice of people;\nMeanness is ignoble as the Buddha has said.",
    "In the higher states, although there is great bliss,\nThe sufferings of death and transmigration are greater.\nHaving considered this, superior people\nWill not crave for higher states which will be exhausted.",
    "The body’s hue becomes repulsive.\nOne is unhappy on one’s seat. The garlands of flowers wither.\nOne’s clothes become stained. On the body,\nPerspiration arises when previously it had not.",
    "These five portents, signifying the summons to die and transmigrate from higher states,\nArise for the gods who abide in their heavens.\nThey are similar to those indications signifying death\nWhen men on earth are summoned to die.",
    "For transmigrators from the worlds of the gods\nWhen there is no longer any remnant of virtue,\nThen, helpless, they will inhabit the animal, preta\nAnd hell realms, as appropriate.",
    "Also, in the asuras, because by nature\nThey hate the splendour of the gods, they have great suffering of mind.\nAlthough they have intelligence, by the\nObscurations of their kind, there is no opportunity for seeing the truth.",
    "Since samsara is like this, neither gods and men,\nNor hell beings, pretas and animals,\nAre good rebirths. Know that these rebirths\nWill be containers of much harm.",
    "Should head or clothes accidentally catch fire,\nEven while proceeding in extinguishing them,\nOne should strive towards not taking rebirth.\nThere is no necessity more pressing than that.",
    "Pure moral conduct, absorption and wisdom\nTranscend sorrow, pacify and discipline—a stainless\nState with no ageing, no death and no exhaustion.\nAttainment is devoid of earth, water, wind, sun and moon.",
    "Mindfulness, full discrimination of phenomena, perseverance,\nJoy, higher discipline, concentration\nAnd equanimity are the seven branches of enlightenment.\nThey accumulate virtues which bring the attainment of nirvana.",
    "Without wisdom, there is no concentration.\nYet without concentration, there is no wisdom.\nThose who have both of these\nRender the ocean of existence as a hoof­print.",
    "Fourteen indeterminates in the world\nWere taught by the Kinsman of the Sun.\nWhy are they not to be contemplated?\nThey do not pacify the mind.",
    "From unawareness come actions, from which\nComes consciousness, from which naming and form completely arise.\nFrom those come the six sense bases, from which\nContact fully arises, as the Sage has taught.",
    "From contact, feelings fully arise.\nOn the basis of feelings arises craving.\nFrom craving comes clinging,\nFrom which there is becoming, and from becoming there is birth.",
    "When there is birth, there is affliction, sickness, ageing,\nDeprivation, death, fear and so forth.\nThe extremely great heap of these sufferings will arise.\nThe cessation of birth will cease all of these.",
    "This arising of dependent origination, the precious and\nProfound treasure of the teachings of the Conqueror,\nWhoever perfectly sees it,\nSince he fathoms the reality of Buddha, he sees the supreme knowable.",
    "Perfect view, livelihood, effort,\nMindfulness, concentration, speech, action\nAnd perfect understanding are the eight branches of the path.\nCultivate these in order to bring about pacification.",
    "This birth is suffering; ‘craving’ and its agent\nAre the vast sources of that.\nCeasing these is indeed liberation.\nProceeding to attain that is indeed the eightfold noble path.",
    "Since that is indeed so, one must always endeavour\nIn order to see the Four Truths of a noble one.\nEven householders living in the lap of luxury\nWill cross over the river of the disturbing emotions by understanding.",
    "Those who directly perceived the dharma\nCertainly did not descend from the heavens.\nThey did not emerge from the earth like crops.\nThey were formerly ordinary people subject to disturbing emotions.",
    "Fearless one, you have made many requests.\nThese beneficial instructions have real meaning.\nYou must make tame your mind. The Bhagavan said\nThat mind is the root of the dharma.",
    "Why are these teachings for you,\nWhen even for monks in retreat, they are difficult to do?\nYet by relying on qualities of the essence of practising\nEven one of these, one’s life will have meaning.",
    "Having rejoiced in all the virtue of all and\nCompletely dedicated one’s own good conduct of the three kinds\nIn order to attain buddhahood itself,\nThen, by this heap of virtue,",
    "In innumerable births in the worlds of gods and men,\nYou will master all yogas\nAnd then care for many stricken beings\nBy acting with the power of the Noble Avalokitesvara.",
    "Having arisen, sickness and ageing, desire and hatred\nAre dispelled. In buddhafields, as a bhagavan,\nA protector of the world, like Amitabha,\nOne will have limitless life.",
    "Wisdom, moral discipline and giving will arise and great, stainless fame\nWill spread throughout the god realms, the sky and over the earth.\nThen, men on earth and gods in the heavens,\nOnly taking pleasure in the joys of the finest girls, will certainly be absolutely pacified.",
    "The fears of a multitude of sentient beings tormented by the disturbing emotions, birth\nAnd death will be pacified, and through having become a lord of conquerors,\nOne will attain a state which is transcendental,\nA mere designation, pacification, unafraid, ageless and faultless.",
    "This completes The Letter to a Friend, composed as a gift for a friend, King Gautamiputra, by the noble Acharya Nagarjuna."
  ],
  "captions": [
    "Title",
    "Homage",
    "Chapter 1, Verse 1",
    "Chapter 1, Verse 2",
    "Chapter 1, Verse 3",
    "Chapter 1, Verse 4",
    "Chapter 1, Verse 5",
    "Chapter 1, Verse 6",
    "Chapter 1, Verse 7",
    "Chapter 1, Verse 8",
    "Chapter 1, Verse 9",
    "Chapter 1, Verse 10",
    "Chapter 1, Verse 11",
    "Chapter 1, Verse 12",
    "Chapter 1, Verse 13",
    "Chapter 1, Verse 14",
    "Chapter 1, Verse 15",
    "Chapter 1, Verse 16",
    "Chapter 1, Verse 17",
    "Chapter 1, Verse 18",
    "Chapter 1, Verse 19",
    "Chapter 1, Verse 20",
    "Chapter 1, Verse 21",
    "Chapter 1, Verse 22",
    "Chapter 1, Verse 23",
    "Chapter 1, Verse 24",
    "Chapter 1, Verse 25",
    "Chapter 1, Verse 26",
    "Chapter 1, Verse 27",
    "Chapter 1, Verse 28",
    "Chapter 1, Verse 29",
    "Chapter 1, Verse 30",
    "Chapter 1, Verse 31",
    "Chapter 1, Verse 32",
    "Chapter 1, Verse 33",
    "Chapter 1, Verse 34",
    "Chapter 1, Verse 35",
    "Chapter 1, Verse 36",
    "Chapter 1, Verse 37",
    "Chapter 1, Verse 38",
    "Chapter 1, Verse 39",
    "Chapter 1, Verse 40",
    "Chapter 1, Verse 41",
    "Chapter 1, Verse 42",
    "Chapter 1, Verse 43",
    "Chapter 1, Verse 44",
    "Chapter 1, Verse 45",
    "Chapter 1, Verse 46",
    "Chapter 1, Verse 47",
    "Chapter 1, Verse 48",
    "Chapter 1, Verse 49",
    "Chapter 1, Verse 50",
    "Chapter 1, Verse 51",
    "Chapter 1, Verse 52",
    "Chapter 1, Verse 53",
    "Chapter 1, Verse 54",
    "Chapter 1, Verse 55",
    "Chapter 1, Verse 56",
    "Chapter 1, Verse 57",
    "Chapter 1, Verse 58",
    "Chapter 1, Verse 59",
    "Chapter 1, Verse 60",
    "Chapter 1, Verse 61",
    "Chapter 1, Verse 62",
    "Chapter 1, Verse 63",
    "Chapter 1, Verse 64",
    "Chapter 1, Verse 65",
    "Chapter 1, Verse 66",
    "Chapter 1, Verse 67",
    "Chapter 1, Verse 68",
    "Chapter 1, Verse 69",
    "Chapter 1, Verse 70",
    "Chapter 1, Verse 71",
    "Chapter 1, Verse 72",
    "Chapter 1, Verse 73",
    "Chapter 1, Verse 74",
    "Chapter 1, Verse 75",
    "Chapter 1, Verse 76",
    "Chapter 1, Verse 77",
    "Chapter 1, Verse 78",
    "Chapter 1, Verse 79",
    "Chapter 1, Verse 80",
    "Chapter 1, Verse 81",
    "Chapter 1, Verse 82",
    "Chapter 1, Verse 83",
    "Chapter 1, Verse 84",
    "Chapter 1, Verse 85",
    "Chapter 1, Verse 86",
    "Chapter 1, Verse 87",
    "Chapter 1, Verse 88",
    "Chapter 1, Verse 89",
    "Chapter 1, Verse 90",
    "Chapter 1, Verse 91",
    "Chapter 1, Verse 92",
    "Chapter 1, Verse 93",
    "Chapter 1, Verse 94",
    "Chapter 1, Verse 95",
    "Chapter 1, Verse 96",
    "Chapter 1, Verse 97",
    "Chapter 1, Verse 98",
    "Chapter 1, Verse 99",
    "Chapter 1, Verse 100",
    "Chapter 1, Verse 101",
    "Chapter 1, Verse 102",
    "Chapter 1, Verse 103",
    "Chapter 1, Verse 104",
    "Chapter 1, Verse 105",
    "Chapter 1, Verse 106",
    "Chapter 1, Verse 107",
    "Chapter 1, Verse 108",
    "Chapter 1, Verse 109",
    "Chapter 1, Verse 110",
    "Chapter 1, Verse 111",
    "Chapter 1, Verse 112",
    "Chapter 1, Verse 113",
    "Chapter 1, Verse 114",
    "Chapter 1, Verse 115",
    "Chapter 1, Verse 116",
    "Chapter 1, Verse 117",
    "Chapter 1, Verse 118",
    "Chapter 1, Verse 119",
    "Chapter 1, Verse 120",
    "Chapter 1, Verse 121",
    "Chapter 1, Verse 122",
    "Chapter 1, Verse 123",
    "Colophon"
  ],
  "refs": [
    "0.1",
    "0.2",
    "1.1",
    "1.2",
    "1.3",
    "1.4",
    "1.5",
    "1.6",
    "1.7",
    "1.8",
    "1.9",
    "1.10",
    "1.11",
    "1.12",
    "1.13",
    "1.14",
    "1.15",
    "1.16",
    "1.17",
    "1.18",
    "1.19",
    "1.20",
    "1.21",
    "1.22",
    "1.23",
    "1.24",
    "1.25",
    "1.26",
    "1.27",
    "1.28",
    "1.29",
    "1.30",
    "1.31",
    "1.32",
    "1.33",
    "1.34",
    "1.35",
    "1.36",
    "1.37",
    "1.38",
    "1.39",
    "1.40",
    "1.41",
    "1.42",
    "1.43",
    "1.44",
    "1.45",
    "1.46",
    "1.47",
    "1.48",
    "1.49",
    "1.50",
    "1.51",
    "1.52",
    "1.53",
    "1.54",
    "1.55",
    "1.56",
    "1.57",
    "1.58",
    "1.59",
    "1.60",
    "1.61",
    "1.62",
    "1.63",
    "1.64",
    "1.65",
    "1.66",
    "1.67",
    "1.68",
    "1.69",
    "1.70",
    "1.71",
    "1.72",
    "1.73",
    "1.74",
    "1.75",
    "1.76",
    "1.77",
    "1.78",
    "1.79",
    "1.80",
    "1.81",
    "1.82",
    "1.83",
    "1.84",
    "1.85",
    "1.86",
    "1.87",
    "1.88",
    "1.89",
    "1.90",
    "1.91",
    "1.92",
    "1.93",
    "1.94",
    "1.95",
    "1.96",
    "1.97",
    "1.98",
    "1.99",
    "1.100",
    "1.101",
    "1.102",
    "1.103",
    "1.104",
    "1.105",
    "1.106",
    "1.107",
    "1.108",
    "1.109",
    "1.110",
    "1.111",
    "1.112",
    "1.113",
    "1.114",
    "1.115",
    "1.116",
    "1.117",
    "1.118",
    "1.119",
    "1.120",
    "1.121",
    "1.122",
    "1.123",
    "1.124"
  ],
  "chapters": [
    {
      "number": 1,
      "title": "Friendly Letter",
      "startVerseIndex": 0,
      "endVerseIndex": 126
    }
  ]
}
