{
  "verses": [
    "To the Sugatas, the dharmakāya they have mastered, and their sons,\nAnd to all those worthy of prostration, I respectfully prostrate.\nHow to enter the vow of the Sugatas’ sons.\nIn accord with the tradition, I will now briefly explain.",
    "Nothing said here has not been said before,\nAnd I have neither eloquence nor erudition,\nSo, I do not expect this to benefit others.\nI composed it only to develop my own understanding.",
    "Because of developing virtue like this,\nThe power of my faith will increase for a little while.\nBut if others, similar in fortune to me,\nShould see it, that is also of benefit.",
    "It is extremely difficult to acquire the freedoms and endowments\nWhich make this human birth meaningful.\nIf I fail to benefit from it now,\nHow will I get a chance like this again?",
    "Just as lightning flashes for an instant\nThrough the dark, black clouds of the night,\nLikewise, only rarely, merit and intelligence arise\nFleetingly in the world through the power of the Buddhas.",
    "In this way, virtue is constantly weak and feeble,\nAnd the extremely great power of nonvirtue overwhelms.\nWhat virtue, if not perfect bodhicitta,\nCould possibly overcome it?",
    "The mighty sages, who have known it for many aeons,\nHave seen that only bodhicitta has this power.\nWith bodhicitta, limitless multitudes\nWill easily attain the supreme bliss.",
    "Those wishing to end the many sufferings of conditioned existence,\nThose wishing to dispel the unhappiness of beings,\nAnd those wishing for many happinesses,\nShould never abandon this bodhicitta.",
    "The very instant bodhicitta arises\nIn someone tormented in the prison of saṃsāra,\nThey will be called an ‘heir of the Sugatas’,\nAnd be praised by gods and men.",
    "Like a supreme alchemical elixir,\nHaving imbibed it, the impure body is transformed\nInto the priceless jewel of the kāya of a conqueror.\nSo, firmly take hold of what is called ‘bodhicitta’.",
    "If the only guides of beings have, with unfettered minds,\nSeen its value in consummate examination,\nThose of us who want to be free from wandering\nShould firmly grasp the precious bodhicitta.",
    "All other virtues are, like a plantain tree,\nExhausted after they produce their fruit,\nBut the perennial tree of bodhicitta\nGrows with an inexhaustible supply.",
    "Like facing great terrors accompanied by a warrior,\nEven those who have committed the extremely evil acts\nWill instantly be freed by relying on it.\nWhy then would conscientious people not rely on this?",
    "Like the fire at the end of time, great evils\nAre totally consumed by it.\nIts benefits are limitless,\nAs Lord Maitreya explained to Sudhana.",
    "When summarized, bodhicitta\nShould be known as having two types:\nBodhicitta of aspiration\nAnd bodhicitta of application.",
    "Like understanding the difference\nBetween wishing to go and going,\nSo the wise should understand the difference\nBetween these two, respectively.",
    "For those wandering in saṃsāra,\nGreat results arise from aspiration bodhicitta,\nBut a ceaseless stream of merits does not arise\nAs it does for application bodhicitta.",
    "For whoever embraces\nThis incontrovertible intent to liberate\nLimitless realms of beings,\nBy the perfect adoption of that intent,",
    "From the moment of embracing it, even when asleep\nOr distracted, a force of merit\nAs vast as space\nArises in an uninterrupted stream.",
    "The Tathāgata himself taught\nThese benefits along with their reasons\nIn the Sutra Requested by Subahu\nFor the sake of those inclined to lesser paths.",
    "Even if one wishes to dispel merely\nThe head pains of beings,\nThe possession of that beneficial intention\nIs endowed with boundless merit.",
    "What can one say then of the wish to dispel\nThe endless unhappiness of each sentient being,\nWishing to establish every single one of them\nIn limitless qualities?",
    "Do even our father or mothers\nEver have such a benevolent wish?\nDo even the gods, the rishis,\nOr even Brahmā harbour such benevolence?",
    "Those beings never before,\nEven in their dreams,\nHad an intention like this, even for their own sake.\nHow could it arise then for the sake of others?",
    "The intention to benefit others did not arise\nFor sentient beings even for their own sake.\nThe arising of this highest treasure of the mind\nIs an unprecedented wonder.",
    "It is the cause of joy in all wandering beings.\nIt is the elixir remedying the suffering of sentient beings.\nHow can the merit of this treasure of mind\nEven begin to be measured or quantified?",
    "If the mere intention to help others\nIs better than making offerings to the Buddhas,\nWhat can one say about the endeavour\nTo bring happiness and benefit to all beings without exception?",
    "Though they long to be free from suffering,\nThey hurriedly chase after suffering itself.\nThough they long for happiness, in their ignorance,\nThey destroy it as though their own happiness were their enemy.",
    "Whoever is destitute of happiness\nAnd burdened with many sufferings\nWill be filled with every happiness\nAnd cut off from all their suffering.",
    "Their ignorance, too, will be dispelled.\nWhat virtue could equal that?\nWhat friend can compare to it?\nWhat merit is remotely comparable to it?",
    "If one who repays a helpful deed\nIs worthy of some praise,\nWhat can one say of the bodhisattva\nWhose excellent deeds are unsolicited?",
    "Worldly people respect someone who briefly\nGives a little food, contemptuously,\nTo a few beings, satisfying them only for half a day,\nSaying, ‘That was a virtuous deed.’",
    "What can one say then of someone who\nAlways gives the unsurpassed happiness\nOf the Sugatas to countless sentient beings throughout time,\nThe ultimate perfection of their wishes?",
    "If one should develop a malevolent intention\nTowards such beneficent sons of the conquerors,\nThe Sage has taught they will remain in the hells\nFor as many aeons as malevolent thoughts developed.",
    "Nevertheless, if one’s attitude is good,\nThe results will be even greater.\nThe sons of the conquerors, with great seriousness,\nNever perform nonvirtue and their virtues continuously increase.",
    "I bow down before\nThose in whom this sacred jewel of mind is born,\nAnd I take refuge in those sources of happiness\nWho bring happiness even to those who harm them.",
    "In order to take hold of this treasure of mind,\nI make offerings properly to the oceans of good qualities—\nThe stainless jewels of the Tathāgata, the holy dharma,\nAnd the sons of the Buddhas.",
    "I offer every flower and fruit there is,\nEvery kind of restorative,\nAll the wealth in the world,\nAnd all the clear, refreshing waters.",
    "Likewise, I offer bejewelled mountains,\nSecluded and delightful forest groves,\nTrees of paradise rich with blossoming flowers,\nMany trees with branches laden with excellent fruit,",
    "The beautiful fragrances of gods and men,\nAll incense, wish granting trees and bejewelled trees,\nAll kinds of crops, cultivated without effort,\nAnd everything else worthy of offering, all ornamented with",
    "Lakes and pools adorned with lotus flowers,\nMellifluous with the song of wild geese,\nIn the endlessness of space and in innumerable worlds,\nAll completely unowned.",
    "Thinking of these, I offer them properly\nTo the sages, supreme among men, and their sons.\nHoly recipients, out of your compassion,\nPlease accept my offerings and think of me with kindness.",
    "I am without merit and completely destitute;\nI have no other wealth to give.\nTherefore, protectors, you who think only of the benefit of others,\nPlease accept these for my benefit.",
    "To the conquerors and their sons, I offer\nAll my bodies. Sublime beings,\nPlease always accept them,\nAnd I will be your devoted servant.",
    "When I am under your protection,\nI will fearlessly bring benefit to sentient beings in conditioned existence.\nI will completely overcome my former nonvirtues\nAnd henceforth cease all other nonvirtues.",
    "In freshly scented bathing houses,\nWith crystal floors, clear and bright,\nAnd columns shimmering with jewels,\nDecorated with canopies alight with pearls,",
    "To the Tathāgatas and their sons\nWith many precious vases, filled with\nScented water that delights the senses, and with many songs\nAnd music, I request to bathe the Buddhas’ forms.",
    "I then wipe dry their bodies with the finest cloths,\nFresh and fragranced with scents.\nTo the holy ones I offer\nFragrant robes of appropriate colours.",
    "With all kinds of excellent garments, soft and fine,\nAnd an array of supreme ornaments, I adorn\nĀrya Samantabhadra, Mañjughoṣa,\nAvalokiteśvara and the others.",
    "With supreme scents that permeate\nThe three thousand-fold world system, I anoint\nThe bodies of the lords of sages, blazing with light,\nLike polishing pure, burnished gold.",
    "To the supreme objects of worship, the lords of sages, I offer\nDelightful flowers such as mandaras, lotuses\nAnd utpalas, all sweet-smelling and\nWonderfully laid out in garlands,",
    "And I offer clouds of permeating incense, enchanting to the mind,\nFrom the finest incense sticks,\nAnd I offer many kinds of\nAmbrosial foods and drinks.",
    "I offer jewelled lamps, arranged upon\nRows of golden lotus flowers.\nTheir grounds fragrant with the perfume\nOf flower petals scattered upon it,",
    "I offer vast palaces, resonant with pleasing songs of praise,\nBright and resplendent with hanging ornaments of pearls and jewels,\nOrnamenting the vastnesses of space,\nTo those who have the nature of compassion.",
    "I offer to the lords of sages\nBeautiful jewelled parasols with golden handles,\nDecorated with handsome designs and\nHeld aloft in arrangements joyful to behold,",
    "And a multitude of other offerings,\nWith music delightful to hear.\nI present billowing clouds of offerings\nTo soothe the sufferings of sentient beings.",
    "May an uninterrupted rain\nOf flowers and precious gems descend\nUpon all the jewels of holy dharma,\nThe stupas and statues.",
    "Just as Mañjughoṣa and others\nMade offerings to the conquerors,\nLikewise I make offerings\nTo the Tathāgatas and their sons.",
    "I praise these oceans of good qualities\nWith oceans of melodious praise.\nMay these pleasing clouds of melodious praise\nAlways ascend to their ears.",
    "To the Buddhas of the three times,\nTo the dharma, and to the supreme among communities,\nWith bodies as numerous as atoms\nI respectfully prostrate.",
    "I prostrate to the bases of bodhicitta,\nAnd to the stupas,\nAnd I prostrate to preceptors, ācāryas,\nAnd the supreme practitioners.",
    "Until the essence of enlightenment,\nI take refuge in the Buddha,\nAnd likewise in the dharma\nAnd the assembly of bodhisattvas.",
    "To the perfect Buddhas and bodhisattvas\nWho dwell in all directions,\nAnd who possess great compassion,\nI supplicate you with joined palms.",
    "Having wandered without beginning\nIn this life and in others,\nI stupidly performed nonvirtues,\nOr commanded them to be done.",
    "Compelled by ignorance and delusion,\nI took pleasure in this.\nNow seeing this was a terrible mistake,\nI sincerely confess it to the protectors.",
    "Whatever harm I have done towards\nThe Three Jewels, my parents, my teachers and others,\nBased on the defilements,\nAnd whatever nonvirtues I, burdened with nonvirtue",
    "And afflicted with many faults, have done\nWith my body, speech or mind,\nThese deeds, now utterly unbearable to me,\nI confess before the guides of the world.",
    "I will die before\nMy nonvirtues have been purified.\nSo that I may be saved from them,\nI pray for your protection to come swiftly.",
    "The untrustworthy Lord of Death\nWill not wait for me to be ready.\nRegardless of whether I am sick or healthy,\nThis fleeting life is unstable.",
    "Everything must be left behind and I must go, too.\nYet, without understanding this,\nBecause of friends and foes,\nI have carried out all kinds of nonvirtue.",
    "My foes will become nothing.\nMy friends will become nothing.\nI, too, will become nothing.\nIn this way, all of us will become nothing.",
    "Like experiences in dreams,\nWe get involved with this and that,\nBut these will become only memories,\nFor whatever has passed will never be seen again.",
    "In the short time of this life,\nMany friends and foes have already passed,\nBut whatever unbearable nonvirtues\nI carried out because of them still await me.",
    "Not even understanding\nThat I, too, am just as temporary as they were,\nOut of ignorance, desire and hatred,\nI have done many nonvirtues.",
    "If, without respite, day and night,\nThis life is running out,\nAnd there is no granting of an extension,\nWhy would death not come for someone like me?",
    "Lying on my death bed,\nThough surrounded by all my friends and family,\nThe sensations of life ending\nWill be experienced by me alone.",
    "When seized by the messengers of the Lord of Death,\nWhat good is family, what good are friends?\nMerit alone will protect me then,\nBut I have never really relied on it.",
    "Oh protectors—I was unconcerned and,\nNot realizing this would be so terrifying,\nI carried out many nonvirtues\nFor the sake of this impermanent life.",
    "Even now, when someone is told\nThey are to be taken to a torture chamber, they are terrified.\nTheir appearance quickly changes:\nTheir mouth becomes dry, their eyes bulge and so on.",
    "What need to mention the utter despair\nOf being in the grasp of the terrifying\nMessengers of the Lord of Death,\nAnd being sick with terror.",
    "‘Can anyone protect me\nFrom such a great horror?’\nWith gaping eyes and a terrified aspect,\nI will search in the four directions for a refuge,",
    "But not seeing any refuge in the four directions,\nI will be enveloped in despair.\nThen, when I have no refuge,\nWhat am I going to do?",
    "Therefore, to the conquerors, the protectors,\nWho strive in their purpose of protecting beings,\nAnd whose great power dispels all fears,\nI go for refuge from this day forth.",
    "In the dharma taken to heart,\nWhich dispels fear of saṃsāra,\nAnd in the assembly of bodhisattvas,\nI likewise completely take refuge.",
    "Overwhelmed by fear,\nI offer myself to Samantabhadra.\nTo Mañjughoṣa\nI make an offering of my own body.",
    "To the protector Avalokiteśvara\nWho unerringly acts out of compassion,\nI call out with a desperate cry,\nBegging him to protect me, someone so burdened with nonvirtue.",
    "To Ārya Ākāśagarbha\nAnd to Kṣitigarbha, too,\nAnd to all the lords of great compassion,\nSeeking refuge, I cry out for their help.",
    "To Vajrapāṇi, the sight of whom\nMakes malevolent beings, like the messengers\nOf the Lord of Death, scatter to the four directions,\nI go for refuge.",
    "In the past, I defied your advice but,\nNow, seeing such great horrors,\nI pray that they will be dispelled\nBy my truly going for refuge to you.",
    "If I need to follow the doctor’s advice\nOut of fear of just a common illness,\nWhat can be said of being constantly sick\nWith the hundred faults of desire and so forth.",
    "If any one of these\nCan destroy everyone in the world,\nAnd if no other cure for them\nIs anywhere to be found,",
    "Then the attitude of disregarding\nThe instructions of the omniscient physician,\nWhich remediate all these maladies,\nIs extremely stupid and contemptible.",
    "If I need to be careful\nNear an ordinary, shallow ridge,\nWhat can be said of this abyss\nWhich plummets for a thousand miles?",
    "‘Surely I won’t die today!’\nIt is hardly appropriate to be so casual,\nWhen the time of my end\nWill inevitably come.",
    "What can take away this horror?\nWhat can I do to be free from it?\nIf the end is inevitable,\nHow can I be relaxed and content?",
    "The past was experienced and now it is gone.\nWhat is left of that for me now?\nThrough my attachment to it,\nI defied the instructions of the teacher.",
    "If I must leave behind this life\nAnd all its friends and acquaintances,\nGoing on alone to who knows where,\nHow can these friends and enemies matter?",
    "‘Suffering comes from nonvirtue.\nHow can I be definitively freed from that?’\nDay and night, I should constantly consider\nNothing but this very thought.",
    "Insensibly and ignorantly,\nWhatever nonvirtues, whether inherent\nOr attendant, that I have done,",
    "In the presence of the protectors,\nWith palms joined and desperately aware of the suffering,\nAgain and again I prostrate\nAnd confess all of these acts.",
    "Guides of the world, please look upon\nMy mistakes and nonvirtues.\nThey lack any goodness at all.\nFrom now on, I will not do them anymore.",
    "In the virtue which alleviates the sufferings\nOf all beings in the lower realms,\nAnd places those who are suffering in happiness,\nI gladly rejoice.",
    "In the gathering of virtue\nWhich causes enlightenment, I rejoice.\nIn the complete liberation\nFrom the suffering of saṃsāric birth, I rejoice.",
    "In the enlightenment of the protectors\nAnd their sons’ attainment of the bhūmis, I rejoice.",
    "In the ocean of virtue in generating the resolution\nTo bring happiness to all sentient beings,\nAnd in the virtuous deeds for the benefit\nOf sentient beings, I rejoice.",
    "Folding my hands, I implore\nThe Buddhas in all directions:\nPlease shine the light of dharma\nFor sentient beings suffering in darkness.",
    "Folding my hands, I implore\nThe conquerors who wish to pass beyond torment:\nPlease do not leave these creatures to their blindness\nBut stay here for countless aeons.",
    "Having done all this,\nWhatever I may have gathered by this virtue,\nMay it eliminate all the sufferings\nOf all sentient beings.",
    "Whatever sicknesses beings may have,\nUntil they are all cured,\nMay I be their medicine, their doctor,\nAnd may I nurse them back to health.",
    "May deluges of food and drink\nEliminate the sufferings of hunger and thirst\nAnd, during ages of famine,\nMay I become food and drink.",
    "May I become an inexhaustible supply of riches\nFor beings in deprivation and poverty,\nAnd may I be right there in their presence,\nAs all kinds of provisions and necessities.",
    "In order to bring benefit to all beings,\nI will, without any hesitation, give up\nMy body, its pleasures,\nAnd all my merits of the past, present and future.",
    "Nirvāṇa is attained by giving everything up.\nNirvāṇa is my goal,\nAnd to give everything at once\nTo sentient beings is the supreme giving.",
    "Since I have now given my body to embodied beings\nFor whatever end may make them happy,\nLet them do with it whatever they like—\nEven killing, insulting or beating it.",
    "Though they may treat my body as worthless,\nOr make it a source of ridicule or mockery,\nSince I have now given it to them,\nWhat is the point of cherishing it?",
    "I will put up with anything they might do to it,\nAs long as it will not cause them harm.\nWhenever someone sees me,\nMay it not be without benefit.",
    "Having seen me, regardless of whether they develop\nAn angry or a respectful attitude,\nMay that always become a cause\nOf fulfilling the benefit of all.",
    "Whoever may disparage me,\nOr harm me in other ways,\nHowever they may insult me,\nMay they all come to have the good fortune of enlightenment.",
    "May I be a protector for the unprotected,\nA guide for travellers on the road\nAnd, for those who want to cross the water,\nMay I be a boat, a ship or a bridge.",
    "May I be land for those who seek dry land,\nA light for those who lack light,\nA lodging for those who want lodging\nAnd, for those who want a servant,\nMay I be the servant of them all.",
    "May I be the wishing jewel, the wondrous vase,\nThe vidya-mantra, the great medicine,\nThe inconceivable tree of wishes,\nAnd the cow of plenty, fulfilling the hopes of beings.",
    "Like the great elements—earth and so forth—\nAnd, like space itself, remaining without end,\nMay I be the ground which supports\nThe countless lives of sentient beings.",
    "Similarly, in all places where sentient beings\nDwell throughout the limits of space,\nMay I be a cause of sustaining life\nUntil they have all passed beyond suffering.",
    "Just as the Sugatas of the past\nGenerated bodhicitta,\nAnd gradually practised\nThe bodhisattva trainings,",
    "Likewise for the benefit of beings,\nI now generate bodhicitta,\nAnd likewise I, too,\nWill gradually practise the trainings.",
    "Accordingly, those who with intelligence\nHave lucidly taken hold of bodhicitta,\nIn order to increase it,\nShould praise the mind with these words:",
    "Now, my life is fruitful.\nI have properly attained human existence.\nToday, born into the family of the Buddhas,\nI have become a Buddha’s child.",
    "Whatever I undertake to do, my actions\nWill be consistent with this lineage.\nNothing I do will corrupt\nThis faultless, noble lineage.",
    "Like a blind man finding\nA gem in a pile of rubbish,\nSomehow this bodhicitta\nHas arisen in me.",
    "This is the supreme elixir of life,\nVanquishing death’s sovereignty over the world.\nIt is an inexhaustible treasure,\nDispelling beings’ sufferings.",
    "It is the supreme remedy,\nRelieving the sicknesses of beings.\nIt is a tree to rest under for all beings\nWho are wandering and exhausted on saṃsāric paths.",
    "It is an open bridge, leading them\nOver bad rebirths to freedom.\nIt is the shining moon of mind\nWhich dispels the misery of beings’ defilements.",
    "It is the great sun which brings an end\nTo the gloom of beings’ ignorance.\nIt is the fresh butter extracted\nFrom churning the milk of the holy dharma.",
    "Beings wandering abroad on the paths of conditioned existence,\nWishing to have happiness,\nWill encounter this supreme happiness,\nAnd those great wanderers will at last be contented.",
    "Today, in the presence of all the protectors,\nUntil they have attained buddhahood itself,\nI invite beings to every happiness.\nMay the gods, demigods and all the rest be joyful.",
    "Having firmly grasped bodhicitta\nIn this way, a conqueror’s son\nShould never neglect it,\nBut instead strive never to violate the training.",
    "Whatever I have undertaken rashly\nOr not properly thought through,\nEven if I have promised to do it,\nI should reconsider, asking myself, ‘Should I stop?’",
    "The Buddhas and their sons\nExamine things with their great wisdom,\nAnd even I can examine them,\nSo why would I hesitate in doing so?",
    "Having made this commitment,\nIf I do not act to fulfil it,\nThen, since I will have deceived all sentient beings,\nWhat kind of rebirth will I take?",
    "If it is taught that someone who intended to give\nSome meagre, unremarkable thing,\nBut then did not do so,\nWill be reborn as a hungry ghost,",
    "Then, having sincerely intended to bring them\nTo unsurpassed bliss,\nIf I then deceive all sentient beings,\nTo what sort of happy rebirth shall I proceed?",
    "To give up bodhicitta\nBut still be liberated;\nSuch a thing is inconceivable.\nOnly the Omniscient One could comprehend it.",
    "This is the most serious of downfalls\nFor a bodhisattva,\nFor, if should it occur,\nThe benefit of all beings is discarded.",
    "Should someone even for a moment\nInterrupt or prevent this merit,\nSince the benefit of beings is diminished,\nNothing can stop him going to the lower realms.",
    "If destroying the happiness of even one sentient being\nWill harm me,\nWhat need to mention destroying\nThe happiness of all beings, as vast as space?",
    "Thus, when vacillating in saṃsāra,\nSometimes with the power of downfalls,\nSometimes with the power of bodhicitta,\nThe attainment of the bhūmis will be obstructed for a long time.",
    "Therefore, with dedication I should fulfil\nThe promise I have made.\nIf I do not persevere from now on,\nI will descend to lower and lower rebirths.",
    "Although there have been innumerable Buddhas\nWho worked for the benefit of all beings,\nMy own faults excluded me\nFrom their restorative reach.",
    "Moreover, if I continue in this way,\nAgain and again it will end the same way:\nDiseased and fettered in the lower realms,\nShattered and cut apart.",
    "The arising of a Tathāgata,\nFaith, obtaining a human birth\nAnd the conditions for cultivating virtue\nAre very rare. When will they be attained again?",
    "Today, at least, I am not sick.\nI have food to eat and am not afflicted.\nBut this life is fleeting and deceptive,\nAnd this body is on loan only for a little while.",
    "My conduct being the way it is,\nI will not attain a human body again\nAnd, if I do not attain a human body,\nThere will be only nonvirtue and no virtue.",
    "Even when I do have the chance to practise virtue,\nIf I fail to do so,\nWhat will I do when I am\nCompletely obscured by the sufferings of the lower realms?",
    "Not practising any virtues,\nBut gathering many nonvirtues,\nFor hundreds of millions of aeons\nI will not even hear the words ‘happy rebirth’.",
    "It is because of this the Bhagavān said\nThat the difficulty of attaining a human birth\nIs like a turtle putting its neck through\nA wooden yoke adrift on a great ocean.",
    "If just a moment of nonvirtue\nCan lead to an aeon in the Avīci Hell,\nWhat need to mention my not proceeding to a happy rebirth,\nWith nonvirtues collected since beginningless time in saṃsāra?",
    "Even after having suffered such experiences,\nI still won’t be free of them,\nFor, even while undergoing them,\nI will commit yet more nonvirtue.",
    "Having acquired this kind of freedom,\nIf I do not cultivate virtue,\nThere could be no greater deception,\nAnd no greater delusion.",
    "So, having understood this,\nIf later in confusion I stop trying,\nThen the hour of my approaching death\nWill stir up extreme distress.",
    "When my body is burning\nFor a long time in the torturous fires of hell,\nWithout doubt, my mind will be further tormented\nBy the unbearable fire of remorse.",
    "Having somehow attained this beneficial state,\nExtremely difficult to find,\nWhile I have this understanding,\nIf still I am led back to the hells,",
    "Like someone manipulated by mantras,\nI must have lost my mind.\nI don’t even know who is manipulating me.\nWho is this inside of me?",
    "Enemies such as hatred and craving,\nDon’t have hands or feet,\nAren’t courageous or intelligent,\nAnd yet I act like their slave.",
    "While they remain in my mind\nThey can harm me whenever they want\nAnd I patiently accept it without any resentment,\nBut this is not a situation that warrants patience.",
    "Even if all the gods and demigods\nStood against me as enemies,\nThey could not lead me into the fires\nOf the Avīci Hell, or send me there.",
    "But these enemies, the mighty defilements,\nCan put me there in an instant,\nWhere Mount Meru and even its very ashes\nAre consumed on contact.",
    "What enemy is so interminable,\nWithout beginning or end, as my own defilements?\nNo other enemy\nEndures as long as they do.",
    "When treated well and respected,\nEnemies are cooperative and content\nBut, when the defilements are respected,\nThey return only pain and suffering.",
    "Accordingly, these being my old, implacable enemies,\nThe sole cause of vastly increasing all kinds of harm,\nIf I make room for them in my heart,\nHow can I be unafraid or enjoy saṃsāra?",
    "They are the prison guards of saṃsāra who,\nIn the hells and elsewhere, become my killers and executioners.\nSo, if they remain in my mind, abiding in the web of attachment,\nHow can I be happy?",
    "Therefore, as long I have not with certainty\nVanquished this enemy, I will never stop persevering.\nGrowing angry upon some slight, fleeting injury,\nThe proud and haughty will not sleep until their enemy has been vanquished.",
    "On the battlefield, they are eager to vanquish\nPeople with defilements, who would suffer an ordinary death anyway.\nDisregarding the pain of being pierced by arrows or swords,\nThey will not retreat until their objective is won.",
    "So, what need to mention that I should not be discouraged or frustrated\nTo be caused even one hundred thousand sufferings,\nWhen striving to finally vanquish my true, natural enemies,\nWho cause all my endless suffering?",
    "If scars inflicted by meaningless enemies\nCan be shown off on the body like trophies,\nWhat trouble is suffering to me,\nWhen I am striving to achieve a great benefit?",
    "If even fishermen, butchers, farmers, etc.\nThinking only of their livelihoods,\nPut up with the discomforts of heat and cold,\nWhy have I no patience for the sake of beings’ happiness?",
    "To liberate from the defilements\nBeings of the ten directions, as far as the ends of space,\nWas my promise but, when I made it,\nI was not free from defilements myself.",
    "Not understanding my own limitations,\nI spoke without knowing how insane this was.\nBut now I should never turn back from\nVanquishing the defilements.",
    "I will be fixated on this,\nAnd full of resentment, wage war\nAgainst the defilements, except those\nWhich destroy the other defilements.",
    "It would be better to be burned alive\nOr decapitated\nThan to be constantly grovelling\nTo the enemy defilements.",
    "Though ordinary enemies may be driven from our homelands,\nThey resettle elsewhere,\nAnd return when they have recovered their power,\nBut the nature of the enemy defilements is not like this.",
    "These pathetic defilements, cast out by the eye of wisdom\nAnd extirpated from my mind, where can they go?\nWhere can they resettle to hurt me again?\nAnd yet, weak-willed, I give up without even trying.",
    "The defilements are not within objects, nor within the senses,\nNor in anything else, yet, wherever they are, they harm all beings.\nThey are like illusions. So, giving up this heartfelt fear, I will cultivate the perseverance to achieve wisdom.\nWhy should I be tormented in places like the hells for no reason?",
    "Having considered this, I will strive\nTo fulfil the training as it has been explained.\nIf he doesn’t listen to the doctor’s instructions,\nHow can the patient be cured by the medicine?",
    "Those who want to guard the training\nMust always carefully guard their minds.\nIf one fails to guard the mind,\nIt is impossible to guard the training.",
    "While the rampaging elephant of mind\nCreates the ravages of the Avīci Hell,\nAn actual wild and untamed elephant\nCannot cause anything like that destruction.",
    "When the rope of constant mindfulness\nRestrains the elephant of mind,\nAll troubles subside,\nAnd all virtues fall into my hands.",
    "Tigers, lions, elephants, bears,\nSnakes, every kind of enemy,\nThe prison guards of the hells,\nDemons and ogres,",
    "Will all be restrained\nBy restraining mind alone,\nAnd will all be subjugated\nBy subjugating mind alone.",
    "In this way, the teacher of perfect truth himself said\nThat all dangers,\nAnd all the infinite sufferings\nArise from mind.",
    "Did anyone deliberately make\nThe weapons of the hell-beings?\nWho made the molten iron ground?\nWhere did these hosts of women come from?",
    "The Sage has taught that all these things\nCome from a nonvirtuous mind.\nThus, in the three realms,\nThere is nothing to fear apart from mind.",
    "‘If the perfection of giving\nMeans dispelling the poverty of beings,\nHow did the earlier protectors perfect it,\nWhen beings are still poor?’",
    "It is taught that the perfection of giving\nIs the intention to give to all beings\nAll of one’s possessions, along with the results of doing so.\nIn that sense, it is mind itself.",
    "‘Where has the killing of fish\nAnd other creatures been eradicated?’\nThe Sage has taught that the intention to abandon this\nIs the perfection of moral conduct.",
    "Unpleasant beings are as vast as space;\nDefeating them would take forever.\nBut if I overcome this one angry mind,\nIt would be like defeating all enemies.",
    "If I were to cover all the land with leather,\nHow much leather would it take?\nBut if I just put leather on my shoes,\nIt is as if the whole world is covered.",
    "Likewise I can never force\nAll external things to change their course.\nBut if I could turn around just this mind of mine,\nWhat need would there be to change anything else?",
    "While simply cultivating a clear mind\nResults in rebirth in realms like that of Brahmā,\nNot even a great many acts of body and mind,\nBeing of lesser modes of conduct, can result in this.",
    "All recitations and austerities,\nEven if performed extensively,\nAre useless, so the Omniscient One has taught,\nIf practised with a wavering mind.",
    "Those who do not understand the secret of mind,\nThe supreme lord of dharmas,\nMay wish to have happiness and end their suffering,\nBut their wishes are futile and they will wander in vain.",
    "Therefore, my mind\nShould be skilfully held and guarded.\nWithout the discipline of guarding the mind,\nWhat is the point of many other disciplines?",
    "Like being careful to protect a wound\nIn the midst of a jostling crowd,\nSo I will constantly guard this wound of a mind\nIn the midst of bad people.",
    "If, frightened of a little pain,\nI am careful of a wound,\nWhy do I not protect the wound of mind\nOut of fear of the Crushing Hell?",
    "If he can keep to this conduct,\nThen whether among bad people\nOr a group of women,\nThe vow-holder’s stability will not be impaired.",
    "It is better to have no money, no respect,\nAnd no bodily subsistence,\nAnd better even for every other virtue to degenerate,\nThan for the mind for degenerate.",
    "To those of you who want to guard your mind,\nI implore you, with folded hands:\nProtect mindfulness and clear comprehension\nWith all your might!",
    "People disturbed by sickness\nHave no strength to do anything.\nSimilarly, those disturbed by defilements\nAlso have no strength to do anything.",
    "Someone whose mind lacks clear comprehension\nMay hear, reflect and meditate,\nBut he will not keep it in his memory.\nIt will leak like water from a vase.",
    "Many who had learning, faith,\nAnd dedicated enthusiasm,\nBy the fault of losing clear comprehension,\nBecame embroiled in downfalls.",
    "The thieves who want to steal my clear comprehension\nWill show up after my loss of mindfulness.\nThen, after they have stolen my merit,\nI will go to the lower realms.",
    "This band of robbers, the defilements,\nAre waiting for a good opportunity.\nWhen they find it, they will steal all my virtues\nAnd destroy the life of a good rebirth.",
    "Consequently, I should never let mindfulness stray\nPast the gateway of mind.\nIf it ever leaves, remembering the horrors\nOf the lower realms, I must get it back.",
    "Through associating with teachers\nAnd attending abbots\nWith fear, fortunate ones who have respect\nEasily develop mindfulness.",
    "At all times I am in the presence of\nAll the Buddhas and bodhisattvas\nWhose vision is completely\nWithout obstruction.",
    "With this in mind, I should have\nShame, respect and fear.\nIt will also remind me\nAgain and again of the Buddha.",
    "When mindfulness stays,\nGuarding the gateway of mind,\nClear comprehension will come.\nThen, even if it is lost, it will return.",
    "At the outset, having found a mind like this\nWith some fault,\nAt that time, like a block of wood,\nI should remain undiverted.",
    "I should never look all around\nDistractedly for no reason,\nBut rather, with a resolute mind,\nLook with eyes lowered.",
    "In order to relax my gaze,\nI can from time to time look in some direction\nAnd, if someone appears in my field of vision,\nI should look up and greet them.",
    "In order to identify dangers on the road, etc.\nI can repeatedly survey the area.\nPausing and having looked ahead,\nI should then look behind.",
    "Having checked both ahead and behind,\nI can continue on or turn back.\nSimilarly, in all circumstances,\nI should proceed after understanding whatever is appropriate.",
    "Having prepared for some activity with the thought,\n‘I will maintain such and such a posture’,\nI should occasionally check to see\nIf I am remaining as intended.",
    "Tying the crazed elephant of mind\nTo the great pillar of contemplating the dharma,\nI will always make an effort to check\nIt has not escaped.",
    "Whoever perseveres in this samādhi\nWill not lose control even for a moment.\n‘Where is this mind of mine going?’\nIn this way, I will acutely scrutinize my mind.",
    "If, due to some danger or celebration,\nThis is not possible, I can relax.\nIt is taught in this regard that\nAt times of giving, moral conduct can be overlooked.",
    "Whatever I have intended to do, I should undertake it\nAnd not change my mind about it.\nWith my mind committed like this,\nIt will be accomplished in due course.",
    "I will carry out everything to completion in this way,\nOr nothing else will get done either.\nI will not lose clear comprehension\nNor increase the secondary defilements because of this.",
    "When I come across\nThe various kinds of senseless chatter\nAnd the many impressive entertainments,\nI should abandon my attachment to them.",
    "When I meaninglessly gouge at the earth,\nPick at the grass or draw lines on the ground,\nThen, remembering the Tathāgata’s training,\nI will concernedly stop right away.",
    "When I think of moving or\nWhen I think of speaking,\nHaving first examined my mind,\nI should, with deliberateness, act appropriately.",
    "When my mind is desirous or angry\nAnd I want to react, at that time,\nI should not react and should not say anything.\nRather, I should remain like a block of wood.",
    "When my attitude is irritated or derisive,\nProud, vain, cutting,\nCruel or deceptive,",
    "When I am seeking praise\nOr criticizing someone,\nInsulting them or picking a fight,\nAt such times, I should remain like a block of wood.",
    "When I want to profit, be respected and recognized,\nWhen I want to have subordinates,\nOr when I think I should be attended to—\nAt such times, I should remain like a block of wood.",
    "When I want to give up benefitting others\nTo pursue my own benefit,\nOr when I am about to speak out,\nThen I should remain like a block of wood.",
    "When I am about to be impatient,\nLazy, afraid, rude, stupid,\nOr preferential to my own side,\nThat is when I should remain like a block of wood.",
    "Examining the mind in this way for defilements\nAnd meaningless aims,\nThe heroic one should hold the mind firmly\nWith the antidotes.",
    "Fully resolved, with proper faith,\nSteadfast, respectful, polite,\nWith care and apprehension, and with calmness,\nI will strive for the happiness of others.",
    "Undiscouraged by the inclinations\nOf bickering, childish people,\nI will think kindly that they are like this\nBecause of the defilements arising in their minds.",
    "Without propagating misdeeds,\nWhether acting for myself or sentient beings,\nI will always keep this attitude,\nActing selflessly, like an apparition.",
    "Thinking again and again\nThat finally I have attained this supreme freedom,\nI will hold on to this mind and it will stray\nNo more than the king of mountains.",
    "Though vultures, wanting flesh,\nWill fight to tear it apart,\nThat does not bother you, mind.\nSo why cherish it so much now?",
    "Having taken this body as ‘mine’,\nWhy, mind, are you so protective of it?\nFor if it is really separate from you,\nWhat good is it to you anyway?",
    "Why, my defiled mind,\nDon’t you instead take a nice, clean block of wood?\nWouldn’t that be better than trying to look after\nThis contraption, which is a pile of filth, falling apart?",
    "First of all, in my mind,\nI distinguish the layers of skin.\nThen, with the scalpel of discrimination,\nI separate the flesh from the skeleton.",
    "Having analysed the bones as well,\nUntil I see their very marrow,\nI look and ask myself,\n‘Where is the essence in this?’",
    "If, in such a determined search,\nI can see no essence,\nWhy go on protecting\nThis body with such attachment?",
    "If you cannot eat this impure body,\nNor drink its blood,\nNor chew on its offal,\nWhat actual use is it to you?",
    "On the other hand, it is alright to look after it\nSo that the jackals and vultures have something to eat.\nThese human bodies of ours\nShould be used only in service.",
    "In this way, even if you do look after it,\nWhen the unsentimental Lord of Death\nSeizes it and gives it to the birds and dogs,\nWhat will you do then?",
    "If you don’t give clothes, etc.\nTo servants who will not work for them,\nWhy do you reward this body,\nWhich you are going to lose no matter what you feed it?",
    "I have already paid the body its wages,\nSo now it must start working for me.\nIf it is of no use,\nIt should not be given anything.",
    "On account of its coming and going,\nI will think of the body as a boat.\nIn order to accomplish the benefit of beings,\nI will transform it into a wish fulfilling body.",
    "While there is the freedom to do this,\nAlways presenting a cheerful countenance,\nI will stop scowling angrily and, instead,\nBe a straightforward friend to the world.",
    "I will cease moving my seat around, etc.\nIn an inconsiderate or noisy way,\nAnd cease slamming doors,\nAlways enjoying quietness.",
    "Cranes, cats and thieves\nMove silently and undetected\nAnd evidently get what they want.\nThe wise should always behave like they do.",
    "By accepting respectfully and with gratitude\nThe unsolicited and beneficial words of others\nThat admonish or advise me,\nI will always be the pupil of everyone.",
    "For all that is well-said,\nI should call it virtuous.\nWhen I see something meritorious being done,\nI will praise it and take delight in it.",
    "I should describe good qualities that are hidden,\nAnd I should confirm good qualities that are expressed.\nIf my own good qualities are mentioned,\nI should notice that those good qualities were recognized.",
    "Everything we do should be for the sake of joy,\nBut joy is difficult to buy, even for the wealthy.\nSo, I will be happy when joy\nIs brought about by the good qualities of others.",
    "It will cost me nothing now,\nAnd in future lives it will bring great bliss.\nOtherwise I will have no joy and only suffering,\nAnd in future lives I will have even greater suffering.",
    "When speaking, my speech should be\nAuthentic, consistent, clear, pleasant,\nWithout attachment or aversion,\nGentle and appropriate.",
    "When my eyes see someone,\nThinking, ‘I can attain buddhahood itself\nIn dependence upon this very person’,\nI will look at them directly and with a gentle regard.",
    "Always motivated by aspiration or antidotes,\nThere will be great virtue\nIn the fields of good qualities,\nHelp and suffering.",
    "When I have the knowledge and ability,\nI should always do things myself.\nIn whatever I do, I should not\nBe dependent on someone else.",
    "The perfections of generosity, etc.\nAre each superior to the preceding one.\nWhile I should not give up the greater in favour of the lesser,\nThe most important thing is to consider the benefit of others.",
    "With this in mind, I should always\nKeep working to benefit others.\nFor this, the far-seeing Compassionate One\nPermitted what is otherwise forbidden.",
    "Apart from consuming just enough food\nAnd wearing the three dharma robes, I will donate the rest\nTo those who have fallen, those with no protector\nAnd those maintaining discipline.",
    "A body being used to practise the holy dharma\nShould not be harmed for the sake of something trivial.\nIf I act in this way, the wishes of beings\nWill be fulfilled more quickly.",
    "My compassionate intentions being impure,\nI should not give away this body,\nBut in this and future lives,\nIt may be given to accomplish a great benefit.",
    "The dharma should not be explained to the disrespectful:\nThose wrapping their heads in cloth like sick men,\nThose carrying parasols, sticks, or weapons,\nAnd those covering their heads.",
    "The profound and vast should not be taught to the lesser,\nNor to an unaccompanied woman.\nI should always show equal respect\nTo the lesser and supreme teachings.",
    "I should not impart the lesser teachings\nTo a vessel of the vast teachings.\nI should not abandon the conduct.\nI should not mislead others with sutras or mantras.",
    "When cleaning my teeth or spitting,\nI should discreetly dispose of it.\nTo urinate, etc. in water\nOr places used by others is disgusting.",
    "I should not eat noisily or with my mouth open,\nOr by cramming my mouth full.\nI should not sit with my feet up\nOr massage my shoulders with both hands at once.",
    "I should not be alone with a woman\nWhen travelling, sleeping or staying somewhere.\nI should know or find out whatever\nIs disrespectful to the world and avoid it.",
    "I should never indicate by finger-pointing\nBut politely gesture towards things\nWith my right hand open.\nThis is also how I should show which way to go.",
    "I should not gesticulate wildly,\nBut express my point with slight movements,\nSignalling with a click of the fingers, etc.\nTo do otherwise would be rude.",
    "I should sleep like the Protector passing into nirvāṇa—\nLying in the preferred direction.\nWith clear comprehension, I should resolve\nTo promptly rise early in the morning.",
    "Though it is taught\nThat bodhisattva conduct is limitless,\nFor now, I should actually practise\nAs much conduct as possible that purifies the mind.",
    "Three times each day and night,\nI should recite the Sutra of the Three Heaps and\nPacify the residual downfalls\nBy relying upon the conquerors and bodhicitta.",
    "Regardless of whether it is one’s own or another’s training,\nFor any particular situation,\nI should train with diligence\nIn whatever is taught for that situation.",
    "There is nothing that\nThe sons of the conquerors fail to train in.\nFor the wise, who always keep to this,\nNothing will fail to be meritorious.",
    "Whether directly or indirectly,\nI should do nothing apart from benefitting beings.\n‘So that this may only benefit beings,\nI dedicate it all to enlightenment.’",
    "The spiritual friend is learned in the Mahāyāna\nAnd has mastered the discipline of the bodhisattvas.\nI should never discard him,\nEven at the cost of my life.",
    "I should train in relying upon the teacher\nAs in the chapter of Śrisambhava.\nThis and the other instructions given by the Buddha\nI should understand through reading the sutras.",
    "The trainings are found in the sutras,\nSo I should read the sutras.\nThe Ākāśagarbha Sutra\nIs the one I should look at first.",
    "Because what is always to be practised\nIs taught there very extensively,\nI will be certain to also study\nThe Śikṣā-samuccaya.",
    "Otherwise I should study the Sutra-samuccaya.\nI should also make an effort to study\nThese two works composed\nBy Ārya Nāgārjuna.",
    "I should practise whatever is not\nProhibited there.\nIn order to protect worldly minds\nI should fully practise what I have learnt.",
    "I should examine again and again\nThe conditions of body and mind.\nThis alone encapsulates\nThe key point of maintaining clear comprehension.",
    "I should put this into practice,\nFor what use are mere words?\nAre sicknesses cured\nJust by reading about the treatment?",
    "All those good actions\nLike giving and making offerings to the Sugatas,\nAccumulated over a thousand aeons,\nAre destroyed in an instant of anger.",
    "There is no nonvirtue like anger,\nAnd no austerity like patience.\nTherefore, in the various ways,\nI should persevere in developing patience.",
    "If I hold on to thoughts afflicted by anger,\nMy mind will know no peace.\nHaving no happiness or pleasure,\nI will be unsettled and unable to sleep.",
    "Some may depend on his favour\nFor wealth and status,\nBut even they will turn against\nA hateful master and kill him.",
    "Friends and relatives will become fed up with him and,\nThough drawn by his generosity, will not want to be around him.\nIn short, someone who stays angry\nWill never be happy.",
    "It is the enemy, anger, which creates\nSufferings like these.\nBut whoever takes control and destroys anger\nWill be happy in this life and future lives.",
    "It arises in the production of what I do not wish for,\nAnd in the obstruction of what I wish.\nFeeding on an unhappy mind,\nAggression grows and destroys me.",
    "Therefore, I should completely eliminate\nThe sustenance of this enemy—\nAn enemy which does nothing\nBut harm me.",
    "Whatever may befall me,\nMy joyful disposition will not be disturbed.\nBeing unhappy won’t accomplish any of my wishes\nAnd my virtues will only deteriorate.",
    "If something can be done,\nWhat’s the point of being unhappy?\nIf nothing can be done,\nWhat good is it to be unhappy?",
    "For myself and my friends,\nI want no suffering, no disrespect,\nNo criticism and nothing unpleasant.\nFor my enemies, I want the opposite.",
    "While the causes of happiness are few,\nThe causes of suffering are many.\nWithout suffering, there is no renunciation.\nTherefore, mind, remain steady.",
    "The devotees of Gaurī and the practitioners of Karna\nUndergo burns, cuts and so forth,\nEnduring them patiently for no benefit. Yet, for the sake\nOf liberation, why do I have no courage?",
    "There is nothing that does not\nBecome easier with habituation.\nTherefore, by habituation to small difficulties,\nI will have the patience for great difficulties.",
    "Who has not undergone the pointless sufferings\nOf snake or insect bites,\nExperiences of hunger and thirst,\nAnd afflictions like skin inflammations?",
    "I should not be so sensitive\nTo heat, cold, rain, wind and so forth,\nTo sickness, confinement, blows and so forth—\nBecause that only magnifies their harm.",
    "Some, when they see their own blood,\nDevelop even greater courage and resolve.\nSome, when they see the blood of another,\nFeel faint and fall unconscious.",
    "These come from having a stable\nOr a weak state of mind.\nTherefore, disregarding harm,\nI will be unaffected by suffering.",
    "Even when suffering occurs,\nThe wise should not let it disturb their peace of mind.\nIn battles with the defilements\nThere will be many injuries.",
    "Having disregarded all sufferings,\nEnemies like aggression will be overcome.\nThose who do so are the real conquering heroes—\nThe rest are just butchering corpses.",
    "Furthermore, suffering has good qualities:\nSadness dispels arrogance,\nOne feels compassion for those in saṃsāra,\nAvoids nonvirtue and delights in virtue.",
    "I have no anger towards things like bile,\nThough they can be great sources of suffering,\nSo why be angry with those which have a mind?\nThey are all just responding to conditions.",
    "Though they are unwanted,\nSuch sicknesses nevertheless occur.\nSimilarly, though they are unwanted,\nDefilements stubbornly arise.",
    "They don’t think, ‘I’m going to get angry now’,\nBut people nevertheless get angry.\nSimilarly, it doesn’t think ‘I’m going arise now’,\nBut anger nevertheless arises.",
    "All the various negative actions\nAnd all the many kinds of nonvirtue\nArise through the power of conditions.\nThey are not autonomous.",
    "Though there is a coming together of conditions,\nThere is no thought of, ‘I’m going to arise now.’\nNor does that which is produced\nHave any thought of itself as produced.",
    "Some claim that there is a primal substance,\nAnd they designate a ‘self’,\nBut it does not deliberately think,\n‘I will arise now’, and then arise,",
    "And if that which has not arisen does not yet exist,\nWhat in that moment wants to create itself?\nSince it would immutably attend to its object,\nIt would never cease.",
    "Furthermore, if the self is sempiternal,\nLike space, it is clearly not an agent.\nEven if it encountered extraneous conditions,\nBeing immutable, what could it do?",
    "During creation, if it is as it was previously,\nIn what sense did it create the thing?\n‘It was produced due to this [condition].’\nThen what relation does the self have to the product?",
    "In this way, everything is extraneously controlled,\nAnd not even the controllers have any power.\nWhen this is recognized, I will not get angry\nAt things which are like apparitions.",
    "‘Who prevents what? It is illogical to prevent anything.’\nThrough reliance on such prevention,\nThe stream of suffering will be cut.\nThere is no error in this.",
    "Therefore, regardless of friend or enemy,\nWhen I see them behaving negatively,\nThinking, ‘This only comes from related conditions’,\nI will remain happy.",
    "If it were true that we could achieve whatever we wanted,\nThen, since among all living beings,\nNobody wants to suffer,\nThere would never be any suffering.",
    "Those who lack concern cause harm\nEven to themselves, with weapons, etc.\nAnd for the sake of what they might attain, such as women,\nThey go hungry, refuse food and so on.",
    "Some, by hanging themselves, jumping off precipices,\nTaking poisonous or harmful food,\nOr by unmeritorious actions,\nDo harm to themselves.",
    "When the defilements are in control,\nEven the precious self can be killed.\nHow, then, could they not\nDo harm to the bodies of others?",
    "Even if I do not develop vast compassion\nFor those who, driven by defilements,\nResort to killing themselves and so forth in such ways,\nHow can I become angry?",
    "If it is in the nature of fools to cause harm to others,\nThen it is wrong to be angry with them.\nThat is like getting angry with a flame\nFor having the nature to burn.",
    "On the other hand, if their faults are accidental,\nOccurring despite their intrinsic nature, then it is wrong to be angry with them.\nThat is like getting angry with an empty space\nFor the presence of a cloud of incense.",
    "It is their weapons and so forth that are the direct instruments of harm,\nSo when I get angry with someone who strikes me,\nIt would make more sense to be angry with their aggression,\nSince they are themselves driven by aggression.",
    "Previously, I caused sentient beings\nSome similar kind of harm.\nTherefore, it is only right that harm should come\nTo me, a doer of harm to sentient beings.",
    "His weapon and my own body\nJointly caused this suffering.\nHe drew the weapon, I brought the body:\nWhich of these should I be angry with?",
    "The human form is like an abscess:\nIt is unbearably sensitive and painful.\nIf, blinded by craving, I cling to it,\nWho should I be angry with when I am harmed?",
    "If a fool does not want to suffer\nBut, nevertheless, is attached to its causes,\nIt is his own negative actions that are harming him,\nSo why fall out with others?",
    "It is like, for example, how the guardians of hell\nOr the forest of razor leaves\nCome from my own actions.\nThat, then, is who I should be angry with.",
    "Provoked by my own actions,\nBeings come to harm me\nBut, in doing so, they fall into the hells.\nIs it not I who am destroying them?",
    "In dependence upon them,\nWith patience, many nonvirtues are purified,\nBut in dependence upon me,\nThey fall into the hells for a long time.",
    "So if I am doing harm to them\nBut they are bringing benefit to me,\nDo I not have it the wrong way round?\nIt is wrong of you, mind, to be angry.",
    "If I have the right attitude,\nI will not go to the hells.\nBut if I only look after myself,\nWhat does this do for them?",
    "However, if I return their harm,\nThat will not protect them either,\nBut it would damage my conduct,\nAnd so destroy the discipline.",
    "Since the mind lacks physical form,\nWhat could destroy it?\nIt is by attachment to the body\nThat I am harmed by physical suffering.",
    "If disrespectful words,\nHarsh speech and criticism\nCannot harm the body,\nWhy, mind, do you fly into a rage?",
    "If contempt from others\nWill not, in this life or future lives,\nDestroy me,\nWhy am I so averse to it?",
    "I am averse to something\nBecause it hinders acquisition,\nBut the acquisitions of this life will be lost,\nWhile the nonvirtues will firmly remain.",
    "It would be better to die today than to live a long life badly,\nFor although someone like me\nMight be around for a long time,\nThe suffering of death still awaits.",
    "Someone wakes from a dream\nOf having a hundred years of happiness,\nWhile another awakes having dreamt\nHe had just a moment of happiness.",
    "Though they have both awoken,\nThe happiness of neither one will return.\nNo matter whether life is long or short,\nAt the moment of death, it is exhausted just the same.",
    "Though I may have gotten many acquisitions\nAnd enjoyed happiness for a long time,\nI will nevertheless go forth naked and empty-handed,\nAs if robbers had left me that way.",
    "‘But can’t I live off these acquisitions,\nExhausting nonvirtue and gathering merit?’\nIf I get angry over acquisitions,\nWon’t that merit be exhausted in nonvirtue?",
    "What am I living for\nIf I am violating the very point of life?\nWhere is the meaning in living a life\nIn which there is only nonvirtue?",
    "‘It is because of the damage they do\nBy criticizing me that I get angry with beings.’\nThen why do you not get angry like this\nWhen they are criticizing others?",
    "You are patient with a loss of respect\nWhen it depends on someone else,\nSo why not be patient with criticisms,\nSince they are dependent upon the arising of the defilements.",
    "Although they may disparage or destroy\nStatues, stupas or the holy dharma,\nIt is wrong for me to be angry,\nFor they have no power to harm the Buddhas and so forth.",
    "They may even harm my teachers,\nFriends or relatives but,\nSeeing these things arise from conditions,\nAs explained above, anger will be averted.",
    "If bodies with minds\nAnd bodies without minds both do harm,\nWhy be angry only at those with minds?\nI should be patient with their harm either way.",
    "If someone out of delusion does something wrong\nAnd someone else out of delusion gets angry,\nWhich of them is without fault,\nAnd which of them is at fault?",
    "Why did I previously commit actions\nThat make others harm me?\nIf it all comes down to my own actions,\nWhy get mad at others?",
    "Looking at it this way,\nI should concentrate on increasing merit\nAnd bringing about an attitude\nOf mutual love between everyone.",
    "For example, when a fire consumes a house,\nBefore it spreads to another house,\nOne removes from it inflammables\nSuch as dry straw and so forth.",
    "Similarly, if the mind is attached to something,\nThe fire of aggression will spread there,\nSo I should remove it right now\nOut of fear that merit will be consumed.",
    "Isn’t it better for a man to be freed with his hand chopped off\nThan for him to be executed?\nIsn’t it better, then, to experience human suffering\nIf it spares me from the hells?",
    "If I am unable now to bear\nEven these slight sufferings,\nWhy do I not avert anger,\nThe cause of the sufferings of hell?",
    "Out of desire, I have undergone burning and so forth\nIn the hells, thousands upon thousands of times,\nWithout it doing anything meaningful for me\nOr anything meaningful for others.",
    "Now, great benefit can be achieved\nFor a harm that is not even a tiny fraction of that.\nI should only be joyful\nIn sufferings that dispel the harms of beings.",
    "If others take pleasure in\nPraising someone’s good qualities,\nWhy, mind, do you find no joy\nIn praising them?",
    "The pleasure you would have\nWould not infringe your vows but bring you happiness.\nIt is permitted by excellent ones,\nAnd is the supreme gathering of others.",
    "‘But only others would have that happiness.’\nIf the happiness of others does not matter to you,\nThe visible and invisible will be lost,\nBecause of not paying them their wages and so forth.",
    "When they are describing my good qualities,\nThat’s when I want them to be happy, too,\nBut, when they are describing someone else’s good qualities,\nThat’s when their happiness doesn’t matter.",
    "Having generated bodhicitta\nBy wishing for the happiness of all sentient beings,\nWhy do I get angry\nWhen beings find happiness by themselves?",
    "If I am claiming to want sentient beings to be\nEnlightened objects of veneration in the three worlds,\nWhy, seeing them receive just some basic respect,\nAm I aghast at the sight of it?",
    "If your relative who needs looking after,\nAnd who relies on what you can provide for him,\nBecomes able to look after himself,\nWouldn’t this make you joyful? Or would you get angry with him?",
    "Why would someone want enlightenment\nIf they do not want what is best for beings?\nHow can someone have bodhicitta\nWho gets angry with the acquisitions of others?",
    "Regardless of whether he gets the thing\nOr it stays in the donor’s house,\nEither way, you won’t get it,\nSo what does it matter whether it is given away or not?",
    "Why did I reject merit,\nFaith and good qualities?\nTell me why I am not angry with the one\nWho did not take the opportunities for acquisitions?",
    "Not only are you not worried\nAbout your own nonvirtues,\nDo you also want to compete\nWith others who have gathered merit?",
    "Even if an enemy is unhappy,\nWhat in that brings you happiness?\nYour merely hoping for it\nCannot be a cause of his harm.",
    "Even if your wishes could bring him suffering,\nWhat happiness is in it for you?\n‘I would be satisfied.’\nCould anything be more destructive than that?",
    "Those caught painfully on this sharp hook,\nCast by the angling defilements,\nWill be cooked in the pots\nOf the guardians of hell.",
    "The prestige of praise and reputation\nWill bring no merit, nor extend my life,\nWill not make me stronger, nor free me from sickness,\nNor will it bring any physical pleasure.",
    "If I care about what is good for me,\nI should ask what use these things are.\nIf it is only a happy state of mind that I want,\nI ought to turn to gambling, drinking, etc.",
    "If, for the sake of reputation,\nThey spend all their money and even get themselves killed,\nWhat use will mere words be to them?\nIf they are dead, who is going to enjoy them?",
    "When their sandcastles collapse,\nChildren howl and cry.\nLike them, when praise and reputation decline,\nMy mind is like a child’s.",
    "Because it has no consciousness,\nA fleeting sound cannot consciously praise me.\n‘But praising me makes someone else happy.\nIs that not a cause of joy?’",
    "What difference does it make to me\nWhether their joy is based on me or someone else?\nThe happiness and joy belongs to them alone.\nI will not get even a little bit of it.",
    "If his happiness gives me happiness,\nThen it should do so in every case.\nIf it did, I would not be so unhappy\nWhen someone is made happy by their joy in others.",
    "Therefore, it is the thought, ‘They are praising me’\nThat brings me joy.\nThis is really ridiculous.\nIt is the behaviour of a child.",
    "Praise and so forth only distract me.\nThey ruin my dissatisfaction with saṃsāra.\nThey make me envious of those who have something good,\nAnd destroy anything that is excellent.",
    "Therefore, those who are at hand\nTo destroy my praise, etc.\nAre they not in fact\nProtecting me from the lower realms?",
    "The shackles of acquisition and honour\nAre not needed for the pursuit of liberation,\nSo how can I be angry\nWith someone who frees me from them?",
    "They are like Buddhas bestowing blessings upon me—\nHolding me back and bolting the door\nAs I try to run towards suffering.\nHow can I be angry with them?",
    "‘He is obstructing my merit.’\nIt is not right to be angry with him either,\nFor if there is no austerity equal to patience,\nShouldn’t I stick to it?",
    "It is my own fault\nThat I do not practise patience towards him\nWhen the cause of merit is at hand,\nSo I am the only obstruction.",
    "If, without them, nothing happens but,\nWhen they are present, it happens,\nThat person is a cause,\nSo how can I call them an obstruction?",
    "A beggar arriving during alms-giving\nIs hardly an obstruction to giving,\nAnd it would be absurd to say that an abbot\nIs an obstruction to taking ordination.",
    "In this world, there are plenty of beggars,\nBut few who do us harm,\nFor unless I have harmed them,\nThey will not harm me.",
    "Therefore, like a treasure appearing\nIn my own home without my doing anything,\nThey help me practise the bodhisattva conduct,\nSo I should take joy in enemies.",
    "Both he and I are involved in this,\nSo the results of practising patience\nShould be given to him first,\nFor he was the cause.",
    "‘But he did not intend for me to practise patience.\nI should not have such respect for an enemy.’\nHe is nevertheless a cause of practice,\nAnd do you not respect the holy dharma for the same thing?",
    "‘But my enemy really was intending to harm me,\nSo I should not respect him.’\nIf he was working for my benefit, like a doctor,\nHow could I practise patience?",
    "Therefore, since the arising of patience\nCompletely depends upon someone’s hostility,\nThat person is a cause of patience,\nSo I should respect him like I respect the holy dharma.",
    "Therefore, as the Sage has taught,\nThe field of sentient beings is a Buddha field.\nMany have practised respect for them and,\nIn that way, completely crossed over.",
    "The Buddha qualities are established\nThrough sentient beings and Buddhas alike,\nSo how can I respect the conquerors\nBut not also respect sentient beings?",
    "It is not in their respective intentions\nThat they are equal but in their results.\nIt is in this sense that sentient beings have the qualities\nDue to which they are like the Buddha.",
    "The greatness of sentient beings\nIs there in venerating someone who has a loving mind.\nThe greatness of the Buddha\nIs there in the merit of having faith in him.",
    "It is in respect of their producing the Buddha qualities\nTherefore, that we hold them equal,\nBut none is equal to the Buddha,\nWho has limitless oceans of qualities.",
    "His collection of supreme qualities is unequalled but,\nIf someone with just a fraction of those qualities were to appear,\nThen to offer him even the three realms\nWould be a small offering.",
    "Since sentient beings have a part in generating\nThe supreme Buddha qualities,\nIt is right to venerate them\nJust for their doing this.",
    "Furthermore, apart from my dedication to sentient beings,\nHow can I ever repay\nTheir steadfast friendship\nAnd their carrying out limitless benefit?",
    "If I am to repay the benefit\nOf those who give up their bodies to enter the Avīci Hell,\nI should do everything good for everyone,\nEven if they do me great harm.",
    "If our masters sometimes act\nWithout regard even for their own bodies,\nHow can I, a confused person,\nHave such conceit as to not be their servant?",
    "The sages are pleased when beings are made happy,\nAnd displeased when they are harmed.\nBy bringing beings joy, we please all the sages but,\nBy harming beings, we harm the sages.",
    "Just as no object of desire could delight\nSomeone whose whole body is on fire,\nSo when sentient beings are harmed,\nThere is no way to please the great compassionate ones.",
    "Therefore, since I have harmed beings,\nAnd displeased the great compassionate ones,\nI now confess every one of those nonvirtues,\nAnd ask the sages to be patient with everything I have done to displease them.",
    "To please the tathāgatas,\nFrom now on I will serve the world.\nEven if many beings kick me in the head, beat me\nAnd try to kill me, I will not retaliate but will please the lords of the world.",
    "There is no doubt that the lords of compassion\nTreat all beings as their own selves. I may see them as sentient beings\nBut the protectors see them as self.\nWhy then do I have no respect?",
    "This is what pleases the tathāgatas,\nAnd it perfectly accomplishes my own benefit.\nIt even dispels the world’s sufferings.\nTherefore, I should always practise this.",
    "For example, though one of the king’s men\nMay harm many people,\nThe judicious people\nDo not retaliate, even though they could.",
    "For he is not alone,\nBut his power is that of the king.\nSimilarly, I should not have contempt\nFor even the weakest of harm-doers,",
    "For they are supported by legions\nOf hell-guardians and compassionate ones.\nTherefore, like the subjects of a wrathful king,\nI should try to placate sentient beings.",
    "If the king were to become angry\nHe could not bring the miseries of hell upon me.\nYet, that is what is brought about\nBy my harming sentient beings.",
    "On the other hand, if the king were to be pleased,\nHe could not bestow buddhahood upon me.\nYet, that is what is brought about\nBy my pleasing sentient beings.",
    "Quite apart from the fact that the future achievement of buddhahood\nComes from pleasing sentient beings,\nCan I not see that patience brings good fortune,\nReputation and prosperity?",
    "In saṃsāra, patience brings beauty,\nGood health and reputation,\nA long life, and all the vast pleasures\nOf a universal emperor.",
    "With such patience, I should undertake effort,\nFor there is enlightenment in effort.\nJust as there is no movement without wind,\nSo there is no merit without effort.",
    "What is effort? Joy in virtue.\nIts opposing factors are\nLaziness, attachment to the negative\nAnd the despondency of self-loathing.",
    "With the sweet taste of inactivity\nAnd the craving for sleep,\nI am not yet tired of the sufferings of saṃsāra,\nSo laziness arises.",
    "Hunted by the defilements,\nI will be caught in the trap of rebirth,\nAnd disappear into the jaws of the Lord of Death.\nDo I understand this at all?",
    "Our kind are being gradually eradicated.\nCan you not see that?\nThose who go on sleeping regardless\nAre like cattle before their butchers.",
    "Having blocked off all paths,\nThe Lord of Death is now looking for you.\nHow can you enjoy food?\nHow can you enjoy sleep?",
    "Since death is approaching fast,\nHow will I be able to accumulate merit?\nAt that time, even if I did abandon laziness,\nIt would be too late. What would be the point?",
    "When I haven’t done this, have just started this,\nAm in the middle of this…\nSuddenly the Lord of Death will come,\nAnd I will cry, ‘Oh please no! It’s over!’",
    "Overcome with misery, their eyes swollen and red,\nTears streaming down their faces,\nMy family will have lost all hope,\nAnd all the while I will see the messengers from the Lord of Death.",
    "Tortured by the memories of my own nonvirtues\nAnd hearing the immanent sounds of hell,\nTerrified, I will clothe my body in excrement.\nWhat could I possibly do in such a delirious state?",
    "If, in this life, you are terrified,\nLike a fish flipping about out of water,\nWhat can be said of the unbearable sufferings\nOf hell, created by your own nonvirtues?",
    "How can you rest content,\nHaving done deeds which will lead to\nThe heating hells, where your tender flesh\nWill be scalded by boiling water?",
    "Wanting the result but not wanting to make an effort,\nSensitive to all kinds of harm,\nLike a god in the grip of death\nYou cry out, ‘I cannot stand this suffering!’",
    "Cross the great river of suffering\nUsing the boat of human life.\nSince this boat will be very difficult to find again,\nNow is not the time for sleeping, you fool!",
    "Having given up the supreme joy of the holy dharma,\nA limitless cause of joy,\nHow can you find joy in distractions\nAnd agitations, which are causes of suffering?",
    "Without despondency, with the powers,\nWith dedication and self-control,\nEqualizing myself and others,\nI should then exchange myself and others.",
    "‘How can I possibly become enlightened?’\nDon’t be so despondent.\nThe Tathāgata,\nWhose words are true, said",
    "That even bees, mosquitoes,\nWasps and worms,\nIf they could develop the power of effort,\nWould attain unsurpassable enlightenment, so hard to attain.",
    "Someone like me, born into humanity,\nRecognizing what is of benefit and harm—\nAs long as I do not abandon the bodhisattva conduct,\nWhy would I not attain enlightenment?",
    "If I am more frightened at the prospect\nOf having to lose an arm or a leg,\nI have not examined what is heavy and what is light.\nThat fear comes from my own confusion.",
    "For countless millions of aeons,\nCountless times I have been cut,\nImpaled, burned and torn apart,\nBut I did not attain enlightenment.",
    "But the suffering through which I can accomplish\nEnlightenment is limited.\nIt is like the suffering of making an incision\nIn order to extract something painful within.",
    "All physicians use unpleasant treatments\nTo cure illnesses.\nSo, to overcome many sufferings,\nI can put up with a little unpleasantness.",
    "Yet, the supreme physician does not use\nOrdinary treatments like these.\nWith his extremely gentle practice,\nHe cures the limitless number of great sicknesses.",
    "At first, the guide only has us practise\nGiving away a few vegetables, etc.\nEventually, having gotten used to this,\nWe can come to give away even our own flesh.",
    "When I eventually come to regard my own body\nAs like those vegetables, etc.\nWhy would it be difficult\nTo give away its flesh?",
    "There is no suffering because nonvirtue is given up.\nThere is no lack of joy because of wisdom.\nIt is wrong understanding that harms the mind\nAnd nonvirtues that harm the body.",
    "Merit brings physical pleasure,\nAnd wisdom brings mental happiness.\nAre the compassionate ones fed up\nWith remaining in saṃsāra for the benefit of others?",
    "Their former nonvirtues are exhausted\nBy the force of their bodhicitta,\nAnd they gather oceans of merit,\nDue to which they surpass the śrāvakas.",
    "Therefore, riding the chariot of bodhicitta,\nWhich relieves all discouragement and fatigue,\nAnd takes one from happiness to happiness,\nWhat thinking person would be despondent?",
    "The powers that can accomplish the benefit of beings\nAre motivation, steadfastness, joy and rest.\nMotivation is developed through fear of suffering\nAnd considering its benefits.",
    "Therefore, give up the factors that oppose\nMotivation, pride, joy and rest,\nAnd with dedication and self-control,\nWork to increase effort.",
    "I will overcome the endless faults\nOf myself and others,\nEven if each one of those faults\nTakes an ocean of aeons to wear out.",
    "When I see that I have barely begun\nTo exhaust my own faults,\nWhy do I not have a heart attack, thinking\nI will end up in the realms of limitless suffering?",
    "I will establish the many good qualities\nOf myself and others,\nEven if each one of those qualities\nTakes an ocean of aeons to cultivate.",
    "Since I have never developed\nMuch familiarity with even a part of those qualities,\nIt is quite amazing that I, someone who has acquired\nSuch a rare rebirth, should act so meaninglessly.",
    "I have not made offerings to the Buddhas,\nNor provided great feasts.\nI have not done anything for the teachings,\nNor fulfilled the wishes of the poor.",
    "I have not protected the frightened from what threatens them,\nNor given comfort to the destitute.\nThe only thing I have done is cause my mother\nThe pain and suffering of carrying me in her womb.",
    "In the past, until now,\nI have had no motivation for dharma,\nAnd now I am destitute like this.\nWho would abandon the motivation for dharma?",
    "Motivation is the source\nOf all virtuous pursuits, as the Sage has said.\nThe source of motivation is continual meditation\nOn the ripening of results.",
    "Sufferings, anxieties,\nAll kinds of distress,\nAnd being separated from our desires\nAll come from nonvirtue.",
    "For one who keeps a virtuous intent in mind,\nNo matter where he goes,\nHis merit will present offerings to him\nWith the gifts of ripening results.",
    "But one who practises nonvirtue, though he may want happiness,\nNo matter where he goes,\nWill be defeated by his nonvirtues,\nBearing instruments for inflicting pain.",
    "In the vast, fragrant, cool heart of a lotus,\nWhere the sound of the Conqueror’s words nurtures their resplendence,\nThe virtuous, prompted by the Sage’s light, arise from a lotus in a supreme form\nAnd become children of the Sugatas in the presence of the Conqueror.",
    "For the nonvirtuous, the servants of the Lord of Death will relentlessly flail all the skin from their bodies,\nAnd pour molten copper, liquefied by ferocious furnaces, down their throats.\nAs one hundred chunks of flesh are gouged from them with red hot swords and knives,\nThey will fall upon the fiercely blazing iron ground.",
    "Therefore, I should be motivated to virtue,\nAnd develop enthusiasm for it.\nI should cultivate pride from the outset\nAccording to the practice of Vajradhvaja.",
    "I should assess my own resources\nBefore deciding whether or not to undertake something.\nIt is better not to undertake it\nThan to undertake it and then stop,",
    "For that habit will continue in future lives,\nAnd increase nonvirtue and suffering.\nAlso, other actions and their results\nWill be weakened and will not be accomplished.",
    "I should take pride in three things:\nActions, defilements and ability.\n‘I will do it alone.’\nThis is pride in actions.",
    "The world is overpowered by defilements\nAnd cannot achieve its own benefit.\nSince beings cannot do it for themselves,\nI will do it for them.",
    "How can I just sit here\nWhen others are performing negative actions?\nI don’t act because of pride,\nBut it would be better not to have such pride.",
    "When it comes across a dying snake,\nA crow acts as if it were an eagle.\nSimilarly, when I am weakened,\nEven a small downfall will harm me.",
    "When I am discouraged, I give up,\nSo how will I ever be liberated from destitution?\nThe proud, generating exertion,\nCan handle difficulties, even great ones.",
    "Therefore, with a steady mind,\nI will overcome all downfalls,\nFor if I am defeated by the defilements,\nMy wish to conquer the three realms would be a joke.",
    "‘I will conquer all,\nAnd be conquered by nothing.’\nI, a child of conquering lions,\nShould take pride in this.",
    "Whoever is defeated by their pride\nDoes not have this pride; he has defilements.\nThe proud are not overpowered by their enemies;\nThey bring the enemy pride under their power.",
    "Their defilements inflate them with pride,\nAnd their pride leads them to the lower realms.\nIt steals the wealth of their human life,\nAnd leaves them a slave, begging food from others,",
    "Stupid, ugly and pathetic, despised wherever they go.\nIf these wretches, inflated with pride,\nAre counted among the proud,\nWho could be considered shamed?",
    "Whoever takes pride in conquering the enemy pride\nIs one of the proud and a completely victorious hero.\nWhoever finally overcomes the enemy pride when it is upon him\nBrings the results of his conquest to completion in accord with the wishes of beings.",
    "Amid the amassing defilements,\nI will withstand them in a thousand ways.\nLike a lion among foxes,\nThe host of defilements will not disturb me.",
    "In a deadly situation,\nPeople protect their eyes.\nSimilarly, even in a threatening situation,\nI will not fall under the power of the defilements.",
    "It would be better to be burned alive\nOr decapitated\nThan to be constantly grovelling\nTo the enemy defilements.\nSimilarly, in all circumstances,\nI should do nothing other than what is appropriate.",
    "Whatever actions are to be done, I will carry them out\nLike someone who enjoys the playing\nOf a game as its own reward;\nI will insatiably delight in participating.",
    "When we act for the sake of our own happiness,\nWe do not know whether we will get it or not.\nBut how can one for whom the action itself brings happiness\nBe happy without doing it?",
    "If I never have enough sense pleasures,\nWhich are like honey on a razor’s edge,\nHow can I ever have enough merit,\nWhich ripens in happiness and bliss?",
    "Therefore, in order to carry out an action,\nI will engage in it\nLike an elephant tormented by the midday sun,\nPlunging into a lake.",
    "If, after some time, my strength declines,\nI should leave it so I can return to it later.\nWhen I have completed something properly,\nI should leave it, wanting to get on with the next thing.",
    "Like engaging in a sword fight\nWith a veteran enemy warrior,\nI will dodge the defilement weapons\nAnd cut down the defilement enemies.",
    "If I dropped my sword in battle,\nI would hurriedly snatch it up, horrified.\nLikewise, if I lose the blade of mindfulness,\nI will quickly restore it, in horror of hell.",
    "Poison spreads throughout the body\nBy means of the blood.\nLikewise, if they find an opportunity\nFaults will spread throughout my mind.",
    "Practitioners should be as careful\nAs someone carrying a pot of mustard oil,\nAttended by a knifeman\nThreatening to kill them if they should spill any.",
    "I would hurriedly jump up\nIf a snake slid onto my lap.\nLikewise, if I sink into sleep or lethargy,\nI will quickly repel them.",
    "Each time some fault occurs,\nI should reproach myself,\nReflecting for a long time,\n‘I will not allow this to happen again.’",
    "‘How can I develop mindfulness\nIn these particular circumstances?’\nWith this in mind, I should plan for\nOccasions of meeting and practising.",
    "Before committing any act,\nI should be fully prepared.\nCalling to mind the advice on concern,\nI should proceed to carry it out.",
    "Like cotton blown back and forth\nUnder the power of the wind,\nI should accomplish everything in this way\nUnder the power of enthusiasm.",
    "Having developed effort in this way,\nI should place my mind in samādhi.\nSomeone whose mind is distracted\nLives between the jaws of the defilements.",
    "With the isolation of body and mind,\nThere are no distractions.\nTherefore, I should abandon this world,\nAnd give up all conceptual discrimination.",
    "Out of attachment and craving for possessions, etc.\nI do not abandon this world.\nTherefore, to completely abandon it,\nThe wise should analyse it as follows.",
    "Understanding that insight with complete calm abiding\nWill utterly destroy the defilements,\nI should seek calm abiding first,\nAnd that is achieved through the joy of freedom from worldly attachment.",
    "Which impermanent person would have attachment\nTo another impermanent person?\nHe will not see his loved one again\nFor thousands of lifetimes.",
    "I am unhappy when I don’t see them\nAnd my mind will not settle.\nYet, even when I see them, I am not satisfied,\nBut just as tormented by craving as before.",
    "If one is attached to sentient beings,\nReality is obscured,\nRenunciation is forgotten,\nAnd one ends up suffering in misery.",
    "Thinking solely of them,\nThis life passes by without any meaning.\nThe unchanging dharma\nIs lost through transient friends.",
    "If I act like a fool,\nI will surely go to the lower realms.\nIf they are leading me to that different end,\nWhy would I follow such fools?",
    "One second they are friends\nBut, in an instant, they become enemies.\nSince they get angry even in joyful situations,\nPeople are very hard to please.",
    "If I say something helpful, they get angry,\nAnd oppose my help.\nIf I don’t listen to them, they get angry,\nAnd then will go to a bad rebirth.",
    "They are envious of superiors, competitive towards equals,\nAnd arrogant towards inferiors. When praised, they become conceited.\nWhen criticized, they get angry.\nWhat good can ever come from such children?",
    "When associating with the childish,\nWe praise ourselves and criticize other children,\nAnd nonvirtues, like discussing\nThe joys of saṃsāra, inevitably occur.",
    "To associate with others like this\nOnly brings loss.\nTherefore, since I will not benefit them,\nAnd they will not benefit me,",
    "I should stay far away from childish people.\nWhen I come across them, I should be happy to please them.\nWithout being very familiar,\nI should treat them well just like any ordinary person.",
    "Like a bee taking nectar from a flower,\nI should accept only what is for the dharma.\nI should remain unfamiliar,\nAs if they were someone I had never met before.",
    "‘I have lots of possessions and respect.\nI am really popular.’\nIf I hold on to such thoughts,\nMy death will be horrible.",
    "Therefore, whatever it is\nThat this utterly confused mind desires,\nAlong with it comes\nA thousand sufferings.",
    "Therefore, the wise don’t have desires.\nFear comes from desire.\nSince it is the nature of things to be let go of,\nI will be firm and recognize this well.",
    "I may have many possessions,\nAnd I may be famous and praised,\nBut these possessions and fame—\nI don’t know what will become of them.",
    "Why does someone’s praise please me,\nWhen there is someone else to criticize me?\nWhy does someone’s criticism displease me,\nWhen there is someone else to praise me?",
    "If even the Conqueror could not satisfy\nThe various inclinations of sentient beings,\nWhat can one say of a wretch like me?\nTherefore, I will give up thinking about worldly people.",
    "They look down on those who have no possessions,\nAnd complain about those who have them.\nSince they are so difficult to get along with,\nHow can they bring me any joy?",
    "The Tathāgata said,\n‘Since the childish are not happy\nUnless they are benefitting themselves,\nThe childish are friends to no one.’",
    "In the forest, the deer, birds\nAnd trees do not speak unpleasantly.\nWhen will I come to live among\nSuch good company?",
    "Staying in caves or deserted shrines,\nOr at the foot of a tree—\nI will not look back\nBut will be free from attachment.",
    "When will I come to live\nIn naturally spacious places,\nNot claimed by anyone as their own,\nFree to do as I please, without attachment?",
    "Having just a begging bowl and a few things,\nWearing clothes not wanted by anyone,\nNot even having to conceal this body—\nWhen will I come to live without worry?",
    "When will I go to the burial ground, where,\nBetween my body and those heaps of bones,\nThere is no difference\nIn our subjection to disintegration?",
    "That is where this body of mine will end up,\nWith a stink so putrid\nThat not even the wolves\nWill want to go near it.",
    "If the very flesh and bones\nThat comprise my body\nMust come apart,\nWhat can be said of friendships?",
    "When we are born, we are born alone.\nWhen we die, we die alone.\nIf they cannot relieve us of our burden of suffering,\nWhat do friends do but create obstacles?",
    "As travellers on the roads\nTake their places to stay,\nSo, on the paths of conditioned existence,\nAll take their places of birth.",
    "While everyone is completely grief-stricken,\nFour pallbearers carry someone away.\nBefore that time comes for me,\nI will go to the forest.",
    "I will stay alone in isolation,\nSomewhere without friends or antagonists.\nWhen I die, since they will already think of me as dead,\nI won’t cause them any distress.",
    "And since they won’t be around me,\nBeing miserable and causing problems,\nNobody will be able to distract me\nFrom mindfulness of the Buddha and so on.",
    "Therefore, I will go to live\nIn the bright, beautiful forest where,\nWith few problems, happy and content,\nAll disturbances will be pacified.",
    "Giving up all other purposes,\nI will endeavour single-mindedly\nTo place my mind in meditative equipoise\nAnd subdue it.",
    "In this world and in the next,\nOur desires bring us only ruin.\nHere, we are killed, imprisoned and broken,\nAnd in the next, we go to the hells.",
    "To get her, you had entreated her,\nWith messengers, male and female,\nWithout any thought\nFor nonvirtue or shame.",
    "You would do things that terrified you,\nWaste your wealth and,\nWhen she was finally in your arms,\nWere overjoyed with what was really",
    "Nothing but a skeleton,\nWith neither autonomy nor self.\nBut because of your intense desire and attraction to her,\nYou did not go beyond suffering.",
    "At first, you tried to get her\nTo raise her face to you but, modestly, she looked down.\nWhether anyone could see her or not,\nShe covered her face with a veil.",
    "That face, which so concerned you,\nIs right there before you now,\nFor the vultures have stripped it bare—\nSo why do you run away?",
    "When someone looked at her,\nYou would completely shield her face from him,\nBut now that the vultures are eating that face away,\nWhy, selfish, don’t you protect it?",
    "Seeing this pile of flesh\nBeing eaten by vultures and other creatures,\nWhy don’t you go and present to their food\nThose flower garlands, sandalwood and ornaments?",
    "If you are afraid of a mere pile of bones,\nEven though it cannot possibly move,\nWhy are you not frightened\nBy something that stirs like a zombie?",
    "You wanted it when it was covered.\nWhy don’t you want it now it is uncovered?\nIf you have no need of it now,\nWhy did you want it then?",
    "If excrement and saliva\nCome from the same source—food,\nWhy do you love her saliva,\nBut not her excrement?",
    "You don’t have any love for your pillow\nOf soft cotton but,\nTelling yourself she doesn’t really stink,\nYour desire confuses you about what is impure.",
    "Those confused, desirous wretches,\nThough their pillows are soft,\nGet angry, saying,\n‘I can’t copulate with this!’",
    "If you aren’t attracted to impurity,\nWhy do you embrace\nA cage of bones joined by ligaments,\nAnd plastered over with flesh?",
    "You yourself have plenty of impurity,\nWhich you continually have to experience,\nAnd yet you hungrily chase after the filth of others\nThough they, too, are bags of impurity.",
    "‘It’s just their flesh I enjoy.’\nIf that is what you want to see and touch,\nDo you want it in its natural state,\nDevoid of a mind?",
    "The mind that you desire\nCannot be seen or touched,\nSo it makes no sense to want to copulate with it.\nWhat can be seen and touched is not conscious.",
    "It is unremarkable to misunderstand\nThe impure nature of other bodies,\nBut it is very remarkable to misunderstand\nThe impurity you yourself have.",
    "Not noticing a young lotus flower,\nSpreading its petals in the sunlight on a cloudless day,\nWhy is the mind so attracted to impurity,\nAnd drawn to cages of impurity?",
    "If you don’t want to touch\nAn area covered in excrement,\nWhy do you want to touch\nThe body it issued from?",
    "If you are not attracted to impurity,\nWhy do you want to copulate with the body parts of others,\nWhich came from an impure place,\nAnd developed from an impure seed.",
    "You are not attracted to\nA tiny grub, born on excrement.\nYet, you are attracted to bodies which have many natural impurities,\nAnd are even born from impurities.",
    "Not only do you not mind\nThe impurity of your own body,\nBut, wanting even more impurity,\nYou desire other bags of impurity, too.",
    "When pleasing substances like camphor,\nRice or cooked vegetables\nAre spat out after chewing,\nEven the ground is considered dirty.",
    "Though such impurity is quite obvious,\nIf there are any doubts about it,\nTake a look at the bodies in the cemetery.\nYou can see even more impurity there.",
    "If someone’s skin were to be peeled away,\nYou would be completely horrified.\nYou know this, so how can you\nEver be attracted to such a thing again?",
    "Scents applied to the body\nAre of sandalwood and so forth, nothing else.\nWhy are you attracted to things\nThat smell of something else?",
    "The body’s natural smell is awful.\nIsn’t it right not to be attracted to it?\nWhy do the worldly, craving something meaningless,\nDaub it with a fragrance?",
    "For, if the fragrance is that of sandalwood,\nHow could it come from the body?\nWhy are you attracted to things\nThat smell of something else?",
    "The body in its natural state,\nWith long hair and nails,\nWith stinking, grey teeth, covered with foul-smelling dirt,\nAnd naked, is actually frightening.",
    "Why make such an effort to clean up\nSomething that is like a weapon for wounding me?\nThis world is in chaos with lunatics,\nFrantic in their self-centred confusion.",
    "Having seen a few skeletons in the cemetery,\nYou felt revulsion.\nSo are you happy in this cemetery city,\nFull of moving skeletons?",
    "In this way, you cannot have\nSuch impurity without paying a price.\nFor those who get it, exhaustion\nAnd agonies such as those of hell ensue.",
    "Children cannot amass any wealth,\nAnd the young cannot enjoy it.\nWhen life is wasted chasing them,\nWhat use are those desires to the old?",
    "Some miserable people, full of desire,\nAre completely worn out at the end of a long day.\nThey come home and collapse,\nTheir lifeless bodies sleeping like the dead.",
    "Some are afflicted by travelling,\nAnd have to suffer being far from home.\nThough they miss their families,\nThey will not see them for years on end.",
    "Some confused ones, wanting to help themselves,\nSell whatever they have but,\nWithout getting what they wanted, are driven aimlessly\nBy the winds of others’ karma.",
    "Some sell their own bodies,\nAnd are helplessly exploited by others.\nIf his wife should give birth, she must do so\nAt the foot of a tree or in whatever remote place she finds herself.",
    "Fools, deceived by their desire,\nWant a livelihood and, thinking they will make a living,\nJoin the army, though they are afraid of dying,\nOr enter into servitude for money.",
    "Some desirous people can be seen with broken bodies,\nOr impaled upon stakes,\nOr pierced by blades,\nOr even burned.",
    "Due to the anxieties of getting, keeping and losing wealth,\nUnderstand that its problems are endless.\nThose who become distracted by attachment to wealth\nHave no opportunity for liberation from the sufferings of saṃsāra.",
    "Those who have desire for such things\nWill have many problems and little satisfaction.\nThey are like beasts pulling a wagon,\nAble to eat just a few mouthfuls of grass.",
    "For the sake of something that gives little satisfaction\nAnd which so common that even animals can get it,\nThose tormented by their karma waste the magnificent freedoms and endowments\nThat they had acquired with such difficulty.",
    "The objects of desire will inevitably perish,\nBut I will fall into the hells and so forth.\nFor the sake of something not very important,\nI have been wearing myself out.",
    "If buddhahood itself can be attained\nWith just a millionth of that difficulty,\nHaving desire is much more suffering\nThan practising the bodhisattva conduct but without any enlightenment.",
    "When one thinks about the sufferings of the hells,\nThe dangers of weapons, poisoning, fires, ravines\nAnd enemies are nothing\nCompared to the objects of desire.",
    "Disillusioned with the objects of desire,\nI will develop joy in solitude.\nIn peaceful forests,\nWith no conflict or defilements,",
    "Fortunate ones, cooled by sandalwood moonlight,\nStroll and contemplate the benefit of others,\nAmong wondrous palaces of immense rocks,\nAs a silent, soothing forest breeze blows.",
    "In an empty hut, at the foot of a tree or in a cave,\nThey stay as long as they want.\nThey have left behind the sufferings of masters and protection and,\nNot reliant on anyone, live carefree.",
    "Free and without attachment,\nNot tied to anyone,\nThey live with a contentment and happiness\nThat even Indra would have difficulty finding.",
    "Having considered how solitude\nHas such good qualities,\nI should pacify conceptual discrimination\nAnd meditate on bodhicitta.",
    "Equalizing self and others\nIs the first thing to try and cultivate.\nSince everyone is the same when it comes to happiness\nAnd suffering, I should look after them as I do myself.",
    "Just as the whole body should be protected,\nThough it has many different parts—hands and so on,\nSo different beings, whether happy or suffering,\nAll want to be happy, just as I do.",
    "Though my suffering doesn’t harm\nThe bodies of others,\nNevertheless, it is my suffering,\nAnd clinging to it as ‘mine’ makes it intolerable to me.",
    "Similarly, though the suffering of others\nDoes not befall me,\nNevertheless, it is my suffering,\nAnd clinging to it as ‘mine’ will make it hard for me to tolerate.",
    "I should expel the suffering of others\nBecause it is suffering, like my own suffering,\nAnd I should benefit others\nBecause they are sentient beings, like I am.",
    "When you and I\nAre the same in wanting to be happy,\nWhat is so special about me\nThat I work only for myself?",
    "When you and I\nAre the same in not wanting to suffer,\nWhat is so special about me\nThat I look after myself and not you?",
    "‘Their suffering doesn’t hurt me,\nSo why should I care about them?’\nFuture sufferings don’t hurt you either,\nSo why protect yourself from them?",
    "To think, ‘I’m the one who will experience it’,\nIs a mistake.\nIt is someone else who dies after this,\nAnd someone else again who is born.",
    "‘The ones with the suffering\nShould look after themselves.’\nThe suffering of the feet is not that of the hands,\nSo why should the hands protect them?",
    "‘It may not be right,\nBut I do it out of self-clinging.’\nNeither self nor other is right:\nYou should try to give them both up.",
    "A ‘stream’ and a ‘composite’ are false,\nLike a string of beads or an army.\nSuffering is not owned by anyone,\nSo, who should be the one to remove it?",
    "Sufferings have no owner:\nNone of them is unique.\nIf it is suffering, it should be eradicated.\nWhy be inconsistent about this?",
    "There is no disagreement about the reason\nFor preventing everyone’s suffering.\nIf you prevent it at all, prevent it for all.\nOtherwise, don’t do it for anyone.",
    "‘Compassion will bring me a lot of suffering,\nSo why should I develop it?’\nIf you think about the sufferings of living beings,\nHow can compassion be considered a lot of suffering?",
    "If one person’s suffering\nCan stop many sufferings,\nA kind-hearted person would take on that suffering\nFor his own sake and the sake of others.",
    "It was for this reason that Supuśpacandra,\nThough he knew the king would harm him,\nDid not evade his own suffering\nIn order to exhaust many sufferings.",
    "One who cultivates this in their being,\nWith the joy of pacifying the suffering of others,\nWould enter the Avīci Hell\nAs if they were diving into a lotus pool.",
    "When sentient beings are completely liberated,\nIt is an ocean of joy.\nIs that not enough?\nWhat use is it wanting my own liberation?",
    "In this respect, though I am benefitting others,\nI will do it without conceit or thinking it is a big deal.\nBy taking joy solely in their benefit,\nI will not expect the ripening of any results.",
    "Therefore, just as I protect myself\nFrom the slightest criticism,\nSo I should have a protective attitude towards others,\nAnd a compassionate intent.",
    "Just as out of habit I regard\nThe drops of semen and blood\nOf others as ‘myself’,\nEven though they have no substance,",
    "Why don’t I regard the bodies of others\nAs ‘myself’ in the same way, too?\nNor should it be hard to see\nMy own body as theirs, too.",
    "Having recognized that self is defective,\nWhile others are an ocean of good qualities,\nI should completely abandon self-clinging\nAnd practise embracing others.",
    "Just as I regard my hands, etc.\nAs parts of my body,\nWhy don’t I regard embodied beings\nAs limbs of one life?",
    "Just as habituation has brought about\nThe idea of self for this selfless body,\nWhy should habituation not create\nThe same idea about sentient beings?",
    "Though I might benefit others in this way,\nI will not have conceit or think it is a big deal,\nLike not expecting a reward\nAfter eating my own food.",
    "Therefore, just as I protect myself\nFrom the slightest criticism,\nSo I should have a protective attitude towards beings,\nAnd cultivate a compassionate intent.",
    "The protector Avalokiteśvara,\nOut of great compassion\nBlessed even his own name\nTo dispel the fear of crowds.",
    "I shouldn’t turn away from difficulty.\nJust hearing someone’s name might have once frightened me but,\nBy the power of habituation,\nI will come to be disappointed at their absence.",
    "Whoever wants quickly\nTo protect himself and others\nShould practise the holy secret:\nExchanging self and others.",
    "Out of attachment to my body,\nI am frightened by the slightest threat.\nWho would not resent as an enemy\nA body which creates so much fear?",
    "Wanting to alleviate the body’s\nHunger and thirst, or its sickness,\nSomeone kills a bird, fish or deer,\nOr lies in ambush by the roadside.",
    "For the sake of wealth and status,\nSomeone kills his father and mother,\nOr steals the offerings made to the Three Jewels and,\nBecause of this, burns in the Avīci Hell.",
    "Who, then, would be wise\nTo cherish, protect and lavish gifts upon that body?\nWho would not see it as their enemy,\nAnd regard it with contempt?",
    "‘If I give this, what will I have?’\nThinking of one’s own benefit is the way of demons.\n‘If I keep this, what will I give?’\nThinking of the benefit of others is the dharma of the gods.",
    "If I harm others for my own sake,\nI will be tormented in the hells and so forth but,\nIf I am harmed for the sake of others,\nI will attain everything I could possibly want.",
    "If I desire a high status for myself,\nI will go to the lower realms, lowly and stupid but,\nIf I wish it for others,\nI will obtain a happy rebirth and every honour.",
    "If I use others for my own sake,\nI will come to know servitude and so forth myself but,\nIf I work for the sake of others,\nI will come to experience a high status and so forth.",
    "Whatever happiness there is in this world\nAll comes from wanting others to be happy.\nWhatever suffering there is in this world\nAll comes from wanting one’s own happiness.",
    "Does this need to be explained any further?\nJust look at the difference between\nThe childish, who pursue their own benefit,\nAnd the Buddhas, who carry out the benefit of others.",
    "If I do not actually exchange\nMy happiness for the suffering of others,\nNot only will I not attain buddhahood but,\nEven in saṃsāra, I will find no happiness.",
    "Even apart from my future lives,\nNothing would get done in this life:\nServants would fail to do their work\nAnd masters would refuse to pay them.",
    "Completely discarding the abundant joy and contentment\nOf achieving both visible and invisible happiness\nAnd, instead, being a cause of suffering for others,\nIn confusion, I am bringing unbearable suffering upon myself.",
    "All the dangerous forces in the world\nAnd as much fear and suffering as there is,\nCome from self-grasping,\nSo what good is this great demon to me?",
    "If I don’t give it up completely,\nI cannot avoid suffering,\nJust as if I don’t put out a fire,\nI cannot avoid being burnt.",
    "Because it will, in this way, pacify harm to myself\nAnd pacify the sufferings of others,\nI will give myself up for others,\nAnd embrace others as I did the self.",
    "‘I am under the control of others.’\nWith this conviction, mind,\nYou will now have no thought\nOther than benefitting all sentient beings.",
    "Since my eyes, etc. are controlled by others,\nIt is not right for them to accomplish my benefit.\nSince my eyes, etc. are for their benefit,\nIt is not right for them to do any harm.",
    "Therefore, I should put sentient beings first.\nAnything I see on my body\nShould be taken away from it\nAnd used to help others.",
    "Taking my inferiors, etc. as self;\nAnd taking self as other,\nWith a disinterested mind,\nI will meditate on envy, competitiveness and pride.",
    "He gets respect, but I don’t.\nI don’t have any wealth like his.\nHe is praised while I am criticized.\nHe is happy while I am suffering.",
    "I have to work\nWhile he sits back comfortably.\nHe is renowned in the world as great,\nWhile I am his inferior, with no good qualities.",
    "How can I have no good qualities?\nEveryone has good qualities.\nCompared to some, he is inferior.\nCompared to some, I am superior.",
    "My degenerate view, moral conduct and so on\nAre not my fault but are due to the power of the defilements.\nHe should do whatever he can to help me;\nI accept this may cause some pain.",
    "Why does he not help me,\nBut only criticize me?\nWhat use are his qualities to me,\nWhen he keeps them for himself?",
    "He has no compassion for beings\nLiving precariously at the mouth of the lower realms.\nConceited in how his own qualities compare to others,\nHe wants to outrival the learned.",
    "Though he is regarded as my equal,\nI should be his superior,\nSo I will acquire wealth and respect\nEven if it brings conflict.",
    "I will do what I can to make my own good qualities\nApparent to the whole world,\nAnd make sure nobody has heard of\nHis good qualities.",
    "I will hide my own faults\nAnd everyone will praise me instead of him.\nFrom now on, I will get all the wealth,\nAnd they will respect me instead of him.",
    "I will happily watch for a long time,\nAs he is unfairly treated.\nEveryone will laugh at him\nAnd we will all agree he is contemptible.",
    "I hear this miserable wretch\nIs trying to compete with me.\nHow can he equal me in learning, wisdom,\nLooks, intelligence or wealth?",
    "When they hear of my good qualities,\nWhich everyone talks about,\nI will really enjoy the pleasant feeling\nOf a tingling sensation.",
    "In case he has something of his own,\nAs long as he works for me,\nI will force him to give it to me,\nAnd he will get just enough to live on.",
    "I will constantly deprive him of happiness\nAnd inflict harm upon him.\nWhile I have been wandering in saṃsāra,\nHe has hurt me hundreds of times.",
    "Wanting to benefit yourself, mind,\nCountless aeons have been wasted.\nNow you are exhausted,\nAnd you have achieved only suffering.",
    "Those who decisively engage\nIn truly benefitting others,\nIn future will, as the Sage has incontrovertibly said,\nKnow the excellence of having done so.",
    "If, in the past, you had acted this way,\nYour current predicament,\nDevoid of the magnificent bliss of buddhahood,\nWould not have come about.",
    "Therefore, just as you grasp as self\nThe drops of semen and blood from others,\nSo you should regard all others as self\nThrough habitual practice.",
    "On the lookout for others,\nIf you see something on the self’s body,\nSteal it from him\nAnd use it to benefit others.",
    "‘I am happy but others are unhappy.\nI have a high status but others are low.\nI help myself but never others.’\nWhy am I not envious of myself?",
    "I will go without my own happiness,\nAnd instead take on the sufferings of others.\nI will examine my own faults, thinking,\n‘What should I do here?’",
    "Although others have their faults,\nI will treat them as my own faults but,\nWhen I do something even slightly at fault,\nI will admit it openly.",
    "Letting the reputations of others\nEclipse my own,\nI will work for the benefit of all\nLike the lowliest servant.",
    "Imperfection is in my nature,\nSo don’t praise me for some accidental quality.\nShould I even have such a quality,\nNobody needs to know about it.",
    "In short, let whatever harm\nYou have selfishly inflicted on others\nFall upon yourself\nFor the sake of sentient beings.",
    "Don’t be overbearing,\nWith an arrogant manner.\nHave manners like a new bride:\nBe modest, apprehensive and restrained.",
    "That which is to be kept\nAnd that which is to be avoided\nShould be under your control.\nTransgressions should be subjugated.",
    "Despite being given such advice,\nIf you, mind, do not practise accordingly,\nYou will be the source of the faults,\nSo it is you who will be subjugated.",
    "Though you have destroyed me,\nThat is in the past. That time is over.\nNow I have seen you, where can you go?\nI am going to completely crush your arrogance.",
    "Also, give up any idea\nOf benefitting yourself.\nSince I have handed you over to others,\nStop complaining and get to work.",
    "In case I lose concern\nAnd fail to hand you over to sentient beings,\nThen no doubt you will hand me over\nTo the guardians of hell.",
    "That is how you have betrayed me before:\nHanding me over to long-lasting misery.\nRecalling my past resentments,\nI will crush you, selfish mind.",
    "If I want joy,\nI should not pursue my own joy.\nIf I want protection,\nI should always protect others.",
    "The more I look after\nThis body,\nThe more sensitive\nIt becomes.",
    "Having become so sensitive,\nThe whole world will not be enough\nTo fulfil its wishes,\nSo who could give it what it wants?",
    "Unable to get what it wants,\nThe defilements grow and the mind deteriorates\nBut, for someone who does not need anything,\nThere is no end to his riches.",
    "Therefore, I should not allow opportunities\nFor the body’s desires to grow.\nNot grasping attractive objects—\nThat is the best possession to have.",
    "In the end, this unclean form\nCannot prevent itself turning to dust.\nUnable to move and moved only by others—\nWhy grasp that as ‘me’?",
    "What use is this contraption to me,\nLiving or dead?\nWhat is special about this particular lump?\nWhy don’t I overcome pride?",
    "By cherishing the body,\nI have gathered suffering for no purpose,\nSo why have attachment and aggression\nOver something indistinguishable from a block of wood?",
    "Whether I am attending to its needs\nOr it is being eaten by the vultures, etc.\nIt feels neither attachment nor anger,\nAnd yet I have attachment to it.",
    "If it feels no\nAnger when criticized\nNor happiness when praised,\nWhat am I tiring myself out for?",
    "‘I am attached to this body\nBecause I am close to it.’\nSince everyone is attached to their own body,\nWhy have I no joy for them?",
    "Therefore, I will give up this body\nWithout any attachment for the benefit of beings.\nTherefore, though it has many faults,\nI will keep it for use in this work.",
    "Therefore, no more childish behaviour.\nI will follow the wise—\nRemembering their words on concern,\nI will fight off sleep and lethargy.",
    "Like the great, compassionate sons of the conquerors,\nI will bear whatever must be done.\nIf I don’t work at this night and day,\nWhen will my suffering ever end?",
    "Therefore, in order to dispel the obscurations,\nI will withdraw my mind from its mistaken ways,\nAnd continually rest in equipoise\nUpon the perfect object.",
    "All of these factors were taught\nBy the Sage for the sake of wisdom.\nTherefore, those who wish to pacify sufferings\nShould develop wisdom.",
    "Relative and ultimate: these are the two truths.\nThe ultimate is not within\nThe domain of conceptual thought.\nConceptual thought is said to be relative delusion.",
    "We can see two types of people:\nBuddhists and ordinary people.\nThe ordinary, worldly people\nAre refuted by lower Buddhist schools.",
    "The Buddhists, too, have distinct schools of conceptual thought,\nOf which there are higher and lower,\nWho debate and agree upon examples,\nWhile not abandoning conceptual thought in order to achieve the results.",
    "Worldly people see objects as existent\nAnd discriminate them as reality,\nNot as illusion-like. Therefore, on this,\nBuddhists and worldly people are in dispute.",
    "When there is perception of forms and so forth,\nThat is a consensus, not a valid cognition.\nIf the consensus is that something unclean is clean,\nThen it is a delusion to accord it.",
    "For the sake of introducing the worldly,\nThe protector taught in terms of existence.\nIn suchness, there is not even momentary existence.\n‘Then momentariness cannot be a relative truth.’",
    "There is no error, for it is the Buddhist’s relative.\nIn comparison to the worldly, it is seeing reality.\nOtherwise, the ascertainment that women are impure\nWould be refuted by the worldly.",
    "The merit in relation to the illusion-like Conqueror\nIs just as if he really existed.\n‘If sentient beings are illusory,\nHow are they reborn after death?’",
    "For as long as the conditions are assembled,\nEven an illusion will continue to arise.\nSo how could sentient beings really be existent\nJust because their continuity lasts for a long time?",
    "When illusory beings are killed,\nThere is no nonvirtue, because there was no mind.\nMerit and nonvirtue originate\nWith those who possess an illusory mind.",
    "Since mantras and so on do not have that power,\nIllusory minds do not arise from them.\nHaving arisen from a variety of conditions,\nIllusions will vary too,",
    "But nowhere is there a single condition\nWith the ability to create them all.\n‘The ultimate is nirvāṇa.\nSaṃsāra is relative truth. In this way,",
    "If he is in saṃsāra despite being a Buddha,\nWhat is the point of the bodhisattva conduct?’\nIf the continuity of conditions is not interrupted,\nEven an illusion will not be dispelled.",
    "If the continuity of conditions is interrupted,\nIt will not arise, even as relative.\n‘If even delusion does not exist,\nWhat perceives the illusion?’",
    "Since for you the illusion does not exist either,\nWhat do you perceive?\n‘They exist as if they were external,\nBut they are representations, which are mind itself.’",
    "If the illusion is mind itself,\nThen what is seen by what?\nThe protector of the world has taught\nThat mind does not see mind.",
    "Just as the blade of a sword\nCannot cut itself, so it is with the mind.\n‘It is like a lamp—self-illuminating.’",
    "That lamp could never be illuminated,\nFor it was never cloaked in darkness.\n‘The blue of a crystal, etc. depends on something external,\nWhile naturally blue objects do not depend on anything.",
    "Similarly, seeing is in some cases other-dependent,\nAnd in other cases, independent.’\nSomething already blue\nCannot make itself blue.",
    "A lamp, when cognized by a cognition,\nMay be designated ‘that which illuminates’,\nBut what do you claim cognizes\nThe mind as ‘illuminating itself’?",
    "If it is not seen by anyone,\nThen whether it is illuminating or not\nIs like the looks of a barren woman’s daughter—\nDiscussing it is meaningless.",
    "‘If self-awareness did not exist,\nHow could consciousness be remembered?’\nMemory comes from its connection to another experience,\nLike deducing a rat bite from an infection.",
    "‘Since, under the right conditions, a mind can see\nThat of others, how can it not see itself?’\nThrough applying the eye lotion of accomplishment,\nOne will see a vase and not the eye lotion itself.",
    "Cognitions of seeing and hearing\nAre not the objects of negation here.\nHere, we are preventing the cause of suffering:\nTheir discrimination as real.",
    "Illusions are not other than mind\nBut you do not think of them as identical.\nIf they were real, they would have to be other than mind but,\nIf they are not other than mind, they cannot be real.",
    "An illusion is not true, yet it is seen.\nSo it is for the mind which sees.\n‘Saṃsāra must have an existent basis.\nOtherwise, it would be like space.’",
    "If the nonexistent were to rest on the existent,\nCould it then start to function?\nYour mind would be unaided\nAnd completely solitary.",
    "Being free from dualistic perception,\nEveryone would be an enlightened Tathāgata.\nSo what is achieved\nBy designating it mind only?",
    "‘How will your illusion-like understanding\nStop the defilements?\nWhen an apparitional woman is conjured,\nDesire for her arises even in her creator.’",
    "That creator has not abandoned the imprints\nOf the defilements in her appearance.\nThus, when he sees her,\nThe imprints of emptiness are weak.",
    "By meditating on the imprints of emptiness,\nThe imprints of reality will be abandoned.\nBy meditating it is nothing whatsoever,\nThat, too, will then be abandoned,",
    "For when one thinks, ‘It does not exist’,\nThere is no conception of an analysandum.\nIts unreality has then lost its basis,\nSo how can it remain before the conceptual mind?",
    "When neither existence nor nonexistence\nRemain before the mind,\nSince there is no other category at that time,\nThere is a complete non-conceptual pacification.",
    "Just as wish granting jewels\nAnd wish fulfilling trees fulfil hopes,\nSo, too, the conquerors appear\nBy the power of trainees and aspiration prayers.",
    "For example, when the creator\nOf a shrine of Garuḍa had passed away,\nThe shrine still pacified poisons and so on,\nLong after his death.",
    "By holding the bodhisattva conduct,\nThe shrine of the Conqueror is built,\nSo even after the bodhisattva’s nirvāṇa,\nThe benefit of others continues.",
    "‘How could making offerings to\nSomeone without a mind have any result?’\nRemaining in the world and passing into nirvāṇa\nWere taught to be equivalent.",
    "Whether relative or in suchness,\nAccording to the scriptures, there is a result,\nJust as, for example, there is a result\nIn offering to a real Buddha.",
    "‘One is liberated by seeing truth,\nSo what is the point of seeing emptiness?’\nThe scriptures teach\nNo enlightenment without this path.",
    "‘The Mahāyāna is not established.’\nWhy are your scriptures established?\n‘Because they are established for both of us.’\nThey were not established for you at first,",
    "And whatever conditions gave you confidence in them,\nWe have such conditions in the Mahāyāna, too.\nIf truth is the belief of any two others,\nThe Vedas and so forth would also be true.",
    "‘But the Mahāyāna is disputed.’\nYour scriptures are also in dispute—with those of the tīrthikas,\nAs well as with certain other śrāvaka scriptures.\nTherefore, you should abandon them.",
    "‘The root of the doctrine is the monk.’\nIt is difficult to be such a monk.\nA nirvāṇa for the perceptual mind\nIs also difficult to attain.",
    "‘One is liberated by abandoning the defilements.’\nThen liberation would happen immediately,\nYet one sees the power of karma\nEven though there are no defilements.",
    "‘That is only temporary,\nFor there is no direct cause—craving.’\nThey do have craving, though it is without defilements,\nFor don’t they still have fundamental delusion?",
    "By the condition of sensation, there is craving,\nAnd they still have sensation.\nThe objectifying mind\nFor such people, still remains.",
    "Minds without emptiness\nMay cease, but they will arise again,\nLike even settling without formations.\nTherefore, meditate on emptiness.",
    "If you accept the words included in the sutra collection\nAs the Buddha’s teachings,\nWhy do you not accept the majority of the Mahāyāna\nWhich is the same as your sutras?",
    "If all are rejected as the Conqueror’s teachings\nDue to a single point not being included,\nWhy would all not be accepted\nDue to a single point corresponding to your sutras?",
    "If the depths of these words were not fathomed\nEven by someone like Mahākāśyapa,\nWho should reject them\nFor their not being understood by you?",
    "For the sake of those suffering due to confusion,\nOne remains in saṃsāra,\nBut is freed from the extremes of desire and fear:\nThis is the result of emptiness.",
    "Thus, it is incorrect to so criticize\nThe doctrine of emptiness.\nTherefore, you should meditate on emptiness\nWithout entertaining doubts.",
    "Emptiness is the antidote to the darkness\nOf the obscurations of defilements and cognizables.\nHow can those who wish to attain omniscience\nNot hurry to meditate on it?",
    "Something that produces suffering\nShould produce fear,\nBut emptiness pacifies suffering,\nSo why should it produce fear?",
    "If there were something that was ‘I’,\nYou would be right to be afraid.\nBut since there is no such thing as ‘I’,\nWhat is there to be afraid of?",
    "Self is not the teeth, hair or nails.\nIt is neither the bones nor blood.\nIt is neither the mucus nor phlegm,\nNor is it the lymph or pus.",
    "Self is neither the fat nor sweat.\nNeither the lungs nor liver are the self,\nNor are any of the other inner organs.\nSelf is neither the excrement nor urine.",
    "Neither the flesh nor skin are the self,\nNor are warmth or respiration the self.\nThe orifices are not the self,\nAnd none of the six consciousnesses are the self either.",
    "If the cognition of sound were immutable\nThe sound would always be perceived.\nIf there is no cognizable, how is that awareness?\nWhy call this ‘cognition?’",
    "If cognition does not cognize,\nIt would follow that even wood is a cognition.\nWithout a nearby cognizable,\nI would definitely call that ‘not cognizing’.",
    "‘It is the same thing that cognizes form.’\nThen why would it not also hear at the same time?\nIf it is because no sound is nearby\nThen there is also no cognition of it.",
    "How can that which has the nature\nOf sound perception perceive forms?\nA single person might be called father and son,\nBut his intrinsic nature is neither,",
    "Just as lightness, activity and darkness\nAre neither father nor son.\nNobody has ever seen\nVisual perception with the nature of sound perception.",
    "‘Like an actor, it assumes different characteristics.’\nIf it sees, it is not immutable.\n‘It just appears differently.’\nSuch singularity is something unprecedented.",
    "‘Its different characteristics are not real.’\nThen describe its true nature.\n‘It is cognition itself.’\nThen it would follow that all beings are one.",
    "Sentient and insentient would also be one\nBecause they are equal merely in being existent.\nIf the instances are delusions,\nWhat common basis could they have?",
    "Something insentient is not the self,\nBecause of its very insentience, like a vase.\nBecause of its possession of a mind,\nIf it then cognizes, it follows that its non-cognition has been eliminated.",
    "‘The self has not changed.’\nThen how did it become sentient?\nThus, being non-cognizing and free from activity,\nSpace would also be such a ‘self’.",
    "‘If the self does not exist,\nA connection between actions and results is illogical.\nAfter performing an action, it is gone,\nSo, for whom could there be karma?’",
    "It is established for both of us\nThat action and result have different bases\nAnd that a self does not have any role in this.\nSo, is your objection here not pointless?",
    "‘The causal agent is the recipient of its result.’\nNo one ever sees this happen.\nIt is just in dependence upon a single stream of being\nThat the so-called ‘agent’ and ‘experiencer’ are taught.",
    "The past and future minds are not the self,\nBecause they do not exist.\nIf the arising mind were the self,\nThen when it ceased, there would be no more self.",
    "For example, if you split apart\nThe trunks of banana trees, nothing is found.\nSimilarly, if you search for it thoroughly,\nYou will find the self to be no more real than this.",
    "‘If sentient beings do not exist,\nFor whom should we have compassion?’\nCompassion is for those who appear out of confusion:\nThey are accepted for the sake of the results.",
    "‘If there are no sentient beings, who gets the results?’\nThis is true but, nevertheless, they are accepted out of confusion.\nFor the sake of fully pacifying suffering,\nOne should not oppose the delusion of these results.",
    "Confusion about the self increases\nPride, the cause of suffering.\n‘There is no way to resolve this [contradiction].’\nThe meditation on non-self is supreme.",
    "The body is neither the feet nor calves,\nNor is it the thighs or waist,\nAbdomen or back,\nChest or shoulders,",
    "Ribs or hands,\nJoints or cavities,\nInternal organs,\nHead or neck.\nWhat is this body then?",
    "If this body is present as a whole\nAmong its individual parts\nThen part of it consists in each part,\nBut where is the thing itself?",
    "If the body consists of a complete whole\nIn the hands and so forth,\nThere would be as many bodies\nAs there are hands and so forth.",
    "If the body is neither inside nor out,\nNeither within the hands and so forth,\nNor apart from the hands and so forth,\nHow does it exist at all?",
    "Therefore, out of confusion, we think there is a body\nWhere there is none.\nIt is like thinking a heap of stones is a person\nBy some particularity of its arrangement.",
    "While the conditions are assembled,\nThe body will continue to appear as a person.\nSo, while the hands and so forth exist,\nA body continues to appear.",
    "Similarly, what more is a hand\nThan a collection of fingers?\nThese, too, are collections of joints,\nWhich have their own distinct parts.",
    "Even parts have distinct particles,\nAnd those particles have distinct areas.\nEven these distinct areas are not without parts;\nThey are like space. Therefore, not even particles exist.",
    "Accordingly, who could make this analysis,\nAnd still have attachment to dreamlike forms?\nWhen there is no existent body,\nWhat is a man and what is a woman?",
    "If suffering exists in reality,\nWhy does it not prevent joyfulness?\nIf there is happiness, why are those afflicted by pain and so forth\nNot made joyful by sweetness and so forth?",
    "‘It is not experienced because\nIt is overridden by the stronger force.’\nIf something is not experienced,\nHow can it be a sensation?",
    "‘The suffering exists as a subtlety\nWhen its coarseness has been removed.’\nIf this implies it is something other than suffering,\nThen, whatever that is, that is what this ‘subtlety’ is.",
    "If suffering cannot occur\nDue to the arising of its contrary condition,\nShouldn’t such suffering be considered\nMerely the attachment to a concept?",
    "Because of this, meditate upon\nThis analysis as the antidote.\nThe meditation arising from\nThis field of examination is the food of yogins.",
    "If an intermediary connects sense organ and object,\nWhere do they make contact?\nIf there is no intermediary, they are unified.\nSo, what has contact with what?",
    "Particles do not impose upon other particles,\nFor they are identical in having no capacity.\nWithout imposition, they cannot combine.\nWithout combining, they cannot make contact.",
    "‘They make contact despite being partless.’\nHow does this make any sense?\nMaking contact with something partless:\nWhen you see it, will you show me?",
    "It is illogical to make contact with\nConsciousness, which is bodiless,\nAnd likewise for anything composite, because it is nonexistent,\nAs was analysed previously.",
    "If there is no real contact,\nWhat are these sensations arising from?\nWhy go to all this trouble?\nWhat could be harmed by what?",
    "If the one who senses\nAnd the sensations themselves are nonexistent,\nOnce this has been seen,\nHow could craving not be dispelled?",
    "Even what is seen or touched\nIs itself dreamlike and illusion-like.\nSensations are not perceived by mind,\nBecause they arise simultaneously with it.",
    "Although something from before may be remembered after,\nThat is not the experiencing of it.\nA sensation cannot experience itself,\nNor does anything else experience it.",
    "There is nothing existent that experiences sensations.\nTherefore, there are no sensations.\nTherefore, what could ever harm\nThis selfless composite?",
    "Mind does not dwell in the senses,\nNor in forms, etc., nor somewhere between these.\nMind is neither the inner nor outer,\nNor is it found anywhere else.",
    "It is neither within the body, nor apart from it.\nIt is not combined, nor is it something distinct.\nBecause such a thing does not even slightly exist,\nSentient beings are by nature nirvāṇa.",
    "If the cognition exists before the cognizable,\nWhat does it arise from?\nIf cognition is co-emergent with the cognizable,\nWhat does it arise from?",
    "If it exists after the cognizable,\nIn that moment, what does it arise from?\nAccordingly, all dharmas\nShould be understood as non-arising.",
    "‘In that case, there is not really any relative arising,\nSo how can there be two truths?\nIf the relative exists for the Buddha due to others,\nHow can sentient beings transcend suffering?’",
    "The relative is just the discrimination of those other minds.\nIt is not the Buddha’s perspective.\nIf [the effect] is ascertained as arising after [the cause], it exists as relative.\nIf not, it does not have even relative existence.",
    "The understanding and its analysandum\nAre mutually dependent.\nAll analysis is expressed\nIn dependence upon accord with consensus.",
    "If at that time there were an analyst\nAnalysing the analysis\nThen there would be an infinite regress\nBecause that analysis, too, would have to be analyzed.",
    "However, when the analysandum has been analyzed\nThen that analysis has no basis.\nBecause it has no basis, it is non-arising.\nThis is also called ‘nirvāṇa’.",
    "In that case, the existence of this pair\nIs a reality that is extremely difficult to maintain.\nIf objects are established from the sense powers,\nWhat supports the existence of the cognition?",
    "‘Cognition is established from the cognizable.’\nThen what supports the existence of the cognizable?\nIf they are in mutual dependence,\nThen neither one exists.",
    "If there is no father without a son,\nWhere does the son come from?\nThere is no father without a son.\nAccordingly, neither of them exist independently.",
    "‘When a sprout comes from a seed,\nWe acknowledge the existence of the seed.\nSince cognition arises from a cognizable,\nWhy do you not acknowledge the cognizable’s existence?’",
    "When it is acknowledged the seed exists,\nThat cognition is independent of the sprout,\nBut what independently acknowledges the cognition\nComprehending the cognizable?",
    "Worldly ones directly see\nEverything temporal has causes.\nDifferences such as in the segments of a lotus\nAre produced by different causes.",
    "‘What creates the different causes?’\nThey come from previous different causes.\n‘Why is a cause able to produce its effect?’\nIt comes from the power of a previous cause.",
    "If Īśvara is the cause of beings,\nPlease explain what the temporal Īśvara is.\nIf you say, ‘the elements’, that is fine,\nBut why trouble yourself over a mere name?",
    "Furthermore, since the earth and so forth are multiple,\nImpermanent, inanimate, not deities,\nSuitable to be trodden on and impure,\nThey are not Īśvara.",
    "Space is not Īśvara because it is inanimate.\nHe is not the self because that was refuted previously.\nSince it is inconceivable to describe\nA creator who is inconceivable, what would be the point of trying?",
    "What could he want to create anyway?\nDo you not claim that the self, the earth, etc.\nAnd even Īśvara’s own nature are sempiternal?\nCognitions arise from cognizables,",
    "And beginningless happiness and suffering come from actions.\nSo, what is it you say he has created?\nIf the cause has no beginning,\nHow can the effect begin?",
    "How could his creations not be sempiternal,\nWhen he depends upon nothing external?\nIf there is nothing that was not created by him,\nWhat could he depend upon?",
    "If he were dependent, the occurrence conditions\nWould be the cause, not Īśvara.\nWhen assembled, he is powerless not to create;\nWhen absent, he is powerless to create.",
    "If Īśvara creates without wanting to,\nHe is affected by an external power.\nIf he creates only when he wishes, the effect depends on his wishes.\nHow then is he ‘The Almighty’ [Īśvara]?",
    "For those who assert sempiternal particles,\nThe refutation was completed previously.\nThe position of the Sāṃkhyas is that\nThe cause of beings is a permanent, primal substance.",
    "Its qualities are ‘purity’, ‘activity’ and ‘darkness’.\nWhile they remain in equilibrium,\nThey are called the ‘primal substance’.\nManifestations are said to be their disequilibrium.",
    "A triple nature that is also singular\nIs illogical. There is no such thing.\nThe three qualities also do not exist\nBecause each of them would also have three parts.",
    "Without the qualities, the existence of sound\nAnd so forth also becomes extremely implausible.\nNor can the insentient, such as cloth,\nContain pleasure and so forth.",
    "‘They are caused by the substantial bare elements.’\nWasn’t the analysis of such substances already completed?\nAlso, the pleasure and so forth in the primal substance were your causes, not the bare elements.\nCloth and so forth do not arise from pleasure and so forth.",
    "Rather, pleasure and so forth arise from cloth and so forth.\nApart from this, there is no pleasure and so forth.\nSempiternal pleasure and so forth\nHave never been perceived.",
    "If pleasure and so forth are essentially manifest,\nWhy are they not experienced?\n‘They become subtle.’\nHow can something gross also be subtle?",
    "‘It becomes subtle by the elimination of the gross.’\nThen the gross and subtle states are both impermanent.\nIn this way, why not accept\nThat all such things are impermanent?",
    "If the gross state is nothing other than pleasure,\nIt is evident that pleasure is impermanent.\n‘Whatever does not already exist\nCannot arise because of its not existing.’",
    "Although you deny that manifestations can arise\nFrom their nonexistence, you also assert it.\nIf effects abide in their causes,\nTo eat food would be to eat excrement.",
    "For the money you spent on cotton, you should have instead\nBought cotton seeds and worn them.\n‘The worldly fail to see it due to delusion.’\nYet, someone who knows the reality is in the same predicament,",
    "And since that knowledge of reality exists even for\nThe worldly, why do they not see it?\n‘The worldly do not have valid cognition.’\nThen their seeing of the manifestations would also be untrue.",
    "‘If valid cognition is deluded,\nAre your analyses not false?\nIf reality is emptiness,\nMeditation for the sake of it is unreasonable.’",
    "With no connection to an object of examination\nThere is no grasping of its nonexistence.\nTherefore, whatever the false object may be,\nIts nonexistence is clearly false.",
    "When the son dies in a dream,\nThe discrimination that ‘he does not exist’\nCounters the discrimination that he exists,\nEven though it is false.",
    "Therefore, on this analysis,\nNothing exists without a cause,\nNor abides in its conditions,\nWhether individually or combined.",
    "Nor does it come from other,\nNor stay, nor go.\nThis is what deluded ones take as real,\nBut how is it different from an illusion?",
    "Whatever manifests by illusion\nAnd whatever manifests by causes,\nExamine from where it could come\nAnd to where it could go.",
    "Whatever it is, it is seen only in relation to something else.\nOtherwise, it is not seen.\nIt is fabricated, like a reflection.\nHow can there be reality in that?",
    "For something that already exists,\nWhat cause does it require?\nAnd if it does not exist,\nWhat cause does it require?",
    "Even a billion causes\nCannot alter nonexistence.\nHow can a state of nonexistence be existent,\nOr become existent?",
    "If its existence is impossible during its nonexistence,\nWhen could it ever become something existent?\nWhile its existence has not yet begun,\nIts nonexistence has not yet been lost.",
    "If its nonexistence has not been lost,\nIt is impossible for it to exist.\nNor can the existent become nonexistent,\nBecause it would follow that it would have two intrinsic natures.",
    "In this way, there is no cessation.\nNor is there any existence.\nBecause of this, all these beings\nAre forever neither arising nor ceasing.",
    "Dreamlike beings,\nWhen analysed, are like banana trees.\nIn suchness, there is no distinction\nBetween nirvāṇa and non-nirvāṇa.",
    "What is there to gain and what is there to lose\nOf things which are, in this way, empty?\nWho exists to respect me,\nOr to despise me?",
    "Where do happiness and suffering come from?\nWhat is there to be joyful or miserable about?\nWhen I try to find reality itself,\nWho has craving and what is there to crave?",
    "When analysed, what lives in this world\nAnd what can die in it?\nWhat can arise and what has ever arisen?\nWhat friends or relatives are there?",
    "All is like space.\nMay we come to fully understand this.\nFor those who want happiness,\nThe causes of conflict and excitement",
    "Create intense disturbance and hysteria.\nWe are tormenting, fighting and arguing with one another,\nCutting and stabbing one another.\nBy such nonvirtues, we endure great difficulties.",
    "Having enjoyed so much happiness,\nIn happy rebirths again and again,\nAfter death, it ends, and one suffers,\nFalling into torment for a long time.",
    "Within conditioned existence, there are many precipices,\nFor there is no truth in it.\nWhere there is conditioned existence, there is no reality,\nFor they are incompatible.",
    "There is no way to truly exemplify\nThis unending ocean of unbearable suffering.\nIt is where we lack strength.\nIt is where life is short.",
    "It is where we are worn out, striving to live and get by,\nWhere we are exhausted by hunger and sickness,\nWhere we sleep and where we cause harm,\nAnd where we meaninglessly associate with the childish and with friends.",
    "So life swiftly passes by without any meaning,\nAnd a remedy is extremely difficult to find.\nHow can we find a way\nTo dispel habitual distraction?",
    "It is where demons are striving to cast us\nInto the great lower realms.\nIt is where overcoming doubts is hard\nAmong its many mistaken paths.",
    "An opportunity like this will be difficult to find again,\nAnd the presence of Buddhas will be extremely difficult to find.\nIt is difficult to escape the river of defilements.\nAlas! The suffering just goes on and on.",
    "Although the sufferings are intense,\nSome cannot recognize their own misery.\nAlas! It is only right to feel pity\nFor those who dwell in the rivers of suffering.",
    "This is like, for example, bathing again and again,\nAnd then stepping into a fire again and again,\nProclaiming one’s happiness,\nWhile being in immense pain.",
    "So, carrying on as if\nThere were no old age or death,\nThey are first subjected to death\nAnd then fall into the unbearable lower realms.",
    "When will I be able to pacify\nThese unbearable fires of suffering\nWith a rain of accumulated happiness\nFalling from clouds of stored up merit?",
    "Having fostered the non-conceptual\nAnd devotedly accumulated merits,\nWhen will I show emptiness\nTo those lost in conceptualization?",
    "By whatever virtue there is\nIn my undertaking\nTo enter the bodhisattva conduct,\nMay all beings enter the bodhisattva conduct.",
    "By my merit,\nMay all those in all directions\nAfflicted with physical and mental suffering\nAttain oceans of happiness and joy.",
    "As long as they remain in saṃsāra,\nMay their happiness never fail.\nMay beings attain the uninterrupted\nHappiness of a bodhisattva.",
    "In however many hells\nThere may be in existence,\nMay all those living creatures\nHave the bliss and joy of Sukhāvatī.",
    "May those tormented by the cold find warmth,\nAnd may boundless waters pour\nFrom the clouds of bodhisattvas,\nCooling those tormented by the heat.",
    "May the forests of razors\nBecome divine groves.\nMay the trees of Śālmari\nGrow into wish fulfilling trees.",
    "May the realms of hell become places of joy,\nCovered with vast pools, fragrant with lotus flowers,\nWith calls of wild ducks, geese and swans\nResounding gently in the air.",
    "May its burning pyres become heaps of jewels.\nMay its molten earth become a clear, crystal floor.\nMay its crushing mountains become\nCelestial palaces of worship, filled with Buddhas.",
    "May its showers of embers, burning rocks and fiery razors\nFrom now on be a rain of flowers.\nMay the conflict of armed violence\nFrom now on be a casting of flowers.",
    "May those submerged in the torrents of hell,\nTheir flesh completely incinerated from their lily-white bones,\nAttain, from this virtue, the bodies of gods,\nAnd dwell among goddesses in gentle, divine rivers.",
    "‘Why are the servants of the Lord of Death and his dreadful crows and vultures suddenly afraid?\nWhose power clears away the enveloping darkness, bringing joy and happiness?’\nWhen they look up, may they see the blazing form of Vajrapāṇi in the sky,\nAnd the power of their intense joy clearing away all negativities, may they go to join him.",
    "Seeing the glittering fires of hell\nExtinguished by rains of flowers mixed with scented water,\nMay they wonder what could have brought such happiness,\nAnd may these denizens of hell see Padmapāṇi himself.",
    "‘Friends, come here quickly. Don’t be afraid.\nHe forcefully dispels all our suffering and brings the power of joy!\nA protector of all beings, who has generated bodhicitta and kindness,\nA blazing youth with hair in knotted locks delivers us from these horrors.",
    "‘See one hundred gods offer their crowns at his lotus feet.\nA rain of flowers falls upon his head, his eyes moist with compassion.\nThousands of goddesses sing his praises atop magnificent pavilions.’\nUpon seeing Mañjughoṣa, may the denizens of hell cry out in joy.",
    "By the roots of my virtue, may the denizens of hell,\nSeeing the cooling, fragrant rains of happiness fall\nFrom the stainless clouds of the bodhisattvas such as Samantabhadra,\nBe filled with joy.",
    "May animals be freed\nFrom the horrors of preying upon one another.\nMay ghosts have happiness\nLike that of the Northern Continent.",
    "May their hunger be sated,\nAnd may they always be bathed and refreshed\nBy streams of milk\nFlowing from the hands of Avalokiteśvara.",
    "May the blind see\nAnd may the deaf hear.\nMay mothers give birth without any pain\nLike Māyādevī herself.",
    "May the naked find clothes,\nThe hungry find food,\nAnd the thirsty find water\nAnd delightful, refreshing drinks.",
    "May the poor acquire wealth.\nMay the unhappy and miserable find joy.\nMay the distressed be placated,\nAnd may they have confidence and stability.",
    "Wherever sentient beings are unwell,\nMay their sicknesses quickly disappear.\nMay the diseases affecting every living creature\nCease and never occur again.",
    "May those who are afraid be without fear.\nMay those who are bound be freed.\nMay the weak find strength\nAnd may their minds be calmed.",
    "May all those travelling abroad\nBe happy wherever they may go and,\nFor whatever purpose they are travelling,\nMay they achieve it without any difficulties.",
    "May all those aboard boats and ships\nAchieve whatever they set out to do and,\nHaving happily returned to their own shores,\nMay they be reunited with their loved ones.",
    "May those who have lost their paths\nEncounter fellow travellers,\nAnd proceed to their destinations with ease,\nUnmolested by bandits, wild animals and so on.",
    "May those who are lost and alone in wildernesses,\nChildren and the elderly without any protector,\nThose who are unconscious, mentally disturbed or insane,\nBe protected by the gods.",
    "May they never lack the eight freedoms.\nMay they have faith, wisdom and kindness,\nEat appropriate food, have good conduct,\nAnd remember their former rebirths.",
    "May they have inexhaustible wealth\nLike that of the bodhisattva Gaganagañja.\nMay they be able to do as they please,\nWithout conflict or violence.",
    "May beings with little splendour\nCome to have magnificent glory.\nMay those who are emaciated or ugly\nCome to have radiant beauty.",
    "May women everywhere in the world\nBe reborn as men.\nMay the lowly achieve highness\nAnd crush any arrogance.",
    "By my merit,\nMay all sentient beings without exception\nAbandon all nonvirtue\nAnd always practise virtue.",
    "May they never be separated from bodhicitta\nAnd may they practise the bodhisattva conduct.\nMay they be supported by the Buddhas\nAnd abandon the actions of Māra.",
    "May all sentient beings\nHave immeasurably long lives.\nMay they live in constant happiness\nWhere the word ‘death’ is never even heard.",
    "Everywhere may there be\nGardens of wish fulfilling trees\nFilled with Buddhas and bodhisattvas\nAnd resounding with the delightful sounds of dharma.",
    "Everywhere may the land be\nWithout stones, etc.,\nSmooth like the palm of a hand,\nAnd even like a lapis lazuli.",
    "May many mandala circles\nOf many bodhisattvas\nAdorn the face of the earth,\nBeautifying it with their natural radiance.",
    "May all embodied beings\nContinuously hear sounds of dharma\nFrom all the birds, trees,\nRays of light and even space itself.",
    "May they always meet with the Buddhas and their sons,\nAnd with limitless clouds of offerings\nMay they pay homage\nTo the supreme ones among all beings.",
    "May the gods bring timely rains,\nAnd may crops be abundant.\nMay kings reign in accord with dharma,\nAnd may the people prosper.",
    "May medicines be effective\nAnd may mantra recitation bring accomplishment.\nMay ḍākinīs and ogres\nHave compassionate minds.",
    "May no sentient being ever\nBe in pain, practise nonvirtue,\nBe afraid or abused.\nMay they never be unhappy.",
    "In the monasteries, may reading\nAnd recitation flourish and endure.\nMay the saṅgha always be harmonious,\nAnd may they be firmly established.",
    "May monks who wish to train\nFind places of solitude and,\nAbandoning all distraction,\nMay they meditate with peace of mind.",
    "May nuns have material support,\nAnd may they be free from conflict or danger.\nMay all monastics\nNever let their moral conduct be damaged.",
    "May the immoral tire of their ways\nAnd may their nonvirtues come to an end.\nAttaining a happy rebirth,\nMay their conduct never be impaired.",
    "May the learned be respected\nAnd find the support they need.\nMay their minds be pure\nAnd may they be renowned in every direction.",
    "In future lives may nobody experience suffering,\nAnd may whatever they do be without difficulties.\nMay they quickly achieve buddhahood\nWith a physical form surpassing that of a god.",
    "May all sentient beings\nMake many offerings to all the Buddhas.\nMay their happiness\nBe the inconceivable bliss of a Buddha.",
    "May the wishes of bodhisattvas\nFor the benefit of beings be accomplished,\nAnd may all beings have everything\nThe Protectors wish for them.",
    "Similarly, may all śrāvakas\nAnd pratyekabuddhas have happiness.",
    "Until I have reached the ‘Joyous’ bhūmi,\nThrough the kindness of Mañjughoṣa,\nMay I remember my previous lives\nAnd attain ordination.",
    "May I live with simple food\nAnd have simple needs,\nAnd throughout all my lives\nMay I find perfect solitude.",
    "If I ever wish to look upon him\nOr ask him the slightest question,\nMay I see the protector\nMañjughoṣa himself, without any hindrance.",
    "In order to accomplish the benefit\nOf all sentient beings, as limitless as space,\nMay my conduct\nBe like that of Mañjughoṣa.",
    "As long as space endures\nThere will be living beings.\nFor that long may I remain\nTo dispel their suffering.",
    "However they may be suffering,\nMay all their suffering ripen in me.\nMay the bodhisattva saṅgha\nBring happiness to the world.",
    "May the teachings, which are the only medicine\nFor suffering and which are the source of all happiness,\nBe honoured and respected,\nAnd may they long remain.",
    "I prostrate to Mañjughoṣa,\nBy whose kindness my mind turned to virtue,\nAnd I prostrate to my spiritual masters,\nBy whose kindness I matured."
  ],
  "captions": [
    "Chapter 1, Verse 1",
    "Chapter 1, Verse 2",
    "Chapter 1, Verse 3",
    "Chapter 1, Verse 4",
    "Chapter 1, Verse 5",
    "Chapter 1, Verse 6",
    "Chapter 1, Verse 7",
    "Chapter 1, Verse 8",
    "Chapter 1, Verse 9",
    "Chapter 1, Verse 10",
    "Chapter 1, Verse 11",
    "Chapter 1, Verse 12",
    "Chapter 1, Verse 13",
    "Chapter 1, Verse 14",
    "Chapter 1, Verse 15",
    "Chapter 1, Verse 16",
    "Chapter 1, Verse 17",
    "Chapter 1, Verse 18",
    "Chapter 1, Verse 19",
    "Chapter 1, Verse 20",
    "Chapter 1, Verse 21",
    "Chapter 1, Verse 22",
    "Chapter 1, Verse 23",
    "Chapter 1, Verse 24",
    "Chapter 1, Verse 25",
    "Chapter 1, Verse 26",
    "Chapter 1, Verse 27",
    "Chapter 1, Verse 28",
    "Chapter 1, Verse 29",
    "Chapter 1, Verse 30",
    "Chapter 1, Verse 31",
    "Chapter 1, Verse 32",
    "Chapter 1, Verse 33",
    "Chapter 1, Verse 34",
    "Chapter 1, Verse 35",
    "Chapter 1, Verse 36",
    "Chapter 2, Verse 1",
    "Chapter 2, Verse 2",
    "Chapter 2, Verse 3",
    "Chapter 2, Verse 4",
    "Chapter 2, Verse 5",
    "Chapter 2, Verse 6",
    "Chapter 2, Verse 7",
    "Chapter 2, Verse 8",
    "Chapter 2, Verse 9",
    "Chapter 2, Verse 10",
    "Chapter 2, Verse 11",
    "Chapter 2, Verse 12",
    "Chapter 2, Verse 13",
    "Chapter 2, Verse 14",
    "Chapter 2, Verse 15",
    "Chapter 2, Verse 16",
    "Chapter 2, Verse 17",
    "Chapter 2, Verse 18",
    "Chapter 2, Verse 19",
    "Chapter 2, Verse 20",
    "Chapter 2, Verse 21",
    "Chapter 2, Verse 22",
    "Chapter 2, Verse 23",
    "Chapter 2, Verse 24",
    "Chapter 2, Verse 25",
    "Chapter 2, Verse 26",
    "Chapter 2, Verse 27",
    "Chapter 2, Verse 28",
    "Chapter 2, Verse 29",
    "Chapter 2, Verse 30",
    "Chapter 2, Verse 31",
    "Chapter 2, Verse 32",
    "Chapter 2, Verse 33",
    "Chapter 2, Verse 34",
    "Chapter 2, Verse 35",
    "Chapter 2, Verse 36",
    "Chapter 2, Verse 37",
    "Chapter 2, Verse 38",
    "Chapter 2, Verse 39",
    "Chapter 2, Verse 40",
    "Chapter 2, Verse 41",
    "Chapter 2, Verse 42",
    "Chapter 2, Verse 43",
    "Chapter 2, Verse 44",
    "Chapter 2, Verse 45",
    "Chapter 2, Verse 46",
    "Chapter 2, Verse 47",
    "Chapter 2, Verse 48",
    "Chapter 2, Verse 49",
    "Chapter 2, Verse 50",
    "Chapter 2, Verse 51",
    "Chapter 2, Verse 52",
    "Chapter 2, Verse 53",
    "Chapter 2, Verse 54",
    "Chapter 2, Verse 55",
    "Chapter 2, Verse 56",
    "Chapter 2, Verse 57",
    "Chapter 2, Verse 58",
    "Chapter 2, Verse 59",
    "Chapter 2, Verse 60",
    "Chapter 2, Verse 61",
    "Chapter 2, Verse 62",
    "Chapter 2, Verse 63",
    "Chapter 2, Verse 64",
    "Chapter 2, Verse 65",
    "Chapter 3, Verse 1",
    "Chapter 3, Verse 2",
    "Chapter 3, Verse 3",
    "Chapter 3, Verse 4",
    "Chapter 3, Verse 5",
    "Chapter 3, Verse 6",
    "Chapter 3, Verse 7",
    "Chapter 3, Verse 8",
    "Chapter 3, Verse 9",
    "Chapter 3, Verse 10",
    "Chapter 3, Verse 11",
    "Chapter 3, Verse 12",
    "Chapter 3, Verse 13",
    "Chapter 3, Verse 14",
    "Chapter 3, Verse 15",
    "Chapter 3, Verse 16",
    "Chapter 3, Verse 17",
    "Chapter 3, Verse 18",
    "Chapter 3, Verse 19",
    "Chapter 3, Verse 20",
    "Chapter 3, Verse 21",
    "Chapter 3, Verse 22",
    "Chapter 3, Verse 23",
    "Chapter 3, Verse 24",
    "Chapter 3, Verse 25",
    "Chapter 3, Verse 26",
    "Chapter 3, Verse 27",
    "Chapter 3, Verse 28",
    "Chapter 3, Verse 29",
    "Chapter 3, Verse 30",
    "Chapter 3, Verse 31",
    "Chapter 3, Verse 32",
    "Chapter 3, Verse 33",
    "Chapter 3, Verse 34",
    "Chapter 4, Verse 1",
    "Chapter 4, Verse 2",
    "Chapter 4, Verse 3",
    "Chapter 4, Verse 4",
    "Chapter 4, Verse 5",
    "Chapter 4, Verse 6",
    "Chapter 4, Verse 7",
    "Chapter 4, Verse 8",
    "Chapter 4, Verse 9",
    "Chapter 4, Verse 10",
    "Chapter 4, Verse 11",
    "Chapter 4, Verse 12",
    "Chapter 4, Verse 13",
    "Chapter 4, Verse 14",
    "Chapter 4, Verse 15",
    "Chapter 4, Verse 16",
    "Chapter 4, Verse 17",
    "Chapter 4, Verse 18",
    "Chapter 4, Verse 19",
    "Chapter 4, Verse 20",
    "Chapter 4, Verse 21",
    "Chapter 4, Verse 22",
    "Chapter 4, Verse 23",
    "Chapter 4, Verse 24",
    "Chapter 4, Verse 25",
    "Chapter 4, Verse 26",
    "Chapter 4, Verse 27",
    "Chapter 4, Verse 28",
    "Chapter 4, Verse 29",
    "Chapter 4, Verse 30",
    "Chapter 4, Verse 31",
    "Chapter 4, Verse 32",
    "Chapter 4, Verse 33",
    "Chapter 4, Verse 34",
    "Chapter 4, Verse 35",
    "Chapter 4, Verse 36",
    "Chapter 4, Verse 37",
    "Chapter 4, Verse 38",
    "Chapter 4, Verse 39",
    "Chapter 4, Verse 40",
    "Chapter 4, Verse 41",
    "Chapter 4, Verse 42",
    "Chapter 4, Verse 43",
    "Chapter 4, Verse 44",
    "Chapter 4, Verse 45",
    "Chapter 4, Verse 46",
    "Chapter 4, Verse 47",
    "Chapter 4, Verse 48",
    "Chapter 5, Verse 1",
    "Chapter 5, Verse 2",
    "Chapter 5, Verse 3",
    "Chapter 5, Verse 4",
    "Chapter 5, Verse 5",
    "Chapter 5, Verse 6",
    "Chapter 5, Verse 7",
    "Chapter 5, Verse 8",
    "Chapter 5, Verse 9",
    "Chapter 5, Verse 10",
    "Chapter 5, Verse 11",
    "Chapter 5, Verse 12",
    "Chapter 5, Verse 13",
    "Chapter 5, Verse 14",
    "Chapter 5, Verse 15",
    "Chapter 5, Verse 16",
    "Chapter 5, Verse 17",
    "Chapter 5, Verse 18",
    "Chapter 5, Verse 19",
    "Chapter 5, Verse 20",
    "Chapter 5, Verse 21",
    "Chapter 5, Verse 22",
    "Chapter 5, Verse 23",
    "Chapter 5, Verse 24",
    "Chapter 5, Verse 25",
    "Chapter 5, Verse 26",
    "Chapter 5, Verse 27",
    "Chapter 5, Verse 28",
    "Chapter 5, Verse 29",
    "Chapter 5, Verse 30",
    "Chapter 5, Verse 31",
    "Chapter 5, Verse 32",
    "Chapter 5, Verse 33",
    "Chapter 5, Verse 34",
    "Chapter 5, Verse 35",
    "Chapter 5, Verse 36",
    "Chapter 5, Verse 37",
    "Chapter 5, Verse 38",
    "Chapter 5, Verse 39",
    "Chapter 5, Verse 40",
    "Chapter 5, Verse 41",
    "Chapter 5, Verse 42",
    "Chapter 5, Verse 43",
    "Chapter 5, Verse 44",
    "Chapter 5, Verse 45",
    "Chapter 5, Verse 46",
    "Chapter 5, Verse 47",
    "Chapter 5, Verse 48",
    "Chapter 5, Verse 49",
    "Chapter 5, Verse 50",
    "Chapter 5, Verse 51",
    "Chapter 5, Verse 52",
    "Chapter 5, Verse 53",
    "Chapter 5, Verse 54",
    "Chapter 5, Verse 55",
    "Chapter 5, Verse 56",
    "Chapter 5, Verse 57",
    "Chapter 5, Verse 58",
    "Chapter 5, Verse 59",
    "Chapter 5, Verse 60",
    "Chapter 5, Verse 61",
    "Chapter 5, Verse 62",
    "Chapter 5, Verse 63",
    "Chapter 5, Verse 64",
    "Chapter 5, Verse 65",
    "Chapter 5, Verse 66",
    "Chapter 5, Verse 67",
    "Chapter 5, Verse 68",
    "Chapter 5, Verse 69",
    "Chapter 5, Verse 70",
    "Chapter 5, Verse 71",
    "Chapter 5, Verse 72",
    "Chapter 5, Verse 73",
    "Chapter 5, Verse 74",
    "Chapter 5, Verse 75",
    "Chapter 5, Verse 76",
    "Chapter 5, Verse 77",
    "Chapter 5, Verse 78",
    "Chapter 5, Verse 79",
    "Chapter 5, Verse 80",
    "Chapter 5, Verse 81",
    "Chapter 5, Verse 82",
    "Chapter 5, Verse 83",
    "Chapter 5, Verse 84",
    "Chapter 5, Verse 85",
    "Chapter 5, Verse 86",
    "Chapter 5, Verse 87",
    "Chapter 5, Verse 88",
    "Chapter 5, Verse 89",
    "Chapter 5, Verse 90",
    "Chapter 5, Verse 91",
    "Chapter 5, Verse 92",
    "Chapter 5, Verse 93",
    "Chapter 5, Verse 94",
    "Chapter 5, Verse 95",
    "Chapter 5, Verse 96",
    "Chapter 5, Verse 97",
    "Chapter 5, Verse 98",
    "Chapter 5, Verse 99",
    "Chapter 5, Verse 100",
    "Chapter 5, Verse 101",
    "Chapter 5, Verse 102",
    "Chapter 5, Verse 103",
    "Chapter 5, Verse 104",
    "Chapter 5, Verse 105",
    "Chapter 5, Verse 106",
    "Chapter 5, Verse 107",
    "Chapter 5, Verse 108",
    "Chapter 5, Verse 109",
    "Chapter 6, Verse 1",
    "Chapter 6, Verse 2",
    "Chapter 6, Verse 3",
    "Chapter 6, Verse 4",
    "Chapter 6, Verse 5",
    "Chapter 6, Verse 6",
    "Chapter 6, Verse 7",
    "Chapter 6, Verse 8",
    "Chapter 6, Verse 9",
    "Chapter 6, Verse 10",
    "Chapter 6, Verse 11",
    "Chapter 6, Verse 12",
    "Chapter 6, Verse 13",
    "Chapter 6, Verse 14",
    "Chapter 6, Verse 15",
    "Chapter 6, Verse 16",
    "Chapter 6, Verse 17",
    "Chapter 6, Verse 18",
    "Chapter 6, Verse 19",
    "Chapter 6, Verse 20",
    "Chapter 6, Verse 21",
    "Chapter 6, Verse 22",
    "Chapter 6, Verse 23",
    "Chapter 6, Verse 24",
    "Chapter 6, Verse 25",
    "Chapter 6, Verse 26",
    "Chapter 6, Verse 27",
    "Chapter 6, Verse 28",
    "Chapter 6, Verse 29",
    "Chapter 6, Verse 30",
    "Chapter 6, Verse 31",
    "Chapter 6, Verse 32",
    "Chapter 6, Verse 33",
    "Chapter 6, Verse 34",
    "Chapter 6, Verse 35",
    "Chapter 6, Verse 36",
    "Chapter 6, Verse 37",
    "Chapter 6, Verse 38",
    "Chapter 6, Verse 39",
    "Chapter 6, Verse 40",
    "Chapter 6, Verse 41",
    "Chapter 6, Verse 42",
    "Chapter 6, Verse 43",
    "Chapter 6, Verse 44",
    "Chapter 6, Verse 45",
    "Chapter 6, Verse 46",
    "Chapter 6, Verse 47",
    "Chapter 6, Verse 48",
    "Chapter 6, Verse 49",
    "Chapter 6, Verse 50",
    "Chapter 6, Verse 51",
    "Chapter 6, Verse 52",
    "Chapter 6, Verse 53",
    "Chapter 6, Verse 54",
    "Chapter 6, Verse 55",
    "Chapter 6, Verse 56",
    "Chapter 6, Verse 57",
    "Chapter 6, Verse 58",
    "Chapter 6, Verse 59",
    "Chapter 6, Verse 60",
    "Chapter 6, Verse 61",
    "Chapter 6, Verse 62",
    "Chapter 6, Verse 63",
    "Chapter 6, Verse 64",
    "Chapter 6, Verse 65",
    "Chapter 6, Verse 66",
    "Chapter 6, Verse 67",
    "Chapter 6, Verse 68",
    "Chapter 6, Verse 69",
    "Chapter 6, Verse 70",
    "Chapter 6, Verse 71",
    "Chapter 6, Verse 72",
    "Chapter 6, Verse 73",
    "Chapter 6, Verse 74",
    "Chapter 6, Verse 75",
    "Chapter 6, Verse 76",
    "Chapter 6, Verse 77",
    "Chapter 6, Verse 78",
    "Chapter 6, Verse 79",
    "Chapter 6, Verse 80",
    "Chapter 6, Verse 81",
    "Chapter 6, Verse 82",
    "Chapter 6, Verse 83",
    "Chapter 6, Verse 84",
    "Chapter 6, Verse 85",
    "Chapter 6, Verse 86",
    "Chapter 6, Verse 87",
    "Chapter 6, Verse 88",
    "Chapter 6, Verse 89",
    "Chapter 6, Verse 90",
    "Chapter 6, Verse 91",
    "Chapter 6, Verse 92",
    "Chapter 6, Verse 93",
    "Chapter 6, Verse 94",
    "Chapter 6, Verse 95",
    "Chapter 6, Verse 96",
    "Chapter 6, Verse 97",
    "Chapter 6, Verse 98",
    "Chapter 6, Verse 99",
    "Chapter 6, Verse 100",
    "Chapter 6, Verse 101",
    "Chapter 6, Verse 102",
    "Chapter 6, Verse 103",
    "Chapter 6, Verse 104",
    "Chapter 6, Verse 105",
    "Chapter 6, Verse 106",
    "Chapter 6, Verse 107",
    "Chapter 6, Verse 108",
    "Chapter 6, Verse 109",
    "Chapter 6, Verse 110",
    "Chapter 6, Verse 111",
    "Chapter 6, Verse 112",
    "Chapter 6, Verse 113",
    "Chapter 6, Verse 114",
    "Chapter 6, Verse 115",
    "Chapter 6, Verse 116",
    "Chapter 6, Verse 117",
    "Chapter 6, Verse 118",
    "Chapter 6, Verse 119",
    "Chapter 6, Verse 120",
    "Chapter 6, Verse 121",
    "Chapter 6, Verse 122",
    "Chapter 6, Verse 123",
    "Chapter 6, Verse 124",
    "Chapter 6, Verse 125",
    "Chapter 6, Verse 126",
    "Chapter 6, Verse 127",
    "Chapter 6, Verse 128",
    "Chapter 6, Verse 129",
    "Chapter 6, Verse 130",
    "Chapter 6, Verse 131",
    "Chapter 6, Verse 132",
    "Chapter 6, Verse 133",
    "Chapter 6, Verse 134",
    "Chapter 7, Verse 1",
    "Chapter 7, Verse 2",
    "Chapter 7, Verse 3",
    "Chapter 7, Verse 4",
    "Chapter 7, Verse 5",
    "Chapter 7, Verse 6",
    "Chapter 7, Verse 7",
    "Chapter 7, Verse 8",
    "Chapter 7, Verse 9",
    "Chapter 7, Verse 10",
    "Chapter 7, Verse 11",
    "Chapter 7, Verse 12",
    "Chapter 7, Verse 13",
    "Chapter 7, Verse 14",
    "Chapter 7, Verse 15",
    "Chapter 7, Verse 16",
    "Chapter 7, Verse 17",
    "Chapter 7, Verse 18",
    "Chapter 7, Verse 19",
    "Chapter 7, Verse 20",
    "Chapter 7, Verse 21",
    "Chapter 7, Verse 22",
    "Chapter 7, Verse 23",
    "Chapter 7, Verse 24",
    "Chapter 7, Verse 25",
    "Chapter 7, Verse 26",
    "Chapter 7, Verse 27",
    "Chapter 7, Verse 28",
    "Chapter 7, Verse 29",
    "Chapter 7, Verse 30",
    "Chapter 7, Verse 31",
    "Chapter 7, Verse 32",
    "Chapter 7, Verse 33",
    "Chapter 7, Verse 34",
    "Chapter 7, Verse 35",
    "Chapter 7, Verse 36",
    "Chapter 7, Verse 37",
    "Chapter 7, Verse 38",
    "Chapter 7, Verse 39",
    "Chapter 7, Verse 40",
    "Chapter 7, Verse 41",
    "Chapter 7, Verse 42",
    "Chapter 7, Verse 43",
    "Chapter 7, Verse 44",
    "Chapter 7, Verse 45",
    "Chapter 7, Verse 46",
    "Chapter 7, Verse 47",
    "Chapter 7, Verse 48",
    "Chapter 7, Verse 49",
    "Chapter 7, Verse 50",
    "Chapter 7, Verse 51",
    "Chapter 7, Verse 52",
    "Chapter 7, Verse 53",
    "Chapter 7, Verse 54",
    "Chapter 7, Verse 55",
    "Chapter 7, Verse 56",
    "Chapter 7, Verse 57",
    "Chapter 7, Verse 58",
    "Chapter 7, Verse 59",
    "Chapter 7, Verse 60",
    "Chapter 7, Verse 61",
    "Chapter 7, Verse 62",
    "Chapter 7, Verse 63",
    "Chapter 7, Verse 64",
    "Chapter 7, Verse 65",
    "Chapter 7, Verse 66",
    "Chapter 7, Verse 67",
    "Chapter 7, Verse 68",
    "Chapter 7, Verse 69",
    "Chapter 7, Verse 70",
    "Chapter 7, Verse 71",
    "Chapter 7, Verse 72",
    "Chapter 7, Verse 73",
    "Chapter 7, Verse 74",
    "Chapter 7, Verse 75",
    "Chapter 7, Verse 76",
    "Chapter 8, Verse 1",
    "Chapter 8, Verse 2",
    "Chapter 8, Verse 3",
    "Chapter 8, Verse 4",
    "Chapter 8, Verse 5",
    "Chapter 8, Verse 6",
    "Chapter 8, Verse 7",
    "Chapter 8, Verse 8",
    "Chapter 8, Verse 9",
    "Chapter 8, Verse 10",
    "Chapter 8, Verse 11",
    "Chapter 8, Verse 12",
    "Chapter 8, Verse 13",
    "Chapter 8, Verse 14",
    "Chapter 8, Verse 15",
    "Chapter 8, Verse 16",
    "Chapter 8, Verse 17",
    "Chapter 8, Verse 18",
    "Chapter 8, Verse 19",
    "Chapter 8, Verse 20",
    "Chapter 8, Verse 21",
    "Chapter 8, Verse 22",
    "Chapter 8, Verse 23",
    "Chapter 8, Verse 24",
    "Chapter 8, Verse 25",
    "Chapter 8, Verse 26",
    "Chapter 8, Verse 27",
    "Chapter 8, Verse 28",
    "Chapter 8, Verse 29",
    "Chapter 8, Verse 30",
    "Chapter 8, Verse 31",
    "Chapter 8, Verse 32",
    "Chapter 8, Verse 33",
    "Chapter 8, Verse 34",
    "Chapter 8, Verse 35",
    "Chapter 8, Verse 36",
    "Chapter 8, Verse 37",
    "Chapter 8, Verse 38",
    "Chapter 8, Verse 39",
    "Chapter 8, Verse 40",
    "Chapter 8, Verse 41",
    "Chapter 8, Verse 42",
    "Chapter 8, Verse 43",
    "Chapter 8, Verse 44",
    "Chapter 8, Verse 45",
    "Chapter 8, Verse 46",
    "Chapter 8, Verse 47",
    "Chapter 8, Verse 48",
    "Chapter 8, Verse 49",
    "Chapter 8, Verse 50",
    "Chapter 8, Verse 51",
    "Chapter 8, Verse 52",
    "Chapter 8, Verse 53",
    "Chapter 8, Verse 54",
    "Chapter 8, Verse 55",
    "Chapter 8, Verse 56",
    "Chapter 8, Verse 57",
    "Chapter 8, Verse 58",
    "Chapter 8, Verse 59",
    "Chapter 8, Verse 60",
    "Chapter 8, Verse 61",
    "Chapter 8, Verse 62",
    "Chapter 8, Verse 63",
    "Chapter 8, Verse 64",
    "Chapter 8, Verse 65",
    "Chapter 8, Verse 66",
    "Chapter 8, Verse 67",
    "Chapter 8, Verse 68",
    "Chapter 8, Verse 69",
    "Chapter 8, Verse 70",
    "Chapter 8, Verse 71",
    "Chapter 8, Verse 72",
    "Chapter 8, Verse 73",
    "Chapter 8, Verse 74",
    "Chapter 8, Verse 75",
    "Chapter 8, Verse 76",
    "Chapter 8, Verse 77",
    "Chapter 8, Verse 78",
    "Chapter 8, Verse 79",
    "Chapter 8, Verse 80",
    "Chapter 8, Verse 81",
    "Chapter 8, Verse 82",
    "Chapter 8, Verse 83",
    "Chapter 8, Verse 84",
    "Chapter 8, Verse 85",
    "Chapter 8, Verse 86",
    "Chapter 8, Verse 87",
    "Chapter 8, Verse 88",
    "Chapter 8, Verse 89",
    "Chapter 8, Verse 90",
    "Chapter 8, Verse 91",
    "Chapter 8, Verse 92",
    "Chapter 8, Verse 93",
    "Chapter 8, Verse 94",
    "Chapter 8, Verse 95",
    "Chapter 8, Verse 96",
    "Chapter 8, Verse 97",
    "Chapter 8, Verse 98",
    "Chapter 8, Verse 99",
    "Chapter 8, Verse 100",
    "Chapter 8, Verse 101",
    "Chapter 8, Verse 102",
    "Chapter 8, Verse 103",
    "Chapter 8, Verse 104",
    "Chapter 8, Verse 105",
    "Chapter 8, Verse 106",
    "Chapter 8, Verse 107",
    "Chapter 8, Verse 108",
    "Chapter 8, Verse 109",
    "Chapter 8, Verse 110",
    "Chapter 8, Verse 111",
    "Chapter 8, Verse 112",
    "Chapter 8, Verse 113",
    "Chapter 8, Verse 114",
    "Chapter 8, Verse 115",
    "Chapter 8, Verse 116",
    "Chapter 8, Verse 117",
    "Chapter 8, Verse 118",
    "Chapter 8, Verse 119",
    "Chapter 8, Verse 120",
    "Chapter 8, Verse 121",
    "Chapter 8, Verse 122",
    "Chapter 8, Verse 123",
    "Chapter 8, Verse 124",
    "Chapter 8, Verse 125",
    "Chapter 8, Verse 126",
    "Chapter 8, Verse 127",
    "Chapter 8, Verse 128",
    "Chapter 8, Verse 129",
    "Chapter 8, Verse 130",
    "Chapter 8, Verse 131",
    "Chapter 8, Verse 132",
    "Chapter 8, Verse 133",
    "Chapter 8, Verse 134",
    "Chapter 8, Verse 135",
    "Chapter 8, Verse 136",
    "Chapter 8, Verse 137",
    "Chapter 8, Verse 138",
    "Chapter 8, Verse 139",
    "Chapter 8, Verse 140",
    "Chapter 8, Verse 141",
    "Chapter 8, Verse 142",
    "Chapter 8, Verse 143",
    "Chapter 8, Verse 144",
    "Chapter 8, Verse 145",
    "Chapter 8, Verse 146",
    "Chapter 8, Verse 147",
    "Chapter 8, Verse 148",
    "Chapter 8, Verse 149",
    "Chapter 8, Verse 150",
    "Chapter 8, Verse 151",
    "Chapter 8, Verse 152",
    "Chapter 8, Verse 153",
    "Chapter 8, Verse 154",
    "Chapter 8, Verse 155",
    "Chapter 8, Verse 156",
    "Chapter 8, Verse 157",
    "Chapter 8, Verse 158",
    "Chapter 8, Verse 159",
    "Chapter 8, Verse 160",
    "Chapter 8, Verse 161",
    "Chapter 8, Verse 162",
    "Chapter 8, Verse 163",
    "Chapter 8, Verse 164",
    "Chapter 8, Verse 165",
    "Chapter 8, Verse 166",
    "Chapter 8, Verse 167",
    "Chapter 8, Verse 168",
    "Chapter 8, Verse 169",
    "Chapter 8, Verse 170",
    "Chapter 8, Verse 171",
    "Chapter 8, Verse 172",
    "Chapter 8, Verse 173",
    "Chapter 8, Verse 174",
    "Chapter 8, Verse 175",
    "Chapter 8, Verse 176",
    "Chapter 8, Verse 177",
    "Chapter 8, Verse 178",
    "Chapter 8, Verse 179",
    "Chapter 8, Verse 180",
    "Chapter 8, Verse 181",
    "Chapter 8, Verse 182",
    "Chapter 8, Verse 183",
    "Chapter 8, Verse 184",
    "Chapter 8, Verse 185",
    "Chapter 8, Verse 186",
    "Chapter 8, Verse 187",
    "Chapter 9, Verse 1",
    "Chapter 9, Verse 2",
    "Chapter 9, Verse 3",
    "Chapter 9, Verse 4",
    "Chapter 9, Verse 5",
    "Chapter 9, Verse 6",
    "Chapter 9, Verse 7",
    "Chapter 9, Verse 8",
    "Chapter 9, Verse 9",
    "Chapter 9, Verse 10",
    "Chapter 9, Verse 11",
    "Chapter 9, Verse 12",
    "Chapter 9, Verse 13",
    "Chapter 9, Verse 14",
    "Chapter 9, Verse 15",
    "Chapter 9, Verse 16",
    "Chapter 9, Verse 17",
    "Chapter 9, Verse 18",
    "Chapter 9, Verse 19",
    "Chapter 9, Verse 20",
    "Chapter 9, Verse 21",
    "Chapter 9, Verse 22",
    "Chapter 9, Verse 23",
    "Chapter 9, Verse 24",
    "Chapter 9, Verse 25",
    "Chapter 9, Verse 26",
    "Chapter 9, Verse 27",
    "Chapter 9, Verse 28",
    "Chapter 9, Verse 29",
    "Chapter 9, Verse 30",
    "Chapter 9, Verse 31",
    "Chapter 9, Verse 32",
    "Chapter 9, Verse 33",
    "Chapter 9, Verse 34",
    "Chapter 9, Verse 35",
    "Chapter 9, Verse 36",
    "Chapter 9, Verse 37",
    "Chapter 9, Verse 38",
    "Chapter 9, Verse 39",
    "Chapter 9, Verse 40",
    "Chapter 9, Verse 41",
    "Chapter 9, Verse 42",
    "Chapter 9, Verse 43",
    "Chapter 9, Verse 44",
    "Chapter 9, Verse 45",
    "Chapter 9, Verse 46",
    "Chapter 9, Verse 47",
    "Chapter 9, Verse 48",
    "Chapter 9, Verse 49",
    "Chapter 9, Verse 50",
    "Chapter 9, Verse 51",
    "Chapter 9, Verse 52",
    "Chapter 9, Verse 53",
    "Chapter 9, Verse 54",
    "Chapter 9, Verse 55",
    "Chapter 9, Verse 56",
    "Chapter 9, Verse 57",
    "Chapter 9, Verse 58",
    "Chapter 9, Verse 59",
    "Chapter 9, Verse 60",
    "Chapter 9, Verse 61",
    "Chapter 9, Verse 62",
    "Chapter 9, Verse 63",
    "Chapter 9, Verse 64",
    "Chapter 9, Verse 65",
    "Chapter 9, Verse 66",
    "Chapter 9, Verse 67",
    "Chapter 9, Verse 68",
    "Chapter 9, Verse 69",
    "Chapter 9, Verse 70",
    "Chapter 9, Verse 71",
    "Chapter 9, Verse 72",
    "Chapter 9, Verse 73",
    "Chapter 9, Verse 74",
    "Chapter 9, Verse 75",
    "Chapter 9, Verse 76",
    "Chapter 9, Verse 77",
    "Chapter 9, Verse 78",
    "Chapter 9, Verse 79",
    "Chapter 9, Verse 80",
    "Chapter 9, Verse 81",
    "Chapter 9, Verse 82",
    "Chapter 9, Verse 83",
    "Chapter 9, Verse 84",
    "Chapter 9, Verse 85",
    "Chapter 9, Verse 86",
    "Chapter 9, Verse 87",
    "Chapter 9, Verse 88",
    "Chapter 9, Verse 89",
    "Chapter 9, Verse 90",
    "Chapter 9, Verse 91",
    "Chapter 9, Verse 92",
    "Chapter 9, Verse 93",
    "Chapter 9, Verse 94",
    "Chapter 9, Verse 95",
    "Chapter 9, Verse 96",
    "Chapter 9, Verse 97",
    "Chapter 9, Verse 98",
    "Chapter 9, Verse 99",
    "Chapter 9, Verse 100",
    "Chapter 9, Verse 101",
    "Chapter 9, Verse 102",
    "Chapter 9, Verse 103",
    "Chapter 9, Verse 104",
    "Chapter 9, Verse 105",
    "Chapter 9, Verse 106",
    "Chapter 9, Verse 107",
    "Chapter 9, Verse 108",
    "Chapter 9, Verse 109",
    "Chapter 9, Verse 110",
    "Chapter 9, Verse 111",
    "Chapter 9, Verse 112",
    "Chapter 9, Verse 113",
    "Chapter 9, Verse 114",
    "Chapter 9, Verse 115",
    "Chapter 9, Verse 116",
    "Chapter 9, Verse 117",
    "Chapter 9, Verse 118",
    "Chapter 9, Verse 119",
    "Chapter 9, Verse 120",
    "Chapter 9, Verse 121",
    "Chapter 9, Verse 122",
    "Chapter 9, Verse 123",
    "Chapter 9, Verse 124",
    "Chapter 9, Verse 125",
    "Chapter 9, Verse 126",
    "Chapter 9, Verse 127",
    "Chapter 9, Verse 128",
    "Chapter 9, Verse 129",
    "Chapter 9, Verse 130",
    "Chapter 9, Verse 131",
    "Chapter 9, Verse 132",
    "Chapter 9, Verse 133",
    "Chapter 9, Verse 134",
    "Chapter 9, Verse 135",
    "Chapter 9, Verse 136",
    "Chapter 9, Verse 137",
    "Chapter 9, Verse 138",
    "Chapter 9, Verse 139",
    "Chapter 9, Verse 140",
    "Chapter 9, Verse 141",
    "Chapter 9, Verse 142",
    "Chapter 9, Verse 143",
    "Chapter 9, Verse 144",
    "Chapter 9, Verse 145",
    "Chapter 9, Verse 146",
    "Chapter 9, Verse 147",
    "Chapter 9, Verse 148",
    "Chapter 9, Verse 149",
    "Chapter 9, Verse 150",
    "Chapter 9, Verse 151",
    "Chapter 9, Verse 152",
    "Chapter 9, Verse 153",
    "Chapter 9, Verse 154",
    "Chapter 9, Verse 155",
    "Chapter 9, Verse 156",
    "Chapter 9, Verse 157",
    "Chapter 9, Verse 158",
    "Chapter 9, Verse 159",
    "Chapter 9, Verse 160",
    "Chapter 9, Verse 161",
    "Chapter 9, Verse 162",
    "Chapter 9, Verse 163",
    "Chapter 9, Verse 164",
    "Chapter 9, Verse 165",
    "Chapter 9, Verse 166",
    "Chapter 9, Verse 167",
    "Chapter 10, Verse 1",
    "Chapter 10, Verse 2",
    "Chapter 10, Verse 3",
    "Chapter 10, Verse 4",
    "Chapter 10, Verse 5",
    "Chapter 10, Verse 6",
    "Chapter 10, Verse 7",
    "Chapter 10, Verse 8",
    "Chapter 10, Verse 9",
    "Chapter 10, Verse 10",
    "Chapter 10, Verse 11",
    "Chapter 10, Verse 12",
    "Chapter 10, Verse 13",
    "Chapter 10, Verse 14",
    "Chapter 10, Verse 15",
    "Chapter 10, Verse 16",
    "Chapter 10, Verse 17",
    "Chapter 10, Verse 18",
    "Chapter 10, Verse 19",
    "Chapter 10, Verse 20",
    "Chapter 10, Verse 21",
    "Chapter 10, Verse 22",
    "Chapter 10, Verse 23",
    "Chapter 10, Verse 24",
    "Chapter 10, Verse 25",
    "Chapter 10, Verse 26",
    "Chapter 10, Verse 27",
    "Chapter 10, Verse 28",
    "Chapter 10, Verse 29",
    "Chapter 10, Verse 30",
    "Chapter 10, Verse 31",
    "Chapter 10, Verse 32",
    "Chapter 10, Verse 33",
    "Chapter 10, Verse 34",
    "Chapter 10, Verse 35",
    "Chapter 10, Verse 36",
    "Chapter 10, Verse 37",
    "Chapter 10, Verse 38",
    "Chapter 10, Verse 39",
    "Chapter 10, Verse 40",
    "Chapter 10, Verse 41",
    "Chapter 10, Verse 42",
    "Chapter 10, Verse 43",
    "Chapter 10, Verse 44",
    "Chapter 10, Verse 45",
    "Chapter 10, Verse 46",
    "Chapter 10, Verse 47",
    "Chapter 10, Verse 48",
    "Chapter 10, Verse 49",
    "Chapter 10, Verse 50",
    "Chapter 10, Verse 51",
    "Chapter 10, Verse 52",
    "Chapter 10, Verse 53",
    "Chapter 10, Verse 54",
    "Chapter 10, Verse 55",
    "Chapter 10, Verse 56",
    "Chapter 10, Verse 57",
    "Chapter 10, Verse 58"
  ],
  "refs": [
    "1.1",
    "1.2",
    "1.3",
    "1.4",
    "1.5",
    "1.6",
    "1.7",
    "1.8",
    "1.9",
    "1.10",
    "1.11",
    "1.12",
    "1.13",
    "1.14",
    "1.15",
    "1.16",
    "1.17",
    "1.18",
    "1.19",
    "1.20",
    "1.21",
    "1.22",
    "1.23",
    "1.24",
    "1.25",
    "1.26",
    "1.27",
    "1.28",
    "1.29",
    "1.30",
    "1.31",
    "1.32",
    "1.33",
    "1.34",
    "1.35",
    "1.36",
    "2.1",
    "2.2",
    "2.3",
    "2.4",
    "2.5",
    "2.6",
    "2.7",
    "2.8",
    "2.9",
    "2.10",
    "2.11",
    "2.12",
    "2.13",
    "2.14",
    "2.15",
    "2.16",
    "2.17",
    "2.18",
    "2.19",
    "2.20",
    "2.21",
    "2.22",
    "2.23",
    "2.24",
    "2.25",
    "2.26",
    "2.27",
    "2.28",
    "2.29",
    "2.30",
    "2.31",
    "2.32",
    "2.33",
    "2.34",
    "2.35",
    "2.36",
    "2.37",
    "2.38",
    "2.39",
    "2.40",
    "2.41",
    "2.42",
    "2.43",
    "2.44",
    "2.45",
    "2.46",
    "2.47",
    "2.48",
    "2.49",
    "2.50",
    "2.51",
    "2.52",
    "2.53",
    "2.54",
    "2.55",
    "2.56",
    "2.57",
    "2.58",
    "2.59",
    "2.60",
    "2.61",
    "2.62",
    "2.63",
    "2.64",
    "2.65",
    "3.1",
    "3.2",
    "3.3",
    "3.4",
    "3.5",
    "3.6",
    "3.7",
    "3.8",
    "3.9",
    "3.10",
    "3.11",
    "3.12",
    "3.13",
    "3.14",
    "3.15",
    "3.16",
    "3.17",
    "3.18",
    "3.19",
    "3.20",
    "3.21",
    "3.22",
    "3.23",
    "3.24",
    "3.25",
    "3.26",
    "3.27",
    "3.28",
    "3.29",
    "3.30",
    "3.31",
    "3.32",
    "3.33",
    "3.34",
    "4.1",
    "4.2",
    "4.3",
    "4.4",
    "4.5",
    "4.6",
    "4.7",
    "4.8",
    "4.9",
    "4.10",
    "4.11",
    "4.12",
    "4.13",
    "4.14",
    "4.15",
    "4.16",
    "4.17",
    "4.18",
    "4.19",
    "4.20",
    "4.21",
    "4.22",
    "4.23",
    "4.24",
    "4.25",
    "4.26",
    "4.27",
    "4.28",
    "4.29",
    "4.30",
    "4.31",
    "4.32",
    "4.33",
    "4.34",
    "4.35",
    "4.36",
    "4.37",
    "4.38",
    "4.39",
    "4.40",
    "4.41",
    "4.42",
    "4.43",
    "4.44",
    "4.45",
    "4.46",
    "4.47",
    "4.48",
    "5.1",
    "5.2",
    "5.3",
    "5.4",
    "5.5",
    "5.6",
    "5.7",
    "5.8",
    "5.9",
    "5.10",
    "5.11",
    "5.12",
    "5.13",
    "5.14",
    "5.15",
    "5.16",
    "5.17",
    "5.18",
    "5.19",
    "5.20",
    "5.21",
    "5.22",
    "5.23",
    "5.24",
    "5.25",
    "5.26",
    "5.27",
    "5.28",
    "5.29",
    "5.30",
    "5.31",
    "5.32",
    "5.33",
    "5.34",
    "5.35",
    "5.36",
    "5.37",
    "5.38",
    "5.39",
    "5.40",
    "5.41",
    "5.42",
    "5.43",
    "5.44",
    "5.45",
    "5.46",
    "5.47",
    "5.48",
    "5.49",
    "5.50",
    "5.51",
    "5.52",
    "5.53",
    "5.54",
    "5.55",
    "5.56",
    "5.57",
    "5.58",
    "5.59",
    "5.60",
    "5.61",
    "5.62",
    "5.63",
    "5.64",
    "5.65",
    "5.66",
    "5.67",
    "5.68",
    "5.69",
    "5.70",
    "5.71",
    "5.72",
    "5.73",
    "5.74",
    "5.75",
    "5.76",
    "5.77",
    "5.78",
    "5.79",
    "5.80",
    "5.81",
    "5.82",
    "5.83",
    "5.84",
    "5.85",
    "5.86",
    "5.87",
    "5.88",
    "5.89",
    "5.90",
    "5.91",
    "5.92",
    "5.93",
    "5.94",
    "5.95",
    "5.96",
    "5.97",
    "5.98",
    "5.99",
    "5.100",
    "5.101",
    "5.102",
    "5.103",
    "5.104",
    "5.105",
    "5.106",
    "5.107",
    "5.108",
    "5.109",
    "6.1",
    "6.2",
    "6.3",
    "6.4",
    "6.5",
    "6.6",
    "6.7",
    "6.8",
    "6.9",
    "6.10",
    "6.11",
    "6.12",
    "6.13",
    "6.14",
    "6.15",
    "6.16",
    "6.17",
    "6.18",
    "6.19",
    "6.20",
    "6.21",
    "6.22",
    "6.23",
    "6.24",
    "6.25",
    "6.26",
    "6.27",
    "6.28",
    "6.29",
    "6.30",
    "6.31",
    "6.32",
    "6.33",
    "6.34",
    "6.35",
    "6.36",
    "6.37",
    "6.38",
    "6.39",
    "6.40",
    "6.41",
    "6.42",
    "6.43",
    "6.44",
    "6.45",
    "6.46",
    "6.47",
    "6.48",
    "6.49",
    "6.50",
    "6.51",
    "6.52",
    "6.53",
    "6.54",
    "6.55",
    "6.56",
    "6.57",
    "6.58",
    "6.59",
    "6.60",
    "6.61",
    "6.62",
    "6.63",
    "6.64",
    "6.65",
    "6.66",
    "6.67",
    "6.68",
    "6.69",
    "6.70",
    "6.71",
    "6.72",
    "6.73",
    "6.74",
    "6.75",
    "6.76",
    "6.77",
    "6.78",
    "6.79",
    "6.80",
    "6.81",
    "6.82",
    "6.83",
    "6.84",
    "6.85",
    "6.86",
    "6.87",
    "6.88",
    "6.89",
    "6.90",
    "6.91",
    "6.92",
    "6.93",
    "6.94",
    "6.95",
    "6.96",
    "6.97",
    "6.98",
    "6.99",
    "6.100",
    "6.101",
    "6.102",
    "6.103",
    "6.104",
    "6.105",
    "6.106",
    "6.107",
    "6.108",
    "6.109",
    "6.110",
    "6.111",
    "6.112",
    "6.113",
    "6.114",
    "6.115",
    "6.116",
    "6.117",
    "6.118",
    "6.119",
    "6.120",
    "6.121",
    "6.122",
    "6.123",
    "6.124",
    "6.125",
    "6.126",
    "6.127",
    "6.128",
    "6.129",
    "6.130",
    "6.131",
    "6.132",
    "6.133",
    "6.134",
    "7.1",
    "7.2",
    "7.3",
    "7.4",
    "7.5",
    "7.6",
    "7.7",
    "7.8",
    "7.9",
    "7.10",
    "7.11",
    "7.12",
    "7.13",
    "7.14",
    "7.15",
    "7.16",
    "7.17",
    "7.18",
    "7.19",
    "7.20",
    "7.21",
    "7.22",
    "7.23",
    "7.24",
    "7.25",
    "7.26",
    "7.27",
    "7.28",
    "7.29",
    "7.30",
    "7.31",
    "7.32",
    "7.33",
    "7.34",
    "7.35",
    "7.36",
    "7.37",
    "7.38",
    "7.39",
    "7.40",
    "7.41",
    "7.42",
    "7.43",
    "7.44",
    "7.45",
    "7.46",
    "7.47",
    "7.48",
    "7.49",
    "7.50",
    "7.51",
    "7.52",
    "7.53",
    "7.54",
    "7.55",
    "7.56",
    "7.57",
    "7.58",
    "7.59",
    "7.60",
    "7.61",
    "7.62",
    "7.63",
    "7.64",
    "7.65",
    "7.66",
    "7.67",
    "7.68",
    "7.69",
    "7.70",
    "7.71",
    "7.72",
    "7.73",
    "7.74",
    "7.75",
    "7.76",
    "8.1",
    "8.2",
    "8.3",
    "8.4",
    "8.5",
    "8.6",
    "8.7",
    "8.8",
    "8.9",
    "8.10",
    "8.11",
    "8.12",
    "8.13",
    "8.14",
    "8.15",
    "8.16",
    "8.17",
    "8.18",
    "8.19",
    "8.20",
    "8.21",
    "8.22",
    "8.23",
    "8.24",
    "8.25",
    "8.26",
    "8.27",
    "8.28",
    "8.29",
    "8.30",
    "8.31",
    "8.32",
    "8.33",
    "8.34",
    "8.35",
    "8.36",
    "8.37",
    "8.38",
    "8.39",
    "8.40",
    "8.41",
    "8.42",
    "8.43",
    "8.44",
    "8.45",
    "8.46",
    "8.47",
    "8.48",
    "8.49",
    "8.50",
    "8.51",
    "8.52",
    "8.53",
    "8.54",
    "8.55",
    "8.56",
    "8.57",
    "8.58",
    "8.59",
    "8.60",
    "8.61",
    "8.62",
    "8.63",
    "8.64",
    "8.65",
    "8.66",
    "8.67",
    "8.68",
    "8.69",
    "8.70",
    "8.71",
    "8.72",
    "8.73",
    "8.74",
    "8.75",
    "8.76",
    "8.77",
    "8.78",
    "8.79",
    "8.80",
    "8.81",
    "8.82",
    "8.83",
    "8.84",
    "8.85",
    "8.86",
    "8.87",
    "8.88",
    "8.89",
    "8.90",
    "8.91",
    "8.92",
    "8.93",
    "8.94",
    "8.95",
    "8.96",
    "8.97",
    "8.98",
    "8.99",
    "8.100",
    "8.101",
    "8.102",
    "8.103",
    "8.104",
    "8.105",
    "8.106",
    "8.107",
    "8.108",
    "8.109",
    "8.110",
    "8.111",
    "8.112",
    "8.113",
    "8.114",
    "8.115",
    "8.116",
    "8.117",
    "8.118",
    "8.119",
    "8.120",
    "8.121",
    "8.122",
    "8.123",
    "8.124",
    "8.125",
    "8.126",
    "8.127",
    "8.128",
    "8.129",
    "8.130",
    "8.131",
    "8.132",
    "8.133",
    "8.134",
    "8.135",
    "8.136",
    "8.137",
    "8.138",
    "8.139",
    "8.140",
    "8.141",
    "8.142",
    "8.143",
    "8.144",
    "8.145",
    "8.146",
    "8.147",
    "8.148",
    "8.149",
    "8.150",
    "8.151",
    "8.152",
    "8.153",
    "8.154",
    "8.155",
    "8.156",
    "8.157",
    "8.158",
    "8.159",
    "8.160",
    "8.161",
    "8.162",
    "8.163",
    "8.164",
    "8.165",
    "8.166",
    "8.167",
    "8.168",
    "8.169",
    "8.170",
    "8.171",
    "8.172",
    "8.173",
    "8.174",
    "8.175",
    "8.176",
    "8.177",
    "8.178",
    "8.179",
    "8.180",
    "8.181",
    "8.182",
    "8.183",
    "8.184",
    "8.185",
    "8.186",
    "8.187",
    "9.1",
    "9.2",
    "9.3",
    "9.4",
    "9.5",
    "9.6",
    "9.7",
    "9.8",
    "9.9",
    "9.10",
    "9.11",
    "9.12",
    "9.13",
    "9.14",
    "9.15",
    "9.16",
    "9.17",
    "9.18",
    "9.19",
    "9.20",
    "9.21",
    "9.22",
    "9.23",
    "9.24",
    "9.25",
    "9.26",
    "9.27",
    "9.28",
    "9.29",
    "9.30",
    "9.31",
    "9.32",
    "9.33",
    "9.34",
    "9.35",
    "9.36",
    "9.37",
    "9.38",
    "9.39",
    "9.40",
    "9.41",
    "9.42",
    "9.43",
    "9.44",
    "9.45",
    "9.46",
    "9.47",
    "9.48",
    "9.49",
    "9.50",
    "9.51",
    "9.52",
    "9.53",
    "9.54",
    "9.55",
    "9.56",
    "9.57",
    "9.58",
    "9.59",
    "9.60",
    "9.61",
    "9.62",
    "9.63",
    "9.64",
    "9.65",
    "9.66",
    "9.67",
    "9.68",
    "9.69",
    "9.70",
    "9.71",
    "9.72",
    "9.73",
    "9.74",
    "9.75",
    "9.76",
    "9.77",
    "9.78",
    "9.79",
    "9.80",
    "9.81",
    "9.82",
    "9.83",
    "9.84",
    "9.85",
    "9.86",
    "9.87",
    "9.88",
    "9.89",
    "9.90",
    "9.91",
    "9.92",
    "9.93",
    "9.94",
    "9.95",
    "9.96",
    "9.97",
    "9.98",
    "9.99",
    "9.100",
    "9.101",
    "9.102",
    "9.103",
    "9.104",
    "9.105",
    "9.106",
    "9.107",
    "9.108",
    "9.109",
    "9.110",
    "9.111",
    "9.112",
    "9.113",
    "9.114",
    "9.115",
    "9.116",
    "9.117",
    "9.118",
    "9.119",
    "9.120",
    "9.121",
    "9.122",
    "9.123",
    "9.124",
    "9.125",
    "9.126",
    "9.127",
    "9.128",
    "9.129",
    "9.130",
    "9.131",
    "9.132",
    "9.133",
    "9.134",
    "9.135",
    "9.136",
    "9.137",
    "9.138",
    "9.139",
    "9.140",
    "9.141",
    "9.142",
    "9.143",
    "9.144",
    "9.145",
    "9.146",
    "9.147",
    "9.148",
    "9.149",
    "9.150",
    "9.151",
    "9.152",
    "9.153",
    "9.154",
    "9.155",
    "9.156",
    "9.157",
    "9.158",
    "9.159",
    "9.160",
    "9.161",
    "9.162",
    "9.163",
    "9.164",
    "9.165",
    "9.166",
    "9.167",
    "10.1",
    "10.2",
    "10.3",
    "10.4",
    "10.5",
    "10.6",
    "10.7",
    "10.8",
    "10.9",
    "10.10",
    "10.11",
    "10.12",
    "10.13",
    "10.14",
    "10.15",
    "10.16",
    "10.17",
    "10.18",
    "10.19",
    "10.20",
    "10.21",
    "10.22",
    "10.23",
    "10.24",
    "10.25",
    "10.26",
    "10.27",
    "10.28",
    "10.29",
    "10.30",
    "10.31",
    "10.32",
    "10.33",
    "10.34",
    "10.35",
    "10.36",
    "10.37",
    "10.38",
    "10.39",
    "10.40",
    "10.41",
    "10.42",
    "10.43",
    "10.44",
    "10.45",
    "10.46",
    "10.47",
    "10.48",
    "10.49",
    "10.50",
    "10.51",
    "10.52",
    "10.53",
    "10.54",
    "10.55",
    "10.56",
    "10.57",
    "10.58"
  ],
  "chapters": [
    {
      "number": 1,
      "title": "In Praise of Bodhicitta",
      "startVerseIndex": 0,
      "endVerseIndex": 36
    },
    {
      "number": 2,
      "title": "Confession of Faults",
      "startVerseIndex": 36,
      "endVerseIndex": 101
    },
    {
      "number": 3,
      "title": "Fully Holding Bodhicitta",
      "startVerseIndex": 101,
      "endVerseIndex": 135
    },
    {
      "number": 4,
      "title": "Concern",
      "startVerseIndex": 135,
      "endVerseIndex": 183
    },
    {
      "number": 5,
      "title": "Clear Comprehension",
      "startVerseIndex": 183,
      "endVerseIndex": 292
    },
    {
      "number": 6,
      "title": "Patience",
      "startVerseIndex": 292,
      "endVerseIndex": 426
    },
    {
      "number": 7,
      "title": "Effort",
      "startVerseIndex": 426,
      "endVerseIndex": 502
    },
    {
      "number": 8,
      "title": "Meditation",
      "startVerseIndex": 502,
      "endVerseIndex": 689
    },
    {
      "number": 9,
      "title": "Wisdom",
      "startVerseIndex": 689,
      "endVerseIndex": 856
    },
    {
      "number": 10,
      "title": "Dedication",
      "startVerseIndex": 856,
      "endVerseIndex": 914
    }
  ]
}